Repository: 0000duck/linuxcnc
Catalog: docs/src/lathe/lathe-user.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = Lathe User Information
fr: = Particularités des tours

source: [[cha:lathe-user-information]] (((Lathe User Information)))
fr: [[cha:Tour-Specifiques]] (((Particularités des tours)))

source: This chapter attempts to bring together all the lathe specific information and is currently under construction.
fr: Ce chapitre va regrouper les informations spécifiques aux tours, il est encore en cours de rédaction.

source: == Lathe Mode
fr: == Mode tour

source: If your CNC machine is a lathe, there are some specific changes you will probably want to make to your ini file in order to get the best results from LinuxCNC.
fr: Si la machine CNC est un tour, il y aura quelques modifications spécifiques à faire dans le fichier ini pour obtenir les meilleurs résultats de LinuxCNC. Se référer à la section concernant la configuration du <<cha:ini-configuration,fichier ini>>

source: If you are using the AXIS display, have Axis display your lathe tools properly. See the INI Configuration section of the Integrator Manual for more details but you will probably want to make an entry like this to set up AXIS for Lathe Mode.
fr: Si l'interface graphique Axis est utilisée, pour que celui-ci représente correctement les axes et la position de l'outil, il conviendra d'éditer le fichier 'ini' et de modifier la section [DISPLAY] comme ceci:

source: # Tell the Axis Display our machine is a lathe. LATHE = TRUE ---------------------------------------
fr: # Pour indiquer à Axis que la machine est un tour (lathe). LATHE = TRUE ----

source: Lathe Mode in Axis does not set your default plane to G18 (XZ). You must program that in the preamble of each gcode file or (better) add it to your ini file, like this:
fr: Le mode tour dans Axis ne fixe pas le plan par défaut comme étant G18 (XZ). Il est nécessaire de l'ajouter dans le préambule de tout programmer G-code ou, encore mieux, de l'ajouter directement dans le fichier 'ini' comme cela:

source: # g-code modal codes (modes) that the interpreter is initialized with on startup RS274NGC_STARTUP_CODE = G18 G20 G90 ---------------------------------------
fr: # G-code modaux pour initialiser l'interpréteur RS274NGC_STARTUP_CODE = G18 G20 G90 ----

source: == Lathe Tool Table [[sec:lathe-tool-table]]
fr: == Table d'outils[[sec:lathe-tool-table]]

source: The "Tool Table" is a text file that contains information about each tool. The file is located in the same directory as your configuration and is called "tool.tbl" by default. The tools might be in a tool changer or just changed manually. The file can be edited with a text editor or be updated using G10 L1,L10,L11. There is also a built-in tool table editor in the Axis display. The maximum number of entries in the tool table is 56. The maximum tool and pocket number is 99999.
fr: La 'table d'outils' est un fichier texte qui contient les informations de chaque outil. Ce fichier se trouve dans le même répertoire que le fichier ini, il est appelé 'tool.tbl' par défaut. Les outils peuvent être dans un changeur d'outils ou simplement changés manuellement. Le fichier peut être édité avec un éditeur de texte ou être mis à jour en utilisant G10 L1, L10, L11. Axis peut aussi lancer l'éditeur de texte du système en y chargeant la table, l'opérateur peut ainsi intervenir directement sur les valeurs des outils. Le nombre maximum d'outils dans la table d'outils est de 56. Les numéros d'outil et de poches peuvent aller jusqu'à 99999.

source: Earlier versions of LinuxCNC had two different tool table formats for mills and lathes, but since the 2.4.x release, one tool table format is used for all machines. Just ignore the parts of the tool table that don't pertain to your machine, or which you don't need to use. For more information on the specifics of the tool table format, see the <<sec:tool-table,Tool Table>> Section.
fr: Les versions antérieures de LinuxCNC avaient deux différents formats de table d'outils pour les fraiseuses et les tours, mais depuis la version 2.4.x, un format de table d'outil unique est utilisé. Il faut juste ignorer les parties de la table d'outils qui ne concernent pas la machine. D'autres informations sont disponibles <<sec:Tool-Table-Format, sur le format de la table d'outils>>.

source: == Lathe Tool Orientation[[lathe-tool-orientation]]
fr: == Orientations des outils[[sec:Orientations-des-outils-de-tour]]

source: The following figure shows the lathe tool orientations with the center line angle of each orientation and info on FRONTANGLE and BACKANGLE. The FRONTANGLE and BACKANGLE are clockwise starting at a line parallel to Z+.
fr: La figure suivante montre les angles d'orientations des outils de tour ainsi que les informations sur l'angle frontal de l'arête de coupe (FRONTANGLE) et l'angle arrière de l'arête de coupe (BACKANGLE). Les positions vont croissantes dans le sens horaire par rapport à une ligne parallèle à l'axe Z, le zéro étant côté Z+.

source: .Lathe Tool Orientations[[cap:Lathe-Tool-Orientations]]
fr: .Orientations des outils de tournage[[cap:Lathe-Tool-Orientations]]

source: image::images/tool_positions.png[]
fr: image::images/tool_positions_fr.png[]

source: In AXIS the following figures show what the Tool Positions look like, as entered in the tool table.
fr: Les images ci-dessous montrent la représentation qu'Axis donne des orientations de l'outil, en se référant à la figure ci-dessus.

source: .Tool Positions 1, 2, 3 & 4[[fig:Tool-Positions-1-2-3-4]]
fr: .Outil dans les positions 1, 2, 3 et 4[[fig:Outil-Positions-1-2-3-4]]

source: .Tool Positions 5, 6, 7 & 8[[fig:Tool-Positions-5-6-7-8]]
fr: .Outil dans les positions 5, 6, 7 et 8[[fig:Outil-Positions-5-6-7-8]]

source: == Tool Touch Off
fr: == Toucher d'outil

source: When running in lathe mode in AXIS you can set the X and Z in the tool table using the Touch Off window. If you have a tool turret you normally have 'Touch off to fixture' selected when setting up your turret. When setting the material Z zero you have 'Touch off to material' selected. For more information on the G codes used for tools see <<sec:M6-Tool-Change,M6>>, <<sec:T-Select-Tool,Tn>>, and <<sec:G43,G43>>. For more information on tool touch off options in Axis see <<sec:tool-touch-off,Tool Touch Off>>.
fr: Quand AXIS est utilisé en mode tour, il est possible de corriger l'outil sur les axes X et Z. Les corrections sont alors introduites directement dans la table d'outils en utilisant le bouton 'Toucher' et sa fenêtre de dialogue. Avec un changeur d'outil, lorsqu'il est configuré, 'Toucher le porte-pièce' est normalement sélectionné. Pour faire l'origine pièce, sélectionner 'Toucher la pièce'. Pour le détail des G-codes utilisés pour les outils, voir <<sec:M6-Appel-Outil,M6>>, <<sec:T-Choix-Outil,Tn>> et <<sec:G43,G43>>. Pour des détails dur l'option Toucher d'Axis, se référer à <<cha:Axis,la documentation d'Axis>>.

source: === X Touch Off
fr: === Toucher d'outil en X

source: The X axis offset for each tool is normally an offset from the center line of the spindle.
fr: L'offset en X pour chaque outil correspond à un décalage de l'axe de la broche.

source: One method is to take your normal turning tool and turn down some stock to a known diameter. Using the Tool Touch Off window enter the measured diameter (or radius if in radius mode) for that tool. Then using some layout fluid or a marker to coat the part bring each tool up till it just touches the dye and set it's X offset to the diameter of the part used using the tool touch off. Make sure any tools in the corner quadrants have the nose radius set properly in the tool table so the control point is correct. Tool touch off automatically adds a G43 so the current tool is the current offset.
fr: Une méthode consiste à prendre un outil de tournage standard et usiner un diamètre. Mesurer exactement ce diamètre puis, sans toucher à l'axe X, dans la fenêtre qui s'ouvre, après un appui sur le bouton Toucher, saisir le diamètre mesuré, ou le rayon si c'est le mode en cours. Ensuite, à l'aide d'encre à tracer ou d'un marqueur, recouvrir une zone sur la pièce, faire tangenter l'outil à cet endroit pour qu'il touche juste la surface encrée, ajuster alors le décalage X au diamètre mesuré de la pièce en utilisant le bouton Toucher. S'assurer que le rayon de bec est bien défini dans la table d'outils, pour que le point contrôlé soit correct. Le Toucher ajoute automatiquement un G43, de sorte que l'offset s'applique immédiatement à l'outil courant.

source: A typical session might be:
fr: Séquence de compensation typique:

source: . Home each axis if not homed. . Set the current tool with 'Tn M6 G43' where 'n' is the tool number. . Select the X axis in the Manual Control window. . Move the X to a known position or take a test cut and measure the diameter. . Select Touch Off and pick Tool Table then enter the position or the diameter. . Follow the same sequence to correct the Z axis.
fr: . Prise d'origine machine de chacun des axes, si ce n'est pas déjà fait. . Déclarer l'outil avec 'Tn M6 G43' dans lequel 'n' est le numéro de l'outil courant, présent en table d'outils. . Sélectionner l'axe X dans la fenêtre de l'onglet Contrôle manuel (F3). . Déplacer l'axe X sur une position connue ou prendre une passe de test puis mesurer le diamètre obtenu. . Cliquer le bouton Toucher et choisir l'option Table d'outils, ce qui entrera la correction directement dans la table d'outil. . Recommencer la même séquence pour corriger l'axe Z.

source: Note: if you are in Radius Mode you must enter the radius, not the diameter.
fr: Remarque: si le mode rayon est le mode courant, il faut évidemment entrer le rayon et non pas le diamètre.

source: === Z Touch Off
fr: === Toucher d'outil en Z

source: The Z axis offsets can be a bit confusing at first because there are two elements to the Z offset. There is the tool table offset, and the machine coordinate offset. First we will look at the tool table offsets. One method is to use a fixed point on your lathe and set the Z offset for all tools from this point. Some use the spindle nose or chuck face. This gives you the ability to change to a new tool and set its Z offset without having to reset all the tools.
fr: L'offset de l'axe Z peut être un peu déroutant au premier abord car il est composé de deux éléments. Le premier est l'offset de la table d'outils, le second est l'offset des coordonnées machine. Nous allons d'abord examiner l'offset de la table d'outils. Une méthode consiste à utiliser un point fixe sur le tour et à ajuster l'offset Z de tous les outils à partir de ce point fixe. Certains utilisent le nez de broche ou la face du mandrin. Cela donne la possibilité de changer d'outil et d'ajuster son offset Z, sans avoir à réinitialiser tous les outils.

source: . Home each axis if not homed. . Make sure no offsets are in effect for the current coordinate system. . Set the current tool with 'Tn M6 G43' where 'n' is the tool number. . Select the Z axis in the Manual Control window. . Bring the tool close to the control surface. Using a cylinder move the Z away from the control surface until the cylinder just passes between the tool and the control surface. . Select Touch Off and pick Tool Table and set the position to 0.0. . Repeat for each tool using the same cylinder.
fr: . Prise d'origine machine de tous les axes, si ce n'est pas déjà fait. . S'assurer qu'aucune compensation n'est activée pour le système de coordonnées courant. . Déclarer l'outil avec 'Tn M6 G43' dans lequel 'n' est le numéro de l'outil courant, présent en table d'outils. . Sélectionner l'axe Z dans la fenêtre de l'onglet contrôle manuel (F3). . Approcher l'outil de la surface de référence. En utilisant un cylindre en guise de jauge, déplacer doucement le chariot pour que la jauge passe juste entre l'outil et la surface de contrôle. . Cliquer le bouton Toucher puis choisir Table d'outils et saisir la valeur 0.0. . Répéter l'opération pour chaque outil, en utilisant le même cylindre.

source: Now all the tools are offset the same distance from a standard position. If you change a tool like a drill bit you repeat the above and it is now in sync with the rest of the tools for Z offset. Some tools might require a bit of cyphering to determine the control point from the touch off point. For example, if you have a 0.125" wide parting tool and you touch the left side off but want the right to be Z0, then enter 0.125" in the touch off window.
fr: Maintenant, tous les outils sont compensés à la même distance, d'une position standard. Si un outil doit être changé, par exemple par un foret il suffira de répéter la séquence précédente pour qu'il soit synchronisé avec l'offset Z du reste des outils. Certains outils peuvent nécessiter un peu de réflexion pour déterminer le point contrôlé par rapport au point de Toucher. Par exemple, un outil de tronçonnage de 3.17mm d'épaisseur qui est touché sur le côté gauche, alors que l'opérateur veut Z0 sur le côté droit, il lui faudra alors saisir 3.17 dans la fenêtre du Toucher.

source: === The Z Machine Offset
fr: === Décalage en Z des coordonnées machine

source: Once all the tools have the Z offset entered into the tool table, you can use any tool to set the machine offset using the machine coordinate system.
fr: Une fois que tous les outils ont leurs décalages Z renseignés dans la table d'outils, il est possible d'utiliser n'importe quel outil présent en table d'outils pour ajuster le décalage du système de coordonnées machine.

source: . Home each axis if not homed. . Set the current tool with "Tn M6" where "n" is the tool number. . Issue a G43 so the current tool offset is in effect. . Bring the tool to the work piece and set the machine Z offset.
fr: . Prise d'origine machine de tous les axes, si ce n'est pas déjà fait. . Déclarer l'outil avec 'Tn M6' dans lequel 'n' est le numéro de l'outil courant, présent en table d'outils. . Envoyer un G43 pour que l'offset de l'outil soit effectif. (voir ci-dessous) . Tangenter l'outil contre la pièce et fixer l'offset machine Z.

source: If you forget to set the G43 for the current tool when you set the machine coordinate system offset, you will not get what you expect, as the tool offset will be added to the current offset when the tool is used in your program.
fr: Ne pas oublier d'envoyer le G43 sur l'outil *avant* de définir le décalage du système de coordonnées machine, les résultats ne seraient pas ceux attendus... puisque la compensation de l'outil serait ajoutée à l'offset courant lorsque l'outil sera utilisé dans le programme.

source: == Spindle Synchronized Motion
fr: == Mouvements avec broche synchronisée

source: Spindle synchronized motion requires a quadrature encoder connected to the spindle with one index pulse per revolution. See the motion man page and Spindle Control Example in integrators manual for more information.
fr: Sur un tour, les mouvements avec broche synchronisée nécessitent un signal de retour entre la broche et LinuxCNC. Généralement, c'est un codeur en quadrature qui fourni ce retour. Le manuel donne des explications sur l'utilisation des codeurs de broche.

source: .Threading The G76 threading cycle is used for both internal and external threads. For more information see the <<sec:G76-Threading-Canned,G76>> Section.
fr: .Filetage Le cycle de filetage G76 est utilisé, tant en filetage intérieur qu'en filetage extérieur, voir <<sec:G76-Filetage, la section G76>>.

source: .Constant Surface Speed CSS or Constant Surface Speed uses the machine X origin modified by the tool X offset to compute the spindle speed in RPM. CSS will track changes in tool offsets. The X machine origin should be when the reference tool (the one with zero offset) is at the center of rotation. For more information see the <<sec:G96-G97-Spindle,G96>> Section.
fr: .Vitesse de coupe à surface constante La vitesse de coupe à surface constante (CSS) utilise l'origine machine X modifiée par l'offset d'outil X, pour calculer la vitesse de rotation de la broche en tr/mn. La vitesse de coupe à surface constante permet de suivre les changements d'offset de l'outil. L'emplacement de l'origine machine de l'axe X doit être sur l'axe de rotation et doit se faire avec l'outil de référence (celui qui a l'offset à zéro). Plus d'informations sont dans la section <<sec:G96-G97-Broche,G96>>.

source: .Feed per Revolution Feed per revolution will move the Z axis by the F amount per revolution. This is not for threading, use G76 for threading. For more information see the <<sec:G93-G94-G95-Mode,G95>> Section.
fr: .Avance par tour L'avance par tour déplace l'axe Z de la valeur de F à chaque tour. Ce n'est pas destiné au filetage pour lequel il faut utiliser G76. D'autres informations sont dans la section sur <<sec:G93-G94-G95-Modes,G95>>.

source: Calculating arcs can be mind challenging enough without considering radius and diameter mode on lathes as well as machine coordinate system orientation. The following applies to center format arcs. On a lathe you should include G18 in your preamble as the default is G17 even if you're in lathe mode, in the user interface Axis. Arcs in G18 XZ plane use I (X axis) and K (Z axis) offsets.
fr: Le calcul des arcs peut être un exercice assez compliqué, même sur un tour, sans considérer les modes rayon et diamètre, ni l'orientation du système de coordonnées machine. Ce qui suit s'applique à des arcs au format centre. Sur un tour, il faut inclure G18 dans le préambule du programme G-code pour remplacer le G17 par défaut, le fait d'être en mode tour dans Axis ne suffit pas. Les arcs en G18, plan XZ utilisent les offsets pour I (l'axe X) et K (l'axe Z).

source: === Arcs and Lathe Design
fr: === Les arcs et la cinématique du tour

source: The typical lathe has the spindle on the left of the operator and the tools on the operator side of the spindle center line. This is typically set up with the imaginary Y axis (+) pointing at the floor.
fr: Le tour classique a la broche à gauche de l'opérateur et l'outil est frontal, entre l'opérateur et le centre de rotation du mandrin. C'est un agencement avec un axe Y(+) imaginaire pointant vers le sol.

source: The following will be true on this type of setup:
fr: Ce qui suit est valable pour ce type d'agencement:

source: The Z axis (+) points to the right, away from the spindle.
fr: Le côté positif de l'axe Z pointe vers la droite, en s'éloignant de la broche.

source: The X axis (+) points toward the operator, and when on the operator side of the spindle the X values are positive.
fr: Le côté positif de l'axe X pointe vers l'opérateur, quand il est du côté de l'opérateur par rapport au centre de rotation, ses valeur sont positives.

source: Some lathes with tools on the back side have the imaginary Y axis (+) pointing up.
fr: Certains tours ont l'outil du côté arrière et un axe Y(+) imaginaire pointant vers le haut.

source: G2/G3 Arc directions are based on the axis they rotate around. In the case of lathes, it is the imaginary Y axis. If the Y axis (+) points toward the floor, you have to look up for the arc to appear to go in the correct direction. So looking from above you reverse the G2/G3 for the arc to appear to go in the correct direction.
fr: Les directions des arcs G2/G3 sont basées sur l'axe autour duquel ils tournent. Dans le cas des tours, il s'agit de l'axe imaginaire Y. Si l'axe Y(+) pointe vers le sol, il faut regarder vers le haut pour que l'arc paraisse aller dans la bonne direction. Alors qu'en regardant depuis le dessus il faut inverser les G2/G3 pour que l'arc semble aller dans la bonne direction.

source: === Radius & Diameter Mode
fr: === Mode rayon et mode diamètre

source: When calculating arcs in radius mode you only have to remember the direction of rotation as it applies to your lathe.
fr: Lors du calcul des arcs en mode rayon, il suffi de se rappeler la direction de rotation telle qu'elle s'applique à ce tour.

source: When calculating arcs in diameter mode X is diameter and the X offset (I) is radius even if you're in G7 diameter mode.
fr: Lors du calcul des arcs en mode diamètre, X est le diamètre, l'offset X (I) est le rayon, même en mode diamètre G7.

source: == Tool Path
fr: == Parcours d'outil

source: === Control Point
fr: === Point contrôlé

source: The control point for the tool follows the programmed path. The control point is the intersection of a line parallel to the X and Z axis and tangent to the tool tip diameter, as defined when you touch off the X and Z axes for that tool. When turning or facing straight sided parts the cutting path and the tool edge follow the same path. When turning radius and angles the edge of the tool tip will not follow the programmed path unless cutter comp is in effect. In the following figures you can see how the control point does not follow the tool edge as you might assume.
fr: Le point contrôlé pour l'outil, suit la trajectoire programmée. Le point contrôlé est l'intersection entre deux lignes parallèles aux axes X et Z, tangentes au rayon de bec de l'outil, définies en faisant tangenter l'outil en X puis en Z. En cylindrage ou en dressage de face sur une pièce, la trajectoire de coupe et l'arête de coupe de l'outil suivent le même parcours. Lors du tournage d'un rayon ou d'un angle, l'arête de coupe de l'outil ne suit pas la trajectoire programmée, sauf si la compensation d'outil est activée. Dans la figure suivante, on voit bien que le point contrôlé n'est pas sur l'arête de coupe de l'outil comme on pourrait le supposer.

source: .Control Point[[fig:Control-Point]]
fr: .Le point contrôlé[[fig:Control-Point]]

source: === Cutting Angles without Cutter Comp
fr: === Tourner les angles sans compensation d'outil

source: Now imagine we program a ramp without cutter comp. The programmed path is shown in the following figure. As you can see in the figure the programmed path and the desired cut path are one and the same as long as we are moving in an X or Z direction only.
fr: Maintenant imaginons de programmer une rampe sans compensation d'outil. La trajectoire programmée est représentée sur la figure suivante. Comme on peut le voir, la trajectoire programmée et la trajectoire de coupe souhaitée sont identiques uniquement si les mouvements de tournage suivent les axes X et Z.

source: .Ramp Entry
fr: .Tournage en rampe

source: Now as the control point progresses along the programmed path the actual cutter edge does not follow the programmed path as shown in the following figure. There are two ways to solve this, cutter comp and adjusting your programmed path to compensate for tip radius.
fr: Le point contrôlé progresse en suivant la trajectoire programmée mais l'arête de coupe ne suit pas cette trajectoire comme c'est visible sur la figure suivante. Pour résoudre ce problème, il est nécessaire d'activer la compensation d'outil et d'ajuster la trajectoire programmée pour compenser le rayon de bec de l'outil.

source: .Ramp Path
fr: .Trajectoire en rampe

source: In the above example it is a simple exercise to adjust the programmed path to give the desired actual path by moving the programmed path for the ramp to the left the radius of the tool tip.
fr: Dans l'exemple ci-dessus, pour suivre la rampe programmée et obtenir la bonne trajectoire, il suffi de décaler la trajectoire de la rampe vers la gauche, de la valeur d'un rayon de bec.

source: === Cutting a Radius
fr: === Tournage avec rayon extérieur
