Repository: 0000duck/linuxcnc
Catalog: docs/src/lathe/lathe-user.*.po
Languages: fr

source: In this example we will examine what happens during a radius cut without cutter comp. In the next figure you see the tool turning the OD of the part. The control point of the tool is following the programmed path and the tool is touching the OD of the part.
fr: Dans cet exemple nous allons examiner ce qui se passe durant le tournage d'un rayon extérieur sans compensation de rayon de bec. Sur la figure suivante on voit l'outil tourner un diamètre extérieur sur la pièce. Le point contrôlé de l'outil suit bien la trajectoire programmée, l'outil touche le diamètre extérieur de la pièce.

source: .Turning Cut
fr: .Tournage du diamètre

source: In this next figure you can see as the tool approaches the end of the part the control point still follows the path but the tool tip has left the part and is cutting air. You can also see that even though a radius has been programmed the part will actually end up with a square corner.
fr: Sur la figure suivante, on voit que quand l'outil approche la fin la pièce, le point contrôlé continue de suivre la trajectoire alors que l'arête de coupe a déjà quitté la matière et coupe en l'air. On voit aussi que malgré qu'un rayon a été programmé, la pièce conserve son angle d'extrémité.

source: .Radius Cut
fr: .Tournage du rayon

source: Now you can see as the control point follows the radius programmed the tool tip has left the part and is now cutting air.
fr: Maintenant, comme on le voit, le point contrôlé suit bien la trajectoire programmée mais l'arête de coupe est en dehors de la matière.

source: In the final figure we can see the tool tip will finish cutting the face but leave a square corner instead of a nice radius. Notice also that if you program the cut to end at the center of the part a small amount of material will be left from the radius of the tool. To finish a face cut to the center of a part you have to program the tool to go past center at least the nose radius of the tool.
fr: Sur la figure finale, on voit que l'arête de coupe a terminé le dressage de la face mais en laissant un coin carré à la place du beau rayon attendu. Noter aussi que, pour la même raison, pour ne pas laisser de téton au centre de la pièce lors du dressage de sa face, il convient de dépasser le centre de rotation de la valeur d'un rayon de bec de l'outil.

source: .Face Cut
fr: .Dressage de la face

source: === Using Cutter Comp
fr: === Utiliser la compensation d'outil

source: When using cutter comp on a lathe think of the tool tip radius as the radius of a round cutter. When using cutter comp the path must be large enough for a round tool that will not gouge into the next line. When cutting straight lines on the lathe you might not want to use cutter comp. For example boring a hole with a tight fitting boring bar you may not have enough room to do the exit move. The entry move into a cutter comp arc is important to get the correct results.
fr: - Quand la compensation d'outil est utilisée sur un tour, penser à l'arête de coupe de l'outil comme étant celle d'un outil rond. - Quand la compensation d'outil est utilisée, la trajectoire doit être suffisamment large pour qu'un outil rond n'interfère pas avec la pièce à la ligne suivante. - Pour tourner des lignes droites sur un tour, il est préférable de ne pas utiliser la compensation d'outil. Par exemple pour aléser un trou avec une barre d'alésage un peu grosse, la place pourrait manquer pour dégager l'outil et faire le mouvement de sortie. - Le mouvement d'entrée dans un arc avec la compensation d'outil, est important pour obtenir des résultats corrects.
