Repository: 0000duck/linuxcnc
Catalog: docs/src/gui/axis.*.po
Languages: fr

source: * 'Show Offsets' - The selected fixture offset (G54-G59.3) origin location can be shown as a set of three orthogonal lines, one each of red, blue, and green. This offset origin (or fixture zero) display can be disabled if desired.
fr: * 'Afficher les offsets...' - L'emplacement de l'origine du système de coordonnées pièce (G54 à G59.3) peut être représenté par un jeu de trois lignes orthogonales, une rouge, une bleue et une verte. L'affichage de cette origine pièce (ou zéro pièce), peut être désactivé si l'opérateur le souhaite.

source: * 'Show Machine Limits' - The machine's maximum travel limits for each axis, as set in the ini file, are shown as a rectangular box drawn in red dashed lines. This is useful when loading a new G code program, or when checking for how much fixture offset would be needed to bring the G code program within the travel limits of your machine. It can be shut off if not needed.
fr: * 'Afficher les limites machine...' - Les limites maximales de déplacement machine pour chacun des axes, qui sont fixées dans le fichier ini, s'affichent comme une boîte rectangulaire en lignes pointillées rouges. Il est facile, au chargement d'un nouveau programme G-code, de voir si la pièce est contenue dans le volume représenté. Ou de vérifier de combien l'étau doit être décalé, pour que le G-code puisse être usiné sans dépasser les limites de déplacements de la machine. Cette option peut être désactivée si l'opérateur le souhaite.

source: * 'Show Velocity' - A display of velocity is sometimes useful to see how close your machine is running to its design velocities. It can be disabled if desired.
fr: * 'Afficher la vitesse d'avance...' - L'affichage de la vitesse peut être utile pour voir la précision avec laquelle la machine suit la vitesse commandée. Cette option peut être désactivée si l'opérateur le souhaite.

source: * 'Show Distance to Go' - Distance to go is a very handy item to know when running an unknown G code program for the first time. In combination with the rapid override and feedrate override controls, unwanted tool and machine damage can be avoided. Once the G code program has been debugged and is running smoothly, the Distance to Go display can be disabled if desired.
fr: * 'Afficher la distance restante...' - La distance restante est une valeur très utile à suivre, au lancement d'un programme de G-code inconnu pour la première fois. En combinaison avec les curseurs des correcteurs de vitesse, des dégâts sur l'outil ou la machine peuvent être évités. Quand le programme G-code sera débogué et qu'il fonctionnera en douceur, l'affichage de la distance restante pourra être désactivée si l'opérateur le souhaite.

source: * 'Clear Live Plot' - As the tool travels in the Axis display, the G code path is highlighted. To repeat the program, or to better see an area of interest, the previously highlighted paths can be cleared.
fr: * 'Rafraîchir le parcours d'outil...' - Au fur et à mesure des déplacements de l'outil, les parcours s'affichent sur l'écran d'Axis en surbrillance. Avant de répéter le programme, ou pour avoir un affichage clair sur une zone intéressante, la surbrillance des parcours précédents peut être rafraîchie.

source: * 'Show Commanded Position' - This is the position that LinuxCNC will try to go to. Once motion has stopped, this is the position LinuxCNC will try to hold.
fr: * 'Afficher la position commandée...' - C'est la position que LinuxCNC cherche à atteindre. Quand le mouvement est stoppé, c'est la position que LinuxCNC cherchera à maintenir.

source: * 'Show Actual Position' - Actual Position is the measured position as read back from the system's encoders or simulated by step generators. This may differ slightly from the Commanded Position for many reasons including PID tuning, physical constraints, or position quantization.
fr: * 'Afficher la position actuelle...' - La position actuelle est la position mesurée grâce aux informations issues des codeurs ou simulées par le générateur de pas. Elle peut différer légèrement de la position commandée pour diverses raisons, comme les réglages des boucles PID, les contraintes physiques ou les efforts de coupe.

source: 'Show Machine Position' - This is the position in unoffset coordinates, as established by Homing.
fr: 'Afficher la position machine...' - C'est la position par rapport à l'origine machine, telle qu'établie par la prise d'origine machine '(POM)'.

source: 'Show Relative Position' - This is the Machine Position modified by 'G5x', 'G92', and 'G43' offsets.
fr: 'Afficher la position relative...' - C'est la position par rapport à l'origine pièce, telle qu'établie par la prise d'origine pièce '(POP)'. On peut aussi représenter cette position comme étant l'origine machine à laquelle on a appliqué les codes de décalages des systèmes de coordonnées G5x, G92 et G43.

source: .Help Menu
fr: .Menu Aide

source: 'About Axis' - We all know what this is.
fr: 'A propos d'Axis...' - Donne la version et quelques informations relatives au copyright.

source: 'Quick Reference' - Shows the keyboard shortcut keys.
fr: 'Aide rapide...' - Affiche la liste des raccourcis clavier.

source: === Toolbar buttons
fr: === Boutons de la barre d'outils

source: From left to right in the Axis display, the toolbar buttons (keyboard shortcuts shown [in brackets]) are:
fr: Signification des boutons de la fenêtre d'AXIS, de gauche à droite, le raccourci clavier est [entre crochets]:

source: image:images/tool_estop.gif[] Toggle Emergency Stop [F1] (also called E-Stop)(((ESTOP))))
fr: image:images/tool_estop.gif[align="center"] 'Arrêt d'urgence' (A/U) [F1] (en Anglais, E-Stop)(((Arrêt d'urgence)))

source: image:images/tool_power.gif[] Toggle Machine Power [F2](((machine on)))
fr: image:images/tool_power.gif[] Marche/Arrêt puissance machine [F2](((Marche/Arret)))

source: image:images/tool_open.gif[] Open G Code file [O]
fr: image:images/tool_open.gif[] Ouvrir un fichier G-code [O]

source: image:images/tool_reload.gif[] Reload current file [Ctrl-R]
fr: image:images/tool_reload.gif[] Recharger le fichier courant [Ctrl-R]

source: image:images/tool_run.gif[] Begin executing the current file [R]
fr: image:images/tool_run.gif[] Départ cycle [R]

source: image:images/tool_step.gif[] Execute next line [T]
fr: image:images/tool_step.gif[] Cycle en pas à pas [T]

source: image:images/tool_pause.gif[] Pause Execution [P] Resume Execution[S]
fr: image:images/tool_pause.gif[] Pause [P] Reprise [S]

source: image:images/tool_stop.gif[] Stop Program Execution [ESC]
fr: image:images/tool_stop.gif[] Stopper l'exécution du programme [ESC]

source: image:images/tool_blockdelete.gif[] Toggle Skip lines with "/" [Alt-M-/]
fr: image:images/tool_blockdelete.gif[] Sauter ou non les lignes commençant par '/' [Alt-M-/]

source: image:images/tool_optpause.gif[] Toggle Optional Pause [Alt-M-1]
fr: image:images/tool_optpause.gif[] Avec ou sans pause optionnelle [Alt-M-1]

source: image:images/tool_zoomin.gif[] Zoom In
fr: image:images/tool_zoomin.gif[] Zoom plus

source: image:images/tool_zoomout.gif[] Zoom Out
fr: image:images/tool_zoomout.gif[] Zoom moins

source: image:images/tool_axis_z.gif[] Top view
fr: image:images/tool_axis_z.gif[] Vue prédéfinie 'Z' (vue de dessus)

source: image:images/tool_axis_z2.gif[] Rotated Top view
fr: image:images/tool_axis_z2.gif[] Vue prédéfinie 'Z basculée'

source: image:images/tool_axis_x.gif[] Side view
fr: image:images/tool_axis_x.gif[] Vue prédéfinie *X* (vue de côté)

source: image:images/tool_axis_y.gif[] Front view
fr: image:images/tool_axis_y.gif[] Vue prédéfinie *Y* (vue de face)

source: image:images/tool_axis_p.gif[] Perspective view
fr: image:images/tool_axis_p.gif[] Vue prédéfinie *P* (vue en perspective)

source: image:images/tool_rotate.gif[] Toggle between Drag and Rotate Mode [D]
fr: image:images/tool_rotate.gif[align="center"] Orienter la vue avec le bouton gauche de la souris [D]

source: image:images/tool_clear.gif[] Clear live backplot [Ctrl-K]
fr: image:images/tool_clear.gif[] Rafraîchir le parcours d'outil [Ctrl-K]

source: === Graphical Display Area
fr: === Zones d'affichage graphique du programme

source: .Coordinate Display
fr: .Affichage des coordonnées

source: In the upper-left corner of the program display is the coordinate display. It shows the position of the machine. To the left of the axis name, an origin symbol is shown if the axis has been homed.
fr: L'affichage des coordonnées est situé en haut à gauche de l'écran graphique. Il montre les positions de la machine. A gauche du nom de l'axe, un symbole d'origine est visible si la prise d'origine de l'axe a été faite.

source: A limit symbol is shown if the axis is on one of its limit switches.
fr: A droite du nom d'axe, un symbole de limite est visible si l'axe est sur un de ses capteurs de limite.

source: To properly interpret these numbers, refer to the 'Position:' indicator in the status bar. If the position is 'Absolute', then the displayed number is in the machine coordinate system. If it is 'Relative', then the displayed number is in the offset coordinate system. When the coordinates displayed are relative and an offset has been set, the display will include a cyan 'machine origin' marker.
fr: Pour interpréter correctement ces valeurs, référez vous à l'indicateur 'Position' de la barre d'état. Si la position est 'Absolue', alors les valeurs affichées sont exprimées en coordonnées machine. Si la position est 'Relative', alors les valeurs affichées sont exprimées en coordonnées relatives à la pièce. Quand les coordonnées affichées sont relatives, une marque d'origine de couleur cyan est visible pour représenter l'origine machine.

source: If the position is 'Commanded', then it is the ideal position --for instance, the exact coordinate given in a 'G0' command. If it is 'Actual', then it is the position the machine has actually moved to. These values can differ for several reasons: Following error, dead band, encoder resolution, or step size. For instance, if you command a movement to X 0.0033 on your mill, but one step of your stepper motor or one encoder count is 0.00125, then the 'Commanded' position might be 0.0033, but the 'Actual' position will be 0.0025 (2 steps) or 0.00375 (3 steps).
fr: Si la position est 'Commandée', alors il s'agit de la position à atteindre. Par exemple, les coordonnées passées dans une commande 'G0'.Si la position est 'Actuelle', alors il s'agit de la position à laquelle la machine vient de se déplacer. Ces valeurs peuvent varier pour certaines raisons: erreur de suivi, bande morte, résolution d'encodeur, ou taille de pas. Par exemple, si vous demandez un mouvement à X 0.08 à votre fraiseuse, mais un pas du moteur fait 0.03, alors la position 'Commandée' sera de 0.08, mais la position 'Actuelle' sera de 0.06 (2 pas) ou 0.09 (3 pas).

source: .Preview Plot (((preview plot)))
fr: .Vue du parcours d'outil (((Parcours d'outil)))

source: When a file is loaded, a preview of it is shown in the display area. Fast moves (such as those produced by the 'G0' command) are shown as cyan lines. Moves at a feed rate (such as those produced by the 'G1' command) are shown as solid white lines. Dwells (such as those produced by the 'G4' command) are shown as small pink 'X' marks.
fr: Quand un fichier est chargé, une vue du parcours d'outil qu'il produira est visible dans la zone graphique. Les mouvements en vitesse rapide (tels ceux produits par une commande 'G0') sont affichés en lignes pointillées vertes. Les déplacements en vitesse travail (tels ceux produits par une commande 'G1') sont affichés en lignes continues blanches. Les arrêts temporisés (tels ceux produits par la commande 'G4') sont représentés par une petite marque 'X'.

source: G0 (Rapid) moves prior to a feed move will not show on the preview plot. Rapid moves after a T<n> (Tool Change) will not show on the preview until after the first feed move. To turn either of these features off program a G1 without any moves prior to the G0 moves.
fr: Un mouvement G0 (Vitesse rapide) avant un déplacement en vitesse travail ne sera pas affiché sur l'écran des parcours d'outil.Un mouvement en vitesse rapide, après un appel d'outil T<n>, n'apparaîtra sur l'écran des parcours d'outil qu'après le mouvement en vitesse travail suivant. Pour contourner une de ces caractéristiques, programmer un G1 sans déplacement, juste avant le G0.

source: .Program Extents (((program extents)))
fr: .Étendues du programme (((Étendues du programme)))

source: The 'extents' of the program in each axis are shown. At the ends, the least and greatest coordinate values are indicated. In the middle, the difference between the coordinates is shown.
fr: Les 'étendues' du programme sont affichées pour chacun des axes. Aux extrémités, les coordonnées minimales et maximales sont indiquées. Au centres, la différence, entre ces deux coordonnées, est indiquée.

source: When some coordinates exceed the 'soft limits' in the .ini file, the relevant dimension is shown in a different color and enclosed by a box. In figure below the maximum soft limit is exceeded on the X axis as indicated by the box surrounding the coordinate value. The minimum X travel of the program is -1.95, the maximum X travel is 1.88, and the program requires 3.83 inches of X travel. To move the program so it's within the machine's travel in this case, jog to the left and Touch Off X again.
fr: Quand une coordonnée dépasse la limite logicielle fixée dans le fichier .ini, la coordonnée correspondante s'affiche en rouge, entourée d'un rectangle. Dans la figure ci-dessous, la limite maximale est dépassée sur l'axe X, comme l'indique le rectangle entourant la valeur de la coordonnée. Le déplacement X minimal du programme est de -1.95, la course maximale est de 1.88 en X et le programme nécessite un déplacement en X de 3.83 pouces. Le déplacement total demandé par le programme est donc possible. Pour cela, se déplacer en jog vers la gauche puis 'Toucher' à nouveau pour corriger l'origine pièce.

source: .Soft Limit[[cap:Soft-Limit]]
fr: .Limites logicielles[[cap:Etendues-Depassees]]

source: image::images/axis-outofrange.png[align="center"]
fr: image::images/axis-outofrange.png[]

source: .Tool Cone When no tool is loaded, the location of the tip of the tool is indicated by the 'tool cone'. The 'tool cone' does not provide guidance on the form, length, or radius of the tool.
fr: .Le cône d'outil Si aucun outil n'est chargé, l'emplacement de la pointe de l'outil est indiqué par le 'cône d'outil'. Le cône d'outil ne donne aucune indication sur la forme, la longueur, ou le rayon de l'outil.

source: When a tool is loaded (for instance, with the MDI command 'T1 M6' ), the cone changes to a cylinder which shows the diameter of the tool given in the tool table file.
fr: Quand un outil est chargé, par exemple dans le MDI, avec la commande 'T1 M6', le cône d'outil passe de conique à cylindrique, il indique alors la proportion du diamètre de l'outil lu dans le fichier de la table d'outils.

source: .Backplot
fr: .Parcours d'outil

source: When the machine moves, it leaves a trail called the backplot. The color of the line indicates the type of motion: Yellow for jogs, faint green for rapid movements, red for straight moves at a feed rate, and magenta for circular moves at a feed rate.
fr: Quand la machine se déplace, elle laisse une trace appelée le parcours d'outil. La couleur des lignes indique le type de mouvement:jaune pour les mouvements en jog, vert clair pour les mouvements en vitesse rapide, rouge pour les mouvements en vitesse d'avance programmée et magenta pour les mouvements circulaires en vitesse d'avance programmée.

source: .Grid
fr: .Grille

source: Axis can optionally display a grid when in orthogonal views. Enable or disable the grid using the 'Grid' menu under 'View'. When enabled, the grid is shown in the top and rotated top views; when coordinate system is not rotated, the grid is shown in the front and side views as well. The presets in the 'Grid' menu are controlled by the inifile item `[DISPLAY]GRIDS`; if unspecified, the default is `10mm 20mm 50mm 100mm 1in 2in 5in 10in`.
fr: Axis peut, en option, afficher une grille dans les vues orthogonales. La grille s'active ou s'active ou se désactive depuis le sous-menu 'Grille' dans le menu 'Vue'. Quand la grille est activée, elle est visible en vue de dessus et en vue de dessus basculée, ainsi qu'en vue de face et de côté. Les réglages par défaut du menu 'Grille' sont donnés dans le fichier ini, à la section '[DISPLAY]GRIDS' ; si non spécifié, les valeurs par défaut sont: '10mm 20mm 50mm 100mm 1in 2in 5in 10in'.

source: Specifying a very small grid may decrease performance.
fr: Spécifier une très petite valeur de grille peut faire baisser les performances.

source: .Interacting
fr: .Interaction avec l'affichage

source: By left-clicking on a portion of the preview plot, the line will be highlighted in both the graphical and text displays. By left-clicking on an empty area, the highlighting will be removed.
fr: Par un clic gauche sur une portion du parcours d'outil, la ligne sous la souris passe en surbrillance à la fois dans le parcours d'outil et dans le texte. Un clic droit dans une zone vide enlève la surbrillance.

source: By dragging with the left mouse button pressed, the preview plot will be shifted (panned).
fr: En déplaçant la souris avec son bouton gauche appuyé, la vue est glissée sur l'écran.

source: By dragging with shift and the left mouse button pressed, or by dragging with the mouse wheel pressed, the preview plot will be rotated. When a line is highlighted, the center of rotation is the center of the line. Otherwise, the center of rotation is the center of the entire program.
fr: En déplaçant la souris avec la touche Maj enfoncée, ou en glissant avec la molette de la souris appuyée, la vue est tournée. Si une ligne du tracé est en surbrillance, elle devient le centre de rotation de la vue. Autrement, le centre de rotation est le milieu du fichier dans son ensemble.

source: By rotating the mouse wheel, or by dragging with the right mouse button pressed, or by dragging with control and the left mouse button pressed, the preview plot will be zoomed in or out.
fr: En tournant la molette de la souris, ou en glissant la souris avec son bouton droit enfoncé, ou encore en glissant la souris avec son bouton gauche enfoncé et la touche Ctrl appuyée, le tracé sera zoomé en plus ou en moins.

source: By clicking one of the 'Preset View' icons, or by pressing 'V', several preset views may be selected.
fr: En cliquant sur une des icônes de vue pré-définie de la barre d'outils, ou en pressant la touche 'V', cette vue est sélectionnée.

source: === Text Display Area
fr: === Zone texte d'affichage du programme

source: By left-clicking a line of the program, the line will be highlighted in both the graphical and text displays.
fr: Un clic gauche sur une ligne du programme passe la ligne en surbrillance, à la fois dans la zone de texte et dans le parcours d'outil.

source: When the program is running, the line currently being executed is highlighted in red. If no line has been selected by the user, the text display will automatically scroll to show the current line.
fr: Quand le programme est lancé, la ligne en cours d'exécution est en surbrillance rouge. Si aucune ligne n'est sélectionnée par l'utilisateur, le texte défile automatiquement pour toujours laisser la ligne courante visible.

source: .Current and Selected Lines[[cap:Current-and-Selected]]
fr: .Ligne courante et ligne en surbrillance[[cap:Current-and-Selected]]

source: image::images/axis-currentandselected.png[align="center"]
fr: image::images/axis-currentandselected_fr.png[]

source: === Manual Control (((Manual)))
fr: === Contrôle manuel (((Contrôle manuel)))

source: While the machine is turned on but not running a program, the items in the 'Manual Control' tab can be used to move the machine or control its spindle and coolant.
fr: Quand la machine est en marche mais qu'aucun programme n'est exécuté, les éléments graphiques de l'onglet 'Contrôle manuel' peuvent être utilisés pour actionner la machine ou mettre en marche et arrêter ses différents organes.

source: When the machine is not turned on, or when a program is running, the manual controls are unavailable.
fr: Quand la machine n'est pas en marche, ou quand un programme est en cours d'exécution, le contrôle manuel n'est pas disponible.

source: Many of the items described below are not useful on all machines. When AXIS detects that a particular pin is not connected in HAL, the corresponding item in the Manual Control tab is removed. For instance, if the HAL pin 'motion.spindle-brake' is not connected, then the 'Brake' button will not appear on the screen. If the environment variable 'AXIS_NO_AUTOCONFIGURE' is set, this behavior is disabled and all the items will appear.
fr: Certains des éléments décrits plus bas ne sont pas disponibles sur toutes les machines. Quand AXIS détecte qu'une pin particulière n'est pas connectée dans le fichier HAL, l'élément correspondant de l'onglet 'Contrôle manuel' est supprimé. Par exemple, si la pin HAL 'motion.spindle-brake' n'est pas connectée, alors le bouton 'Frein de broche' n'apparaîtra pas sur l'écran. Si la variable d'environnement AXIS_NO_AUTOCONFIGURE est mise à 1, ce comportement est désactivé et tous les boutons sont visibles.

source: .The Axis group
fr: .Le groupe de cases et boutons 'Axes'

source: 'Axis' allows you to manually move the machine. This action is known as 'jogging'. First, select the axis to be moved by clicking it. Then, click and hold the '+' or '-' button depending on the desired direction of motion. The first four axes can also be moved by the arrow keys (X and Y), PAGE UP and PAGE DOWN keys (Z), and the [ and ] keys (A).
fr: Les cases à cocher du groupe 'Axes' permettent de choisir l'axe à actionner manuellement. Cette action s'appelle le 'jog'. Premièrement sélectionner l'axe à actionner en cochant sa case. Puis cliquer sur le bouton '+' ou '-' selon le sens de déplacement souhaité. Les quatre premiers axes peuvent aussi être déplacés avec les touches fléchées pour X et Y, avec les touches Page haute et Page basse pour (Z) et les touches [ et ] pour A.

source: If 'Continuous' is selected, the motion will continue as long as the button or key is pressed. If another value is selected, the machine will move exactly the displayed distance each time the button is clicked or the key is pressed. By default, the available values are '0.1000, 0.0100, 0.0010, 0.0001'
fr: Si 'En continu' est sélectionné, le mouvement continuera tant que la touche ou le bouton resteront appuyés. Si une autre valeur est sélectionnée, la machine se déplacera juste de la distance affichée à chaque fois que la touche ou le bouton seront appuyés. Par défaut, les valeurs disponibles sont: 0.1000 0.0100 0.0010 0.0001

source: See the Configure section of the Integrator Manual for more information on setting the increments.
fr: Voir le Manuel pour plus d'informations sur la configuration des incréments de jog.

source: .Homing
fr: .Prise d'origine machine

source: If your machine has home switches and a homing sequence defined for all axes the button will read 'Home All'. The 'Home All' button or the Ctrl-HOME key will home all axes using the homing sequence. Pressing the HOME key will home the current axis, even if a homing sequence is defined.
fr: Si la machine dispose de contacts d'origine machine et a une séquence de prise d'origine définie dans le fichier ini, le bouton 'POM générale' lancera cette séquence pour tous les axes, les touches 'Ctrl-HOME' auront le même effet.
