Repository: 0000duck/linuxcnc
Catalog: docs/src/gui/axis.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = AXIS GUI
fr: = L'interface graphique AXIS

source: [[cha:axis-gui]] (((Axis GUI)))
fr: [[cha:Axis]] (((Axis)))

source: AXIS(((AXIS))) is a graphical front-end for LinuxCNC which features a live preview and backplot. It is written in Python(((Python))) and uses Tk(((Tk))) and OpenGL(((OpenGL))) to display its user interface.
fr: AXIS(((AXIS))) est une interface utilisateur graphique pour LinuxCNC, il offre un aperçu permanent du parcours de l'outil. Il est écrit en Python(((Python))), utilise Tk(((Tk))) et OpenGL(((OpenGL))) pour afficher son interface graphique.

source: .AXIS Window[[cap:AXIS-Window]]
fr: .Fenêtre d'AXIS[[cap:Fenetre-AXIS]]

source: image::images/axis-2.5.png[align="center"]
fr: image::../common/images/axis_25_fr.png[]

source: == Getting Started
fr: == Commencer avec AXIS

source: If your configuration is not currently set up to use AXIS, you can change it by editing the .ini file. In the section '[DISPLAY]' change the 'DISPLAY' line to read 'DISPLAY = axis'.
fr: Si la configuration n'est pas couramment réglée pour utiliser Axis, éditer le fichier ini et dans la section '[DISPLAY]' changer le 'DISPLAY' en 'DISPLAY = axis'.

source: The sample configuration 'sim/axis.ini' is already configured to use AXIS as its front-end.
fr: La configuration simplifiée 'sim/axis.ini' est déjà configurée pour utiliser AXIS comme interface graphique.

source: === A Typical Session
fr: === Session classique avec AXIS

source: . Start LinuxCNC. . Reset E-STOP (F1) and turn the Machine Power (F2) on. . Home all axes. . Load the g-code file. . Use the preview plot to verify that the program is correct. . Load the material. . Set the proper offset for each axis by jogging and using the Touch Off button as needed. . Run the program.
fr: . Lancer LinuxCNC et sélectionner un fichier de configuration. . Relâcher le bouton d'arrêt d'urgence A/U (F1) et presser celui de Marche machine (F2). . Faire les prises d'origine machine POM pour chacun des axes. . Charger un fichier d'usinage G-code. . Utiliser l'affichage du parcours d'outil pour vérifier que le programme est correct. . Brider le brut à usiner sur la table. . Faire les prises d'origine pièce 'POP' de chacun des axes avec le jog et en utilisant le bouton Toucher. . Lancer le programme.

source: [NOTE] To run the same program again depends on your setup and requirements. You might need to load more material and set offsets or move over and set an offset then run the program again. If your material is fixtured then you might need to only run the program again. See the <<sub:axis-machine-menu,Machine Menu>> for more information on the run command.
fr: [NOTE] Pour usiner le même fichier une nouvelle fois, retourner à l'étape 6. Pour usiner un fichier différent, retourner à l'étape 4. Quand le travail est terminé, quitter AXIS. <<sub:axis-machine-menu,Le menu machine>>, plus loin, donne d'autres détails à ce propos.

source: == AXIS Display
fr: == L'affichage d'AXIS

source: The AXIS window contains the following elements:
fr: La fenêtre d'AXIS contient les éléments suivants:

source: * A display area that shows one of the following: ** a preview of the loaded file (in this case, 'axis.ngc'), as well as the current location of the CNC(((CNC))) machine's 'controlled point'. Later, this area will display the path the CNC machine has moved through, called the 'backplot' ** a large readout showing the current position and all offsets. * A menu bar and toolbar that allow you to perform various actions * 'Manual Control Tab' - which allows you to make the machine move, turn the spindle on or off, and turn the coolant on or off if included in the ini file. * 'MDI Tab' - where G-code programs can be entered manually, one line at a time. This also shows the 'Active G Codes' which shows which modal G Codes are in effect. * 'Feed Override' - which allows you to scale the speed of programmed motions. The default maximum is 120% and can be set to a different value in the ini file. See the Integrator Manual for more information on this setting. * 'Spindle Override' - which allows you to scale the spindle speed up or down. * 'Jog Speed' - which allows you to set the jog speed within the limits set in the ini file. See the Integrator Manual for more information on the ini file. * 'Max Velocity' - which allows you to restrict the maximum velocity of all programmed motions (except spindle synchronized motion). * A text display area that shows the loaded G-Code. * A status bar which shows the state of the machine. In this screen shot, the machine is turned on, does not have a tool inserted, and the displayed position is 'Relative' (showing all offsets), and 'Actual' (showing feedback position).
fr: * Un espace d'affichage qui montre: ** la visualisation du fichier chargé (dans ce cas, 'axis.ngc'), ainsi que la position courante du 'point contrôlé'. Plus tard, cette zone affichera le parcours de l'outil en déplacement, cette zone est appelée le parcours d'outil (backplot). ** Un large champ de lecture, indiquant la position courante et tous les décalages. * Une barre de menus et une barre d'outils, permettant d'effectuer diverse actions. * L'onglet 'Contrôle manuel', qui permet de faire des mouvements d'axe, de mettre la broche en rotation ou de l'arrêter, de mettre l'arrosage en marche ou de l'arrêter, si inclus dans le fichier ini. * L'onglet 'Données manuelles' (appelé aussi MDI), où les blocs de programme G-code peuvent être entrés et exécutés à la main, une ligne à la fois. Cette fenêtre affiche également les G-codes actifs, permettant de connaître le groupe modal des G-codes, en vigueur. * Le curseur 'Correcteur de vitesse' qui permet d'augmenter ou de diminuer la vitesse d'avance. La valeur maximale par défaut est de 120%, elle peut être réglée différemment dans le fichier ini. * Les éventuels correcteurs de vitesse de rotation de la broche. * Le curseur de réglage de la vitesse de jog. * Le curseur de réglage de la vitesse maximale de tous les mouvements machine. * Une zone de textes qui affiche le G-code du fichier chargé. * Une barre d'état qui affiche l'état de la machine. Dans cette capture d'écran, la machine est en marche, aucun outil n'est monté, la position s'affiche en 'relatif' à l'origine pièce (par opposition à une position 'absolue') et 'actuelle' (par opposition à une position 'commandée')

source: === Menu Items[[sec:axis-menu]] (((Axis Menu)))
fr: === Options des menus[[sec:axis-menu]]

source: Some menu items might be grayed out depending on how you have your .ini file configured. For more information on configuration see the Integrator Manual.
fr: Certaines options de menu peuvent s'afficher en grisé, c'est dépendant des options du fichier de configuration ini.

source: .File Menu
fr: .Menu Fichier

source: * 'Open...' - Opens a standard dialog box to open a g code file to load in AXIS. If you have configured LinuxCNC to use a filter program you can also open it up. See the Integrator manual for more information on filter programs.
fr: * 'Ouvrir...' - C'est une boîte de dialogue standard pour ouvrir un fichier G-code à charger dans AXIS. Si un filtre de programme a été configuré, il peut aussi être ouvert ici.

source: 'Recent Files' - Displays a list of recently opened files.
fr: 'Fichiers récents...' - Affiche la liste des fichiers ouverts récemment.

source: * 'Edit...' - Open the current g code file for editing if you have an editor configured in your ini file. See the Integrator Manual for more information on specifying an editor to use.
fr: * 'Éditer...' - Ouvre le fichier G-code courant pour édition si un éditeur a été déclaré dans le fichier ini.

source: * 'Reload' - Reload the current g code file. If you edited it you must reload it for the changes to take affect. If you stop a file and want to start from the beginning then reload the file. The toolbar reload is the same as the menu.
fr: * 'Recharger...' - Recharge le fichier G-code courant. Si le fichier a été édité, il doit être rechargé pour que les modifications prennent effet. Si un programme a été stoppé, pour le reprendre depuis le début, le recharger. Le bouton 'Recharger' a le même effet que l'option de menu.

source: 'Save gcode as...' - Save the current file with a new name.
fr: 'Enregistrer le G-code sous...' - Enregistre le fichier courant sous un nouveau nom.

source: * 'Properties' - The sum of the rapid and feed moves. Does not factor in acceleration, blending or path mode so time reported will never be less than the actual run time.
fr: * 'Propriétés...' - Donne la somme des mouvements en vitesse rapide et celle en vitesse travail. Ne tient pas compte des accélérations, ni des décélérations, ni des modes de trajectoire, de sorte qu'il ne donne jamais de temps inférieur au temps réel d'exécution.

source: * 'Edit tool table...' - Same as Edit if you have defined an editor you can open the tool table and edit it.
fr: * 'Éditer la table d'outils...' - Ouvre un dialogue permettant d'éditer les valeurs de la table d'outils.

source: 'Reload tool table' - After editing the tool table you must reload it.
fr: 'Recharger la table d'outils...' - Après avoir édité la table d'outil, il convient de la recharger pour que les nouvelles valeurs soient prisent en compte tout de suite.

source: * 'Ladder editor' - If you have loaded Classic Ladder you can edit it from here. See the Integrator Manual on setting up Classic Ladder
fr: * 'Éditeur de Ladder...' - Si Classic Ladder a été chargé, il est possible de l'éditer ici.

source: 'Quit' - Terminates the current LinuxCNC session.
fr: 'Quitter...' - Termine la session courante de LinuxCNC.

source: .Machine Menu [[sub:axis-machine-menu]]
fr: .Menu Machine [[sub:axis-machine-menu]]

source: 'Toggle Emergency Stop F1' - Change the state of the Emergency Stop.
fr: 'Arrêt d'Urgence F1...' - (bascule) Active/désactive l'arrêt d'urgence.

source: * 'Toggle Machine Power F2' - Change the state of the Machine Power if the Emergency Stop is not on.
fr: * 'Marche/Arrêt F2...' - Active ou désactive (bascule) la puissance machine.

source: 'Run Program' - Run the currently loaded program from the beginning.
fr: 'Démarrer le programme...' - Lance l'exécution du programme G-code.

source: * 'Run From Selected Line' - Select the line you want to start from first. Use with caution as this will move the tool to the expected position before the line first then it will execute the rest of the code.
fr: * 'Démarrer à la ligne sélectionnée...' - Prudence avec cette commande, respecter la démarche suivante: Premièrement, sélectionner à la souris, la ligne à laquelle démarrer. Déplacer ensuite manuellement, l'outil à la position de la ligne précédente puis, cette commande exécutera le reste du code.

source: [WARNING] Do not use 'Run From Selected Line' if your g code program contains subroutines.
fr: [WARNING] Ne pas utiliser la commande 'Démarrer à la ligne sélectionnée...' si le programme G-code contient des sous-programmes.

source: 'Step' - Single step through a program.
fr: 'Pas à pas...' - Avance d'un seul pas de programme.

source: 'Pause' - Pause a program.
fr: 'Pause...' - Effectue une pause dans le programme.

source: 'Resume' - Resume running from a pause.
fr: 'Reprise...' - Reprends la marche après une pause.

source: * 'Stop' - Stop a running program. When run is selected after a stop the program will start from the beginning.
fr: * 'Stopper...' - Stoppe le programme en marche. Quand 'Démarrer le programme' est lancé après avoir été stoppé, il redémarre au départ.

source: * 'Stop at M1' - If an M1 is reached, and this is checked, program execution will stop on the M1 line. Press Resume to continue.
fr: * 'Arrêt sur M1...' - Si M1 est rencontré et que cette option est cochée, l'exécution du programme s'interrompra à la ligne où M1 a été rencontré. Presser 'Reprise' pour continuer.

source: * 'Skip lines with "/"' - If a line begins with '/' and this is checked, the line will be skipped.
fr: * 'Sauter les lignes avec "/"...' - Si une ligne commençant par un '/' est rencontrée et que cette option est cochée, cette ligne sera sautée.

source: 'Clear MDI history' - Clears the MDI history window.
fr: 'Vider l'historique du MDI...' - Efface l'historique des données manuelles.

source: 'Copy from MDI history' - Copies the MDI history to the clipboard
fr: 'Copier depuis l'historique du MDI...' - Copier l'historique des données manuelles dans le presse-papier.

source: 'Paste to MDI history' - Paste from the clipboard to the MDI history window
fr: 'Coller dans l'historique du MDI...' - Coller le contenu du presse-papier dans la fenêtre d'historique des données manuelles.

source: * 'Calibration' - Starts the Servo Axis Calibration assistant. Calibration reads the HAL file and for every 'setp' that uses a variable from the ini file that is in an [AXIS_n] section it creates an entry that can be edited and tested.
fr: * 'Calibration' - Lance l'assistant de réglage de PID Servo. La calibration lit le fichier HAL et pour chaque 'pas' il utilise une variable de la section [AXIS_n] du fichier ini et crée une entrée pouvant être éditée et testée.

source: * 'Show HAL Configuration' - Opens the HAL Configuration window where you can monitor HAL Components, Pins, Parameters, Signals, Functions, and Threads.
fr: * 'Afficher configuration de HAL...' - Ouvre une fenêtre sur la configuration de HAL depuis laquelle il est possible de visualiser tous les 'Composants', 'Pins', 'Paramètres', 'Signaux', 'Fonctions' et 'Threads' de HAL.

source: * 'HAL Meter' - Opens a window where you can monitor a single HAL Pin, Signal, or Parameter.
fr: * 'HAL Mètre...' - Ouvre une fenêtre dans laquelle il est possible de visualiser un seul 'Signal, HAL Pin', ou 'Paramètre' de HAL.

source: 'HAL Scope' - Opens a virtual oscilloscope that allows plotting HAL values vs. time.
fr: 'HAL Scope...' - Ouvre un oscilloscope virtuel qui permet de tracer dans le temps, les valeurs de HAL.

source: 'Show LinuxCNC Status' - Opens a window showing LinuxCNC's status.
fr: 'Afficher l'état de LinuxCNC...' - Ouvre une fenêtre montrant l'état de LinuxCNC.

source: 'Set Debug Level' - Opens a window where debug levels can be viewed and some can be set.
fr: 'Choisir le niveau de Debug...' - Ouvre une fenêtre dans laquelle les niveaux de débogage sont visibles et certains réglables.

source: 'Homing' - Home one or all axes.
fr: 'Prise d'origine...' - Effectue la prise d'origine machine d'un ou de tous les axes.

source: 'Unhoming' - Unhome one or all axes.
fr: 'Annulation OM...' - Annule les origines d'un ou de tous les axes.

source: 'Zero Coordinate System' - Clear (set to zero) a chosen offset.
fr: 'Annulation décalages d'origine...' - Annule les décalages d'origine du système de coordonnées choisi. (origine pièce)

source: * 'Tool touch off to workpiece' - When performing Touch Off, the value entered is relative to the current workpiece ('G5x') coordinate system, as modified by the axis offset ('G92'). When the Touch Off is complete, the Relative coordinate for the chosen axis will become the value entered. See <<sec:G10-L10,G10 L10>> in the G code chapter.
fr: * 'L'outil touchera la pièce...' - Lorsqu'un 'Toucher' est effectué, la valeur entrée est relative au système de coordonnées pièce actuel (G5x), tel que modifié par le décalage d'axe (G92). Quand la séquence de 'Toucher' est complète, la coordonnée relative pour l'axe choisi prendra la valeur entrée. Voir aussi <<sec:G10-L10,G10 L10>> dans le chapitre du G-code.

source: * 'Tool touch off to fixture' - When performing Touch Off, the value entered is relative to the ninth ('G59.3') coordinate system, with the axis offset ('G92') ignored. This is useful when there is a tool touch-off fixture at a fixed location on the machine, with the ninth ('G59.3') coordinate system set such that the tip of a zero-length tool is at the fixture's origin when the Relative coordinates are 0. See <<sec:G10-L11,G10 L11>> in the G code chapter.
fr: * 'L'outil touchera le porte-pièce...' - Lorsqu'un 'Toucher' est effectué, la valeur entrée est relative au 9ème système de coordonnées (G59.3), le décalage d'axe (G92) est ignoré. Mode destiné aux machines possédant un porte-pièce fixe, référencé à un endroit, sur lequel s'effectue le 'Toucher'. Le 9ème système de coordonnées doit être ajusté pour que la pointe d'un outil de longueur nulle (le nez de broche), soit à l'origine du porte-pièce quand les coordonnées relatives sont à 0. Voir aussi <<sec:G10-L11,G10 L11>> dans le chapitre du G-code.

source: .View Menu
fr: .Menu Vues

source: .It's all in your point of view **** The AXIS display pick menu 'View' refers to 'Top', 'Front', and 'Side' views. These terms are correct if the CNC machine has its Z axis vertical, with positive Z up. This is true for vertical mills, which is probably the most popular application, and also true for almost all EDM machines, and even vertical turret lathes, where the part is turning below the tool.
fr: .Tout est dans le point de vue... **** Les icônes de choix du type d'affichage et du menu 'Vues' d'AXIS se référent à la 'Vue de dessus', la 'Vue de face' et la 'Vue de côté'. Ces termes sont corrects si la machine CNC a un axe Z vertical, avec une valeur de Z positive en haut. C'est vrai pour les fraiseuses verticales, qui sont probablement les plus populaires, c'est également vrai pour toutes les machines d'électro-érosion et aussi les tours verticaux, sur lesquels la pièce tourne sous l'outil.

source: The terms 'Top', 'Front', and 'Side' might be confusing however, in other CNC machines, such as a standard lathe, where the Z axis is horizontal, or a horizontal mill, again where the Z axis is horizontal, or even an inverted vertical turret lathe, where the part is turning above the tool, and the Z axis positive direction is down!
fr: Les termes 'Vue de dessus', 'Vue de face' et 'Vue de côté' sont cependant source de confusion sur d'autres machines CNC, comme un tour standard, sur lequel l'axe Z est horizontal, ou sur une fraiseuse horizontale, qui a également l'axe Z horizontal, ou même un tour vertical inversé, sur lequel la pièce tourne au dessus de l'outil et qui a son axe Z positif vers le bas!

source: Just remember that positive Z axis is (almost) always away from the part. So be familiar with your machine's design and interpret the display as needed. ****
fr: Il faut juste se rappeler que l'axe Z est toujours parallèle a la broche et plus positif en s'éloignant de celle-ci. Être familiarisé avec la cinématique de ses machines, permet d'interpréter l'affichage comme il se doit. ****

source: * 'Top View' - The Top View (or Z view) displays the G code looking along the Z axis from positive to negative. This view is best for looking at X & Y.
fr: * 'Vue de dessus...' - La vue de dessus (ou vue de Z) affiche l'aspect du G-code vu depuis le côté positif de l'axe Z et en regardant vers son côté négatif. Cette vue convient bien pour visualiser les axes X et Y.

source: * 'Rotated Top View' - The Rotated Top View (or rotated Z view) also displays the G code looking along the Z axis from positive to negative. But sometimes it's convenient to display the X & Y axes rotated 90 degrees to fit the display better. This view is also best for looking at X & Y.
fr: * 'Vue de dessus basculée...' - La vue de dessus basculée (ou vue de Z basculé) affiche également l'aspect du G-code vu depuis le côté positif de l'axe Z et en regardant vers son côté négatif. Mais cette fois, les axes X et Y sont représentés pivoté de 90 degrés pour mieux occuper l'espace d'affichage. Cette vue convient bien également, pour visualiser les axes X et Y.

source: * 'Side View' - The Side View (or X view) displays the G code looking along the X axis from positive to negative. This view is best for looking at Y & Z.
fr: * 'Vue de côté...' - La vue de côté (ou vue de X) affiche l'aspect du G-code vu depuis le côté positif de l'axe X et en regardant vers son côté négatif. Cette vue convient pour visualiser les axes Y et Z.

source: * 'Front View' - The Front View (or Y view) displays the G code looking along the Y axis from negative to positive. This view is best for looking at X & Z.
fr: * 'Vue de face...' - La vue de face (ou vue de Y) affiche l'aspect du G-code vu depuis le côté positif de l'axe Y et en regardant vers son côté négatif. Cette vue convient bien pour visualiser les axes X et Z.

source: * 'Perspective View' - The Perspective View (or P view) displays the G code looking at the part from an adjustable point of view, defaulting to X+, Y-, Z+. The position is adjustable using the mouse and the drag/rotate selector. This view is a compromise view, and while it does do a good job of trying to show three (to nine!) axes on a two-dimensional display, there will often be some feature that is hard to see, requiring a change in viewpoint. This view is best when you would like to see all three (to nine) axes at once.
fr: * 'Vue en perspective...' - La vue en perspective (ou vue P) affiche l'aspect du G-code en regardant vers la pièce depuis un point de vue orientable, par défaut vers X+, Y-, Z+. Cette position est orientable en la sélectionnant à la souris. L'affichage est un compromis, il tente d'afficher en 3D, entre trois et neuf axes, sur un écran en deux dimensions. Il y aura donc souvent certaines caractéristiques difficiles à voir, ce qui requerra un changement de point de vue. Cette vue convient bien pour voir les trois axes à la fois.

source: 'Display Inches' - Set the AXIS display scaling for inches.
fr: 'Affichage en pouces...' - Ajuste l'échelle d'affichage d'AXIS pour les pouces.

source: 'Display MM' - Set the AXIS display scaling for millimeters.
fr: 'Affichage en mm...' - Ajuste l'échelle d'affichage d'AXIS pour les millimètres.

source: * 'Show Program' - The preview display of the loaded G code program can be entirely disabled if desired.
fr: * 'Afficher le programme...' - L'affichage à l'écran de l'aspect du G-code peut être entièrement désactivé si l'opérateur le souhaite.

source: * 'Show Program Rapids' - The preview display of the loaded G code program will always show the feedrate moves (G1,G2,G3) in white. But the display of rapid moves (G0) in cyan can be disabled if desired.
fr: * 'Parcours d'outil en vitesse rapide...' - L'affichage du parcours d'outil du programme G-code courant représente toujours les mouvements en vitesse travail (G1,G2,G3) en blanc. Mais l'affichage des mouvements en vitesse rapide (G0) en cyan peut être désactivé si si l'opérateur le souhaite.

source: * 'Alpha-blend Program' - This option makes the preview of complex programs easier to see, but may cause the preview to display more slowly.
fr: * 'Simulation de transparence...' - Cette option rends plus lisible le tracé des parcours affichés par les programmes complexes, mais il peut rendre l'affichage plus lent.

source: * 'Show Live Plot' - The highlighting of the feedrate paths (G1,G2,G3) as the tool moves can be disabled if desired.
fr: * 'Parcours d'outil en temps réel...' - La surbrillance des chemins d'outils en vitesse travail (G1,G2,G3) quand l'outil se déplace peut être désactivée si l'opérateur le souhaite.

source: 'Show Tool' - The display of the tool cone/cylinder can be disabled if desired.
fr: 'Afficher l'outil...' - Le symbole d'un outil, représenté par un cône ou un cylindre peut être désactivé si l'opérateur le souhaite.

source: * 'Show Extents' - The display of the extents (maximum travel in each axis direction) of the loaded G code program can be disabled if desired.
fr: * 'Afficher les étendues...' - L'affichage des étendues du programme G-code chargé (déplacements maximum sur chacun des axes), peut être désactivé si l'opérateur le souhaite.
