Repository: 0000duck/linuxcnc
Catalog: docs/src/gui/axis.*.po
Languages: fr

source: If your machine has home switches and no homing sequence is defined or not all axes have a homing sequence the button will read 'Home' and will home the selected axis only. Each axis must be selected and homed separately.
fr: Si la machine dispose de contacts d'origine mais n'a pas de séquence de prise d'origine définie dans le fichier ini, le bouton 'POM générale' effectuera uniquement la prise d'origine de l'axe sélectionné. Cette procédure doit alors être réalisée, séparément pour chacun des axes.

source: If your machine does not have home switches defined in the configuration the 'Home' button will set the current selected axis current position to be the absolute position 0 for that axis and will set the 'is-homed' bit for that axis.
fr: Si la machine ne dispose d'aucun contact d'origine défini dans la configuration, le bouton 'POM générale' définira la position actuelle del'axe comme étant la position d'origine machine et l'axe sera marqué comme ayant sa prise d'origine machine faite.

source: See the Integrator Manual for more information on homing.
fr: Voir le manuel de la configuration pour d'autres informations sur la prise d'origine.

source: .Touch Off
fr: .Toucher[[cap:Toucher]]

source: By pressing 'Touch Off' or the END key, the 'G54 offset' for the current axis is changed so that the current axis value will be the specified value. Expressions may be entered using the rules for rs274ngc programs, except that variables may not be referred to. The resulting value is shown as a number.
fr: Si le bouton 'Toucher' ou la touche 'FIN' sont appuyés, le décalage d'origine pièce, 'offset G54' de l'axe courant, est modifié de sorte que la valeur courante de l'axe devienne celle spécifiée. Sur la figure ci-dessous: P1 G54, prendra la valeur spécifiée dans le champ de la boite de dialogue. Les expressions peuvent être entrées en suivant les règles de programmation rs274ngc, sauf les variables qui ne peuvent pas être utilisées. La valeur résultante sera affichée sous le champ. Exemple, pour faire la prise d'origine pièce, on affleure l'outil sur une cale de 5mm d'épaisseur posée sur le bloc, on presse le bouton 'Toucher' et on saisi 5 dans le champ de la boîte de dialogue. La pointe de l'outil sera alors référencée à 0 sur la surface du bloc.

source: .Touch Off[[cap:Touch-Off]]
fr: .Fenêtre du Toucher

source: image::images/touchoff.png[align="center"]
fr: image::images/touchoff_fr.png[]

source: See also the 'Tool touch off to workpiece' and 'Tool touch off to fixture' options in the Machine menu.
fr: Voir aussi les options du menu Machine: 'Toucher la pièce' et 'Toucher le porte-pièce'.

source: .Override Limits
fr: .Dépassement de limite

source: By pressing Override Limits, the machine will temporarily be allowed to jog off of a physical limit switch. This check box is only available when a limit switch is tripped. The override is reset after one jog. If the axis is configured with separate positive and negative limit switches, LinuxCNC will allow the jog only in the correct direction. _Override Limits will not allow a jog past a soft limit. The only way to disable a soft limit on an axis is to Unhome it._
fr: En appuyant sur 'Mouvement temporaire hors limites', la machine sera temporairement autorisée à se déplacer au delà d'un contact de limite physique. Cette case à cocher n'est disponible que lorsqu'un fin de course est enfoncé. Elle est désactivée après le premier mouvement de jogging. Si l'axe est configuré avec des contacts positifs et négatifs séparés, LinuxCNC permettra le jogging uniquement dans le sens du dégagement. 'Mouvement temporaire hors limites ne permettra pas un jogging au delà d'une limite logicielle. La seule façon de désactiver une limite logicielle sur un axe est d'annuler sa prise d'origine'.

source: .The Spindle group (((AxisUI, spindle)))
fr: .Le groupe 'Broche' (((Broche)))

source: The buttons on the first row select the direction for the spindle to rotate: Counterclockwise, Stopped, Clockwise. Counterclockwise will only show up if the pin 'motion.spindle-reverse' is in the HAL file (it can be 'net trick-axis motion.spindle-reverse' ). The buttons on the next row increase or decrease the rotation speed. The checkbox on the third row allows the spindle brake to be engaged or released. Depending on your machine configuration, not all the items in this group may appear. Pressing the spindle start button sets the 'S' speed to 1.
fr: Les boutons de la première rangée permettent de sélectionner la direction de rotation de la broche: Sens anti-horaire, Arrêt, Senshoraire. Sens anti-horaire sera visible seulement si la pin de Hal 'motion.spindle-reverse' est présente dans le fichier HAL, par exemple sous la forme: 'net trick-axis motion.spindle-reverse' ). Les boutons de la rangée suivante augmentent ou diminuent la fréquence de rotation. La case à cocher de la troisième rangée permet d'engager ou de relâcher le frein de broche. Selon la configuration de votre machine, ces éléments n'apparaîtront peut être pas tous. Presser le bouton Démarrer fixe la vitesse 'S' à 1.

source: .The Coolant group (((AxisUI, coolant)))
fr: .Le groupe 'Arrosage' (((Arrosage)))

source: The two buttons allow the 'Mist' and 'Flood' coolants to be turned on and off. Depending on your machine configuration, not all the items in this group may appear.
fr: Ces deux boutons permettent d'activer les 'gouttelettes' et l''Arrosage fluide' ou de les désactiver. Selon la configuration de votre machine, ces boutons n'apparaîtront peut être pas tous.

source: === MDI (((AxisUI, MDI)))
fr: === Données manuelles (MDI)

source: MDI allows G-code commands to be entered manually. When the machine is not turned on, or when a program is running, the MDI controls are unavailable.
fr: L'onglet d'entrée de données manuelles (encore appelé MDI), permet d'entrer et d'exécuter manuellement et une par une, des lignes de programme en G-code. Quand la machine n'est pas en marche, ou quand un programme est en cours d'exécution, cet onglet n'est pas opérationnel.

source: .The MDI tab[[cap:The-MDI-tab]]
fr: .L'onglet Données manuelles[[cap:The-MDI-tab]]

source: image::images/axis-mdi.png[align="center"]
fr: image::images/axis-codeentry_fr.png[]

source: 'History' - This shows MDI commands that have been typed earlier in this session.
fr: 'Historique' - Affiche les commandes précédemment tapées et au cours des session précédentes.

source: * 'MDI Command' - This allows you to enter a g-code command to be executed. Execute the command by pressing Enter or by clicking 'Go'.
fr: * 'Commande MDI' - Ce champ permet la saisie d'une ligne de commande à exécuter. La commande sera exécutée par l'appui de la touche <Entrée> ou un appui sur le bouton 'Envoi'.

source: * 'Active G-Codes' - This shows the 'modal codes' that are active in the interpreter. For instance, 'G54' indicates that the 'G54 offset' is applied to all coordinates that are entered. When in Auto the Active G-Codes represent the codes after any read ahead by the interpreter.
fr: * 'G-Codes actifs' - Cette fenêtre affiche les 'codes modaux' actuellement actifs dans l'interpréteur. Par exemple, 'G54' indique que le système de décalage d'origine actuel est 'G54' qui s'appliquera à toutes les coordonnées qui seront entrées.

source: === Feed Override (((AxisUI, feed override)))
fr: === Correcteurs de vitesse (((Correcteurs de vitesse)))

source: By moving this slider, the programmed feed rate can be modified. For instance, if a program requests 'F60' and the slider is set to 120%, then the resulting feed rate will be 72.
fr: En déplaçant le curseur, la vitesse de déplacement programmée peut être modifiée. Par exemple, si un programme requiert une vitesse à F600 et que le curseur est placé sur 120%, alors la vitesse résultante sera de 720.

source: === Spindle Speed Override (((AxisUI, spindle speed override)))
fr: === Correcteur de vitesse de broche (((Correcteur de vitesse broche)))

source: By moving this slider, the programmed spindle speed can be modified. For instance, if a program requests S8000 and the slider is set to 80%, then the resulting spindle speed will be 6400. This item only appears when the HAL pin 'motion.spindle-speed-out' is connected.
fr: En déplaçant ce curseur, la vitesse programmée de la broche peut être modifiée. Par exemple, si un programme requiert une vitesse à F8000 et que le curseur est placé sur 80%, alors la fréquence de rotation résultante sera de 6400. Cet élément n'apparaît que si la 'HAL pin' 'motion.spindle-speed-out' est connectée dans le fichier .hal.

source: === Jog Speed (((AxisUI, jog speed)))
fr: === Vitesse de Jog (((Vitesse de jog)))

source: By moving this slider, the speed of jogs can be modified. For instance, if the slider is set to 1 in/min, then a .01 inch jog will complete in about .6 seconds, or 1/100 of a minute. Near the left side (slow jogs) the values are spaced closely together, while near the right side (fast jogs) they are spaced much further apart, allowing a wide range of jog speeds with fine control when it is most important.
fr: En déplaçant ce curseur, la vitesse de jog peut être modifiée. Par exemple, si ce curseur est placé sur 100 mm/mn, alors un jog de 1 mm durera .6 secondes, ou 1/100 de minute. Du côté gauche du curseur (jog lent) l'espacement des valeurs est petit alors que du côté droit (jog rapide) l'espacement des valeurs est plus grand, cela permet une large étendue de vitesses de jog avec un contrôle plus fin du curseur dans les zones les plus importantes.

source: On machines with a rotary axis, a second jog speed slider is shown. This slider sets the jog rate for the rotary axes (A, B and C).
fr: Sur les machines avec axes rotatifs, un second curseur de vitesse est présent. Il permet d'ajuster la vitesse de rotation des axes rotatifs (A, B et C).

source: === Max Velocity (((AxisUI, Max Velocity)))
fr: === Vitesse Maxi (((Vitesse maxi)))

source: By moving this slider, the maximum velocity can be set. This caps the maximum velocity for all programmed moves except spindle-synchronized moves.
fr: En déplaçant ce curseur, la vitesse maximale peut être réglée. Ceci couvre la vitesse maximale de tous les mouvements programmés, sauf les mouvements avec broche synchronisée.

source: == Keyboard Controls (((AxisUI, keyboard shortcuts)))
fr: == Raccourcis clavier

source: Almost all actions in AXIS can be accomplished with the keyboard. A full list of keyboard shortcuts can be found in the AXIS Quick Reference, which can be displayed by choosing Help > Quick Reference. Many of the shortcuts are unavailable when in MDI mode.
fr: La plupart des actions d'AXIS sont accessibles depuis le clavier. La liste complète des raccourcis clavier est disponible dans l'aide rapide d'AXIS qui s'affiche en cliquant sur Aide -> Aide rapide . Beaucoup de ces raccourcis sont inaccessible en mode Entrées manuelles.

source: .Feed Override Keys
fr: .Touches des correcteurs de vitesse

source: The Feed Override keys behave differently when in Manual Mode. The keys '12345678 will select an axis if it is programed. If you have 3 axis then ' will select axis 0, 1 will select axis 1, and 2 will select axis 2. The remainder of the number keys will still set the Feed Override. When running a program '1234567890 will set the Feed Override to 0% - 100%.
fr: Les touches des correcteurs de vitesse se comportent différemment en mode manuel. Les touches '12345678' sélectionneront l'axe correspondant, si il est programmé. Si 3 axes sont utilisés, alors '*' sélectionnera l'axe 0, '1' sélectionnera l'axe 1 et '2' sélectionnera l'axe 2. Pendant l'exécution d'un programme, les touches '1234567890' fixeront la correction de vitesse travail entre 10% et 100%.

source: The most frequently used keyboard shortcuts are shown in the following Table
fr: Les raccourcis clavier les plus fréquents sont visibles dans la table ci-dessous.

source: .Most Common Keyboard Shortcuts[[cap:Most-Common-Keyboard]]
fr: .Raccourcis clavier usuels[[cap:Raccourcis-clavier-usuels]]

source: [width="80%", options="header", cols="^,<,^"] |==================================================================== |Keystroke | Action Taken | Mode |F1 | Toggle Emergency Stop | All |F2 | Turn machine on/off | All |`, 1 .. 9, 0 | Set feed override from 0% to 100% | Varies |X, ` | Activate first axis | Manual |Y, 1 | Activate second axis | Manual |Z, 2 | Activate third axis | Manual |A, 3 | Activate fourth axis | Manual |I | Select jog increment | Manual |C | Continuous jog | Manual |Control-Home | Perform homing sequence | Manual |End | Touch off: Set G54 offset for active axis | Manual |Left, Right | Jog first axis | Manual |Up, Down | Jog second axis | Manual |Pg Up, Pg Dn | Jog third axis | Manual |[, ] | Jog fourth axis | Manual |O | Open File | Manual |Control-R | Reload File | Manual |R | Run file | Manual |P | Pause execution | Auto |S | Resume Execution | Auto |ESC | Stop execution | Auto |Control-K | Clear backplot | Auto/Manual |V | Cycle among preset views | Auto/Manual |Shift-Left,Right | Rapid X Axis | Manual |Shift-Up,Down | Rapid Y Axis | Manual |Shift-PgUp, PgDn | Rapid Z Axis | Manual |====================================================================
fr: [width="90%", options="header"] |==================================================================== |Touches | Actions produites | Mode |F1 | Bascule l'arrêt d'urgence | Tous |F2 | Bascule le marche/arrêt machine | Tous |`, 1 .. 9, 0 | Correcteurs de vitesse de 10% à 100% | Varie |X, * | Active le premier axe | Manuel |Y, 1 | Active le deuxième axe | Manuel |Z, 2 | Active le troisième axe | Manuel |A, 3 | Active le quatrième axe | Manuel |I | Sélection d'incrément du jog | Manuel |C | jog en mode continu | Manuel |Ctrl+origine | Lance une séquence de POM | Manuel |Fin | Toucher: valide l'offset G54 de l'axe actif | Manuel |Gauche, Droite | Jog du premier axe | Manuel |Up, Down | Jog du deuxième axe | Manuel |Pg Up, Pg Dn | Jog du troisième axe | Manuel |[, ] | Jog du quatrième axe | Manuel |O | Ouvrir un fichier | Manuel |Ctrl+R | Recharger le fichier courant | Manuel |R | Exécuter le programme | Manuel |P | Pause dans l'exécution du programme | Auto |S | Reprise de l'exécution du programme | Auto |ESC | Stopper l'exécution | Auto |Ctrl+K | Rafraichi le tracé d'outil | Auto/Manuel |V | Défilement cyclique des vues prédéfinies | Auto/Manuel |Maj-gauche,droite| Axe X vitesse rapide | Manuel |Maj-haut, bas | Axe Y vitesse rapide | Manuel |Maj-PgUp, PgDn | Axe Z vitesse rapide | Manuel |====================================================================

source: == Show LinuxCNC Status (linuxcnctop)
fr: == Affichage de l'état de LinuxCNC (LinuxCNCtop)

source: AXIS includes a program called 'linuxcnctop' which shows some of the details of LinuxCNC's state. You can run this program by invoking Machine > Show LinuxCNC Status
fr: AXIS inclut un programme appelé 'linuxcnctop' qui affiche en détail l'état de LinuxCNC. Ce programme est accessible dans le menu Machine > Fenêtre d'état de LinuxCNC.

source: .LinuxCNC Status Window[[cap:LinuxCNC-Status-Window]]
fr: .Fenêtre d'état de LinuxCNC

source: image::images/axis-emc-status.png[align="center"]
fr: image::images/axis-emc-status.png[]

source: The name of each item is shown in the left column. The current value is shown in the right column. If the value has recently changed, it is shown on a red background.
fr: Le nom de chaque entrée est affiché dans la colonne de gauche. La valeur courante de chaque entrée s'affiche dans la colonne de droite. Si la valeur a changé récemment, elle s'affiche en surbrillance rouge.

source: == MDI interface
fr: == Entrée de données en texte (MDI)

source: AXIS includes a program called `mdi` which allows text-mode entry of MDI commands to a running LinuxCNC session. You can run this program by opening a terminal and typing
fr: AXIS inclut un programme appelé 'mdi', il permet d'envoyer des commandes à la session de LinuxCNC en cours, sous forme de lignes de texte. Vous pouvez lancer ce programme en ouvrant une console et en tapant:

source: Once it is running, it displays the prompt 'MDI>'. When a blank line is entered, the machine's current position is shown. When a command is entered, it is sent to LinuxCNC to be executed.
fr: En cours d'exécution il affiche le prompt: 'MDI>'. Quand une ligne vide est entrée, la position courante de la machine est affichée. Quand une commande est entrée, elle est passée à LinuxCNC qui l'exécute.

source: This is a sample session of mdi.
fr: Voici un exemple de session MDI.

source: AXIS includes a program called 'axis-remote' which can send certain commands to a running AXIS. The available commands are shown by running 'axis-remote --help' and include checking whether AXIS is running ('--ping'), loading a file by name, reloading the currently loaded file ('--reload'), and making AXIS exit ('--quit').
fr: AXIS inclut un programme appelé 'axis-remote' qui permet d'envoyer certaines commandes vers l'application AXIS en fonctionnement.Les commandes disponibles sont visibles en faisant: 'axis-remote --help' pour vérifier qu'AXIS est en marche, inclure: ('--ping'), charger un fichier, recharger le fichier courant avec: ('--reload') et quitter le programme AXIS avec: ('--quit').

source: == Manual Tool Change[[sec:Manual-Tool-Change]]
fr: == Changement d'outil manuel[[sec:Changement-D-Outil-Manuel]]

source: (((Manual Tool Change)))
fr: (((Changement D'Outil Manuel)))

source: LinuxCNC includes a userspace HAL component called 'hal_manualtoolchange', which shows a window prompt telling you what tool is expected when a 'M6' command is issued. After the OK button is pressed, execution of the program will continue.
fr: LinuxCNC inclut un composant userspace HAL appelé 'hal_manualtoolchange', quand la commande 'M6' est invoquée, il ouvre une fenêtre d'appel d'outil, visible plus bas, donnant le N° de l'outil à monter. Dés que le bouton 'Continuer' est pressé, l'exécution du programme reprend.

source: The hal_manualtoolchange component includes a hal pin for a button that can be connected to a physical button to complete the tool change and remove the window prompt (hal_manualtoolchange.change_button).
fr: Le composant hal_manualtoolchange, inclus une pin de Hal pouvant être connectée à un bouton physique sur lequel un appui achève la procédure de changement d'outil et ferme la fenêtre surgissante (hal_manualtoolchange.change_button).

source: The HAL configuration file 'configs/sim/axis_manualtoolchange.hal' shows the HAL commands necessary to use this component.
fr: Le fichier de configuration HAL 'configs/sim/axis_manualtoolchange.hal' montre les commandes HAL nécessaires pour l'utilisation de ce composant.

source: hal_manualtoolchange can be used even when AXIS is not used as the GUI. This component is most useful if you have presettable tools and you use the tool table.
fr: hal_manualtoolchange peut être utilisé même si l'interface graphique AXIS n'est pas en service. Cette composante est particulièrement utile si vous avez des outils pré-réglés et que vous utilisez une table d'outils.

source: [NOTE] Important Note: Rapids will not show on the preview after a T<n> is issued until the next feed move after the M6. This can be very confusing to most users. To turn this feature off for the current tool change program a G1 with no move after the T<n>.
fr: [NOTE] Le parcours d'outil d'un mouvement en vitesse rapide ne sera pas visible s'il suit un changement d'outil T<n> et ce, jusqu'au prochain mouvement suivant le M6. Ceci peut être source de confusion pour l'opérateur. Pour contourner cette particularité, ajoutez toujours un G1 sans mouvement derrière un M6 T<n>.

source: .The Manual Toolchange Window[[cap:The-Manual-Toolchange]]
fr: .La fenêtre de changement manuel d'outil[[cap:Changement-manuel-d-outil]]

source: image::images/manual-tool-change.png[align="center"]
fr: image::images/manualtoolchange_fr.png[]

source: == Python modules
fr: == Modules en Python

source: AXIS(((AXIS))) includes several Python(((Python))) modules which may be useful to others. For more information on one of these modules, use 'pydoc <module name>' or read the source code. These modules include:
fr: AXIS(((AXIS))) inclut plusieurs modules en Python(((Python))) qui peuvent être très utiles. Pour des informations complètes sur cesmodules, faites: 'pydoc <nom du module' ou lisez son code source. Modules inclus:

source: 'emc' provides access to the LinuxCNC command, status, and error channels
fr: 'emc' fournit l'accès aux commandes de LinuxCNC, à son état et aux chaînes d'erreur

source: 'gcode' provides access to the rs274ngc interpreter
fr: 'gcode' fournit l'accès à l'interpréteur RS274NGC

source: 'rs274' provides additional tools for working with rs274ngc files
fr: 'rs274' fournit des outils supplémentaires pour travailler sur les fichiers RS274NGC

source: 'hal' allows the creation of userspace HAL components written in Python
fr: 'hal' permet la création par l'utilisateur de composants de HAL écrits en Python

source: '_togl' provides an OpenGL widget that can be used in Tkinter applications
fr: '_togl' fournit des éléments OpenGL utilisables dans les applications Tkinter

source: 'minigl' provides access to the subset of OpenGL used by AXIS
fr: 'minigl' fournit l'accès aux sous-ensembles d'OpenGL utilisés par AXIS

source: To use these modules in your own scripts, you must ensure that the directory where they reside is on Python's module path. When running an installed version of LinuxCNC, this should happen automatically. When running 'in-place', this can be done by using 'scripts/rip-environment'.
fr: Pour utiliser ces modules dans vos propres scripts, assurez-vous que le répertoire où ils se trouvent est dans le chemin d'accès des modules Python. Avec une version installée de LinuxCNC, ça se fera automatiquement. Avec une version installée en 'en-place', ça peut être fait avec l'aide de: '/scripts/rip-environment'.

source: == Using AXIS in Lathe Mode (((AXIS in lathe mode)))
fr: == Utiliser AXIS en mode tour (((AXIS avec un tour)))

source: By including the line 'LATHE = 1' in the [DISPLAY] section of the ini file, AXIS selects lathe mode. The 'Y' axis is not shown in coordinate readouts, the view is changed to show the Z axis extending to the right and the X axis extending towards the bottom of the screen, and several controls (such as those for preset views) are removed. The coordinate readouts for X are replaced with diameter and radius.
fr: En incluant la ligne LATHE = 1 dans la section [DISPLAY] du fichier ini, AXIS sélectionnera le mode tour. L'axe Y ne s'affiche pas parmi les coordonnées, la vue est modifiée pour placer la broche à gauche, l'axe Z horizontalement avec son côté positif vers la droite '(Z+)' et l'axe X s'étendant vers le bas de l'écran '(X+)'. Plusieurs contrôles (tels que ceux des vues prédéfinies) sont supprimés. Les lectures de coordonnées pour X sont désormais en diamètre et en rayon.

source: Pressing 'V' zooms out to show the entire file, if one is loaded.
fr: La touche 'V' agit alors sur le zoom pour afficher le tracé complet du fichier chargé.

source: When in lathe mode, the shape of the loaded tool (if any) is shown.
fr: En mode tour (lathe), la forme et l'orientation de l'outil chargé sont représentés.

source: .Lathe Tool Shape[[cap:Lathe-Tool-Shape]]
fr: .Représentation de l'outil en mode tour[[cap:Lathe-Tool-Shape]]

source: image:images/axis-lathe-tool.png[align="center"]
fr: image::images/axis-lathe-tool.png[]

source: == Advanced Configuration
fr: == Configuration avancée d'AXIS
