Repository: 0000duck/linuxcnc
Catalog: docs/src/gui/axis.*.po
Languages: fr

source: For more information on ini file settings that can change how AXIS works see the INI File/Sections/[DISPLAY] Section of Configuration chapter in the Integrator manual.
fr: Pour plus d'informations sur les paramètres du fichier ini pouvant modifier le fonctionnement d'AXIS, voir le fichier ini, sections [DISPLAY] et le chapitre sur la configuration dans le manuel de configuration.

source: === Program Filters
fr: === Filtres de programme

source: AXIS has the ability to send loaded files through a 'filter program'. This filter can do any desired task: Something as simple as making sure the file ends with 'M2', or something as complicated as generating G-Code from an image.
fr: AXIS a la capacité d'envoyer des fichiers chargés à travers un 'filtre de programme'. Ce filtre peut faire diverses tâches: Simple, comme s'assurer que le programme se termine bien par un 'M2' ou complexe, comme détecter que l'entrée est une image et générer le g-codequi permettra d'usiner sa forme.

source: The '[FILTER]' section of the ini file controls how filters work. First, for each type of file, write a 'PROGRAM_EXTENSION' line. Then, specify the program to execute for each type of file. This program is given the name of the input file as its first argument, and must write rs274ngc code to standard output. This output is what will be displayed in the text area, previewed in the display area, and executed by LinuxCNC when 'Run'. The following lines add support for the 'image-to-gcode' converter included with LinuxCNC:
fr: La section [FILTER] du fichier ini défini comment les filtres doivent agir. Premièrement, pour chaque type de fichier, écrire une ligne PROGRAM_EXTENSION puis, spécifier le programme à exécuter pour chaque type de fichier. Ce programme reçoit comme argument le nom du fichier d'entrée, il doit produire le G-code selon le standard rs274ngc, en sortie. Les lignes de cette sortie s'affichent alors dans la zone de texte, le parcours d'outil résultant est visible dans la zone graphique, enfin il sera exécuté quand LinuxCNC recevra la commande 'Exécuter le programme'. Les lignes suivantes fournissent la possibilité d'utiliser 'image-to-gcode', le convertisseur d'imagesfourni avec LinuxCNC:

source: It is also possible to specify an interpreter:
fr: Il est également possible de spécifier un interpréteur:

source: In this way, any Python script can be opened, and its output is treated as g-code. One such example script is available at 'nc_files/holecircle.py'. This script creates g-code for drilling a series of holes along the circumference of a circle.
fr: De cette manière, n'importe quel script Python pourra être ouvert et sa sortie traitée comme du G-code. Un autre exemple est disponibledans: '/nc_files/holecircle.py' . Ce script crée le G-code pour percer une série de trous suivant un arc de cercle.

source: .Circular Holes[[cap:Circular-Holes]]
fr: .Perçages circulaires

source: image::images/holes.png[align="center"]
fr: image::images/holes.png[]

source: If the environment variable AXIS_PROGRESS_BAR is set, then lines written to stderr of the form
fr: Si la variable d'environnement: AXIS_PROGRESS_BAR est active, alors les lignes seront écrites sur stderr de la forme:

source: will set the AXIS progress bar to the given percentage. This feature should be used by any filter that runs for a long time.
fr: AXIS fixera la barre de progression selon le pourcentage donné. Cette fonction devrait être utilisée pour un filtre qui fonctionne suffisamment longtemps.

source: === The X Resource Database
fr: === La base de données des ressources X

source: The colors of most elements of the AXIS user interface can be customized through the X Resource Database. The sample file 'axis_light_background' changes the colors of the backplot window to a 'dark lines on white background' scheme, and also serves as a reference for the configurable items in the display area. The sample file 'axis_big_dro' changes the position readout to a larger size font. To use these files:
fr: Les couleurs de la plupart des éléments de l'interface utilisateur d'AXIS peuvent être personnalisées grâce à la base de données X. Lefichier 'axis_light_background' modifie les couleurs de la fenêtre du parcours d'outil sur le modèle 'lignes noires et fond blanc', il sert aussi de référence des éléments configurables dans l'écran graphique. L'exemple de fichier 'axis_big_dro' modifie la visu avec une police de plus grande taille. Pour utiliser ces fichiers faire:

source: xrdb -merge /usr/share/doc/emc2/axis_light_background
fr: xrdb -merge /usr/share/doc/linuxcnc/axis_light_background

source: xrdb -merge /usr/share/doc/emc2/axis_big_dro ----
fr: xrdb -merge /usr/share/doc/linuxcnc/axis_big_dro ----

source: For information about the other items which can be configured in Tk applications, see the Tk man pages.
fr: Pour plus d'informations au sujet des éléments configurables dans les applications Tk, référez vous aux pages de man de Tk.

source: Because modern desktop environments automatically make some settings in the X Resource Database that adversely affect AXIS, by default these settings are ignored. To make the X Resource Database items override AXIS defaults, include the following line in your X Resources:
fr: Les bureaux graphiques modernes effectuent certains réglages dans la base de données des ressources X ces réglages peuvent affecter ceux d'AXIS, par défaut ces réglages sont ignorés. Pour que les éléments des ressources X écrasent ceux par défaut dans AXIS, il faut inclure cette ligne dans vos ressources X:

source: // These asterisks are not for bold,
fr: // ces astérisques ne sont pas là pour le bold,

source: // in this case, we want the asterisks to actually appear.
fr: // nous voulons qu'ils apparaissent dans le texte

source: this causes the built-in options to be created at the option level 'widgetDefault', so that X Resources (which are level 'userDefault') can override them.
fr: ce qui entraînera la construction des options au niveau 'widgetDefault', de sorte que les ressources X (qui sont elles, au niveau 'userDefault') puissent l'emporter.

source: === Physical jog wheels[[sub:Physical-jog-wheels]]
fr: === Manivelle de jog[[sub:Manivelle-de-jog]]

source: To improve the interaction of AXIS with physical jog wheels, the axis currently selected in the GUI is also reported on a pin with a name like 'axisui.jog.x'. One of these pins is 'TRUE' at one time, and the rest are 'FALSE'. These are meant to control motion's jog-enable pins.
fr: Pour accroître l'interaction d'AXIS avec une manivelle de jog physique, l'axe actif courant sélectionné dans l'interface graphique est aussi reporté sur une pin de Hal ayant un nom comme 'axisui.jog.x'. Excepté pendant un court instant après que l'axe courant ait changé, une seule de ces pins à la fois est 'TRUE', les autres restent 'FALSE'.

source: After AXIS has created these HAL pins, it executes the HAL file named in '[HAL]POSTGUI_HALFILE'. Unlike '[HAL]HALFILE', only one such file may be used.
fr: Après qu'AXIS ait créé ces pins de Hal, il exécute le fichier HAL déclaré avec: [HAL]POSTGUI_HALFILE. Ce qui diffère de [HAL]HALFILE, qui lui ne s'utilise qu'une seule fois.

source: If it exists, the contents of '~/.axisrc' are executed as Python source code just before the AXIS GUI is displayed. The details of what may be written in the axisrc are subject to change during the development cycle.
fr: Si il existe, le contenu de: '~/.axisrc' est exécuté comme un code source Python juste avant l'ouverture de l'interface graphique d'AXIS. Les détails de ce qui peut être écrit dans .axisrc sont sujets à changement durant le cycle de développement.

source: The following adds Control-Q as a keyboard shortcut for Quit.
fr: Les lignes ci-dessous ajoutent un Ctrl+Q comme raccourci clavier pour Quitter.

source: === External Editor (((External Editor)))
fr: === Éditeur externe (((Éditeur externe)))

source: The menu options File > Edit... and File > Edit Tool Table... become available after defining the editor in the ini section [DISPLAY]. Useful values include EDITOR=gedit and EDITOR=gnome-terminal -e vim. For more information, see the DISPLAY section of the INI Configuration Chapter in the Integrator Manual.
fr: En définissant: [DISPLAY]EDITOR , les options de menu: 'Fichier' → 'Éditer' ainsi que 'Fichier' → 'Éditer la table d'outils', deviennent accessibles. Deux valeurs qui fonctionnent bien: EDITOR=gedit et 'EDITOR=gnome-terminal -e nano'.

source: === Virtual Control Panel (((Virtual Control Panel)))
fr: === Panneau de contrôle virtuel (((Panneau de contrôle virtuel)))

source: AXIS can display a custom virtual control panel in the right-hand pane. You can program buttons, indicators, data displays and more. For more information, see the Integrator Manual.
fr: AXIS peut afficher un panneau de commande virtuel personnalisé dans le volet de droite. Il est possible d'y placer des boutons, des indicateurs qui afficheront des données et plus encore.

source: === Axis Preview Control [[sub:axis-preview-control]](((Axis Preview Control)))
fr: === Commentaires spéciaux[[sub:Commentaires-speciaux]]

source: Special comments can be inserted into the G Code file to control how the preview of AXIS behaves. In the case where you want to limit the drawing of the preview use these special comments. Anything between the (AXIS,hide) and (AXIS,show) will not be drawn during the preview. The (AXIS,hide) and (AXIS,show) must be used in pairs with the (AXIS,hide) being first. Anything after a (AXIS,stop) will not be drawn during the preview.
fr: Les commentaires spéciaux peuvent être insérés dans le fichier de G-code pour contrôler le comportement de l'affichage d'AXIS. Pour limiter l'aperçu au seul affichage du parcours d'outil, utiliser ces commentaires spéciaux. Rien ne s'affichera entre le commentaire (AXIS,hide) et le commentaire (AXIS,show) sauf le parcours d'outil. Les (AXIS,hide) et (AXIS,show) doivent être utilisés par paires avec le (AXIS, hide) en premier. Tout ce qui est après un (AXIS,stop) ne sera pas visible.

source: These comments are useful to unclutter the preview display (for instance while debugging a larger g-code file, one can disable the preview on certain parts that are already working OK).
fr: Ces commentaires sont utiles pour désencombrer l'affichage d'aperçu (Par exemple pendant le débogage d'un grand fichier G-code, on peut désactiver l'aperçu sur certaines parties qui sont déjà fonctionnelles).

source: (AXIS,hide) Stops the preview (must be first)
fr: (AXIS,hide) Arrête le parcours d'outil (à placer en premier)

source: (AXIS,show) Resumes the preview (must follow a hide)
fr: (AXIS,show) Reprend le parcours d'outil (il faut suivre un cache)

source: (AXIS,stop) Stops the preview from here to the end of the file.
fr: (AXIS,stop) Arrête le parcours d'outil d'ici à la fin du fichier.

source: - (AXIS,notify,the_text) Displays the_text as an info display This display can be useful in the Axis preview when (debug,message) comments are not displayed.
fr: - (AXIS,notify,le_texte) Affiche 'le_texte' à l'écran, comme une info. Cet affichage peut être très utile lors du pré-affichage du parcours d'outil, quand les commentaires (debug,message) ne sont pas affichés.
