Repository: 0000duck/linuxcnc
Catalog: docs/src/gui/gmoccapy.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: 'GMOCCAPY(((GMOCCAPY))) is a GUI for linuxcnc, designed to be used with a touch screen, but can also be used on normal screens with a mouse or hardware buttons and MPG wheels, as it presents HAL Pins for the most common needs. Please find more information in the following.'
fr: 'GMOCCAPY(((GMOCCAPY))) est une GUI pour LinuxCNC, conçue pour être utilisée avec un écran tactile, mais qui peut également être utilisée avec un écran normal et la souris ou, des boutons de commande et une manivelle MPG, car il offre toutes les pins HAL les plus courantes pour ces besoins. D'autres informations plus loin dans ce texte.'

source: 'It offers the possibility to display up to 4 axis, support a lathe mode for normal and back tool lathe and can be adapted to nearly every need, because gmoccapy supports embedded tabs and side panels. As a good example for that see http://wiki.linuxcnc.org/cgi-bin/wiki.pl?Gmoccapy_plasma[gmoccapy_plasma]'
fr: 'Il offre la possibilité d'afficher jusqu'à 4 axes, supporte les tours en mode outil frontal, ou en mode outil arrière et peut être adapté à presque tous les besoins, parce qu’il supporte les onglets intégrés et les panneaux latéraux. Un bon exemple se trouve ici: http://wiki.linuxcnc.org/cgi-bin/wiki.pl?Gmoccapy_plasma'

source: 'It has support for integrated onboard keyboard (onboard or matchbox-keyboard), so there is no need for a hardware keyboard or mouse, but it can also be used with that hardware. Gmoccapy offers a separate settings page to configure most settings of the GUI without editing files.'
fr: 'Il supporte un clavier embarqué (embarqué ou clavier matchbox), il n'y a donc pas besoin d'un clavier physique ni d'une souris, bien qu'ils soient également possible d'utiliser ces matériels. Gmoccapy offre une page de réglage complètement séparée pour configurer la plupart des éléments graphiques de l'interface, sans avoir à éditer de fichier.'

source: 'gmoccapy can be localized very easy, because the corresponding files are separated from the linuxcnc.po files, so there is no need to translate unneeded stuff. The files are placed in */src/po/gmoccapy*. Just copy the gmoccapy.pot file to something like fr.po and translate that file with gtranslator or poedit. After a make you got the GUI in your preferenced language. Please publish your translation, so it can be included in the oficial packages and be published to other users. At the Moment it is available in English, German, Spanish, Polish and Serbian. Feel free to help me to introduce more languages, *nieson@web.de*. If you need help, don't hesitate to ask.'
fr: 'gmoccapy peut être traduit très facilement, parce que les fichiers de traductions sont séparés des .po de linuxcnc, ainsi, il n'est pas utile de traduire des fichiers pas nécessaires. Ces fichiers sont placés dans */src/po/gmoccapy*. Copier juste le fichier gmoccapy.pot en quelque chose comme fr.po et traduire ce fichier avec poedit ou gtranslator. Après un make, la GUI traduite est disponible dans votre langue préférée. S'il vous plaît, publiez votre traduction, ainsi, elle sera incluse dans les paquets officiels et publiée pour les autres utilisateurs. Les langues actuellement disponibles sont l'anglais, l'allemand, l'espagnol, le polonais et le serbe. Vous pouvez m'aider à introduire de nouvelles langues, *nieson@web.de*. Si vous avez besoin d'aide, n'hésitez pas à en demander.'

source: == Requirements
fr: == Exigences

source: Gmoccapy has been tested on UBUNTU 10.04 and 12.04 and DEBIAN Wheesy, with LinuxCNC 2.6 ,2.7 , master and machinekit, if you use other versions, please inform about problems or solutions on the forum or the https://lists.sourceforge.net/lists/listinfo/emc-users[emc-users mailing list]
fr: Gmoccapy a été testé avec succès sur UBUNTU 10.04 et 12.04, sur DEBIAN Wheezy avec LinuxCNC 2.6, 2.7, master et machinekit. Si vous utilisez d'autres versions, merci de m'informer sur le forum ou la liste de diffusion à propos des problèmes ou solutions rencontrés.

source: in German http://www.cncecke.de/forum/showthread.php?t=78549[Peters CNC Ecke] + in English http://www.linuxcnc.org/index.php/english/forum/41-guis/26314-gmoccapy-a-new-screen-for-linuxcnc[gmoccapy on linuxcnc] +
fr: En Allemand: http://www.cncecke.de/forum/showthread.php?t=78549[Peters CNC Ecke] En Anglais: http://www.linuxcnc.org/index.php/english/forum/41-guis/26314-gmoccapy-a-new-screen-for-linuxcnc[gmoccapy sur linuxcnc] +

source: The minimum screen resolution for gmoccapy, using it without side panels is *979 x 750 Pixel*, so it should fit to every standard screen.
fr: La résolution minimale de l'écran pour gmoccapy sans panneau latéral, est *979 x 750 Pixel*, ainsi, il peut tenir sur tout écran standard.

source: == How to get gmoccapy
fr: == Comment obtenir gmoccapy

source: Beginning with LinuxCNC 2.6 gmoccapy is included in the standard installation. So the easiest way to get gmoccapy on you controlling PC, is just to get the http://www.linuxcnc.org/index.php/english/download[actual ISO] and install from the CD / DVD /USB-Stick.
fr: Depuis LinuxCNC 2.6, gmoccapy est inclus dans l'installation standard. Ainsi, il suffit d'utiliser l'image correspondante au PC de contrôle, disponible ici: http://www.linuxcnc.org/index.php/english/download[L'ISO actuelle] puis de l'installer à l'aide d'un CD/DVD/clé USB.

source: If you do have already installed an earlier LinuxCNC version, check how to update http://wiki.linuxcnc.org/cgi-bin/wiki.pl?UpdatingTo2.6[here]
fr: Si vous utilisez déjà une version plus ancienne de LinuxCNC, regardez comment faire une mise à jour http://wiki.linuxcnc.org/cgi-bin/wiki.pl?UpdatingTo2.6[ici].

source: You will receive updates with the regular deb packages.
fr: Vous recevrez les mises à jour avec les paquets récents.

source: You will get a similar screen to the following if your locale settings is *de* (German): The design may variate depending on your config.
fr: Si votre "locale" est ajustée sur *de* (Allemagne) vous obtiendrez un écran sensiblement égal à celui ci-dessous, le style peut varier selon votre configuration.

source: == Basic configuration
fr: == Configuration de base

source: There is really not to much to configure just to run gmoccapy, but there are some points you should take care off if you want to use all the features of the GUI.
fr: Il n'y a vraiment pas grand chose à configurer, juste lancer gmoccapy mais, il y a quelques points qu'il faudra prendre en considération pour être en mesure d'utiliser toutes les fonctionnalités de cette interface graphique.

source: You will find the following INI files included, just to show the basics: + + * gmoccapy.ini * gmoccapy_4_axis.ini * gmoccapy_jog_wheels.ini * gmoccapy_lathe.ini * gmoccapy_lathe_imperial.ini * gmoccapy_left_panel.ini * gmoccapy_right_panel.ini * gmoccapy_sim_hardware_button.ini * gmoccapy_tool_sensor.ini * gmoccapy_with_user_tabs.ini * gmoccapy_messages.ini + The names should explain the main intention of the different INI Files. +
fr: Les fichiers ini suivants sont inclus, pour montrer les bases: + + * gmoccapy.ini * gmoccapy_4_axis.ini * gmoccapy_jog_wheels.ini * gmoccapy_lathe.ini * gmoccapy_lathe_imperial.ini * gmoccapy_left_panel.ini * gmoccapy_right_panel.ini * gmoccapy_sim_hardware_button.ini * gmoccapy_tool_sensor.ini * gmoccapy_with_user_tabs.ini * gmoccapy_messages.ini + Les noms des différents fichiers ini, doivent expliquer l'usage principal. +

source: If you use an existing configuration of your machine, just edit your INI according to this document. +
fr: Si vous utilisez une configuration existante de votre machine, éditez juste votre fichier ini, en accord avec ce document. +

source: IMPORTANT: If you want to use <<sub:MACROS,MACROS>>, don't forget to set the path to your macros or subroutines folder as described below.
fr: IMPORTANT: Si vous voulez utiliser des <<sub:MACROS,MACROS>>, n'oubliez pas d'ajuster le chemin du répertoire de vos macros ou sous-routines, comme décrit ci-dessous.

source: So let us take a closer look to the the INI file and what you need to include to use gmoccapy on your machine: +
fr: Regardons maintenant en détail le fichier ini et ce que vous devez y inclure pour utiliser gmoccapy sur votre machine: +

source: === The DISPLAY Section [[sub:the_display_section]]
fr: === La section DISPLAY [[sub:the_display_section]]

source: The most important part is to tell LinuxCNC to use gmoccapy, editing the [DISPLAY] section.
fr: La partie la plus importante dit à LinuxCNC d'utiliser gmoccapy, en éditant la section [DISPLAY].

source: The line PREFERENCE_FILE_PATH gives the location and name of the preferences file to be used. In most cases this line will not be needed, it is used by gmoccapy to store your settings of the GUI, like themes, DRO units, colors, and keyboard settings, etc., see <<sub:The_settings_page,SETTINGS>> for more details.
fr: La ligne 'PREFERENCE_FILE_PATH' donne l'emplacement et le nom du fichier de préférences à utiliser. Dans la plupart des cas cette ligne ne sera pas nécessaire, Elle est utilisée par gmoccapy pour enregistrer vos réglages de la GUI, tels que les thèmes, les unités de la visu, les couleurs, les réglages du clavier, etc., voir <<sub:The_settings_page,la page des réglages>> pour plus de détails.

source: If no path or file is given, gmoccapy will use as default <your_machinename>.pref, if no machine name is given in your INI File it will use gmoccapy.pref The file will be stored in your config dir, so the settings will not be mixed if you use several configs. If you only want to use one file for several machines, you need to include PREFERENCE_FILE_PATH in your INI. ===========================================================
fr: Si aucun chemin, ni fichier n'est donné, gmoccapy utilisera par défaut <your_machinename>.pref, si aucun nom de machine n'est donné dans le fichier ini, il utilisera gmoccapy.pref. Le fichier sera enregistré dans votre répertoire config, ainsi les réglages ne pouront pas être mélangés si vous utilisez plusieurs configurations. Si vous voulez utiliser seulement un fichier pour plusieurs machines, vous devez inclure PREFERENCE_FILE_PATH dans votre fichier ini. ===========================================================

source: Sets the default linear velocity in machine units per second.
fr: Ajuste la vitesse linéaire par défaut en unités machine par seconde.

source: If no value is given, a value of 15 will be applied. If you don't set max linear velocity, the default linear velocity will be reduced to the default value max linear velocity (60)
fr: Si aucune valeur n'est donnée, la valeur 15 sera appliquée. Si vous n'ajustez pas MAX_LINEAR_VELOCITY, la vitesse linéaire par défaut sera réduite à la valeur par défaut de MAX_LINEAR_VELOCITY (60)

source: If you don't set max velocity in TRAJ, it may be reduced as well see <<sub:The_TRAJ_Section,TRAY section>> ===========================================================
fr: Si vous n'ajustez pas la vitesse max. dans TRAJ, elle sera réduite tel que montré ici <<sub:The_TRAJ_Section,TRAY section>> ===========================================================

source: Sets the value of the max velocity for jogging in machine units per second.
fr: Ajuste la valeur de la vitesse maximale de jogging en unités machine par seconde.

source: NOTE: If no value is given, a value of 60 will be applied. '''' MAX_FEED_OVERRIDE = 1.5
fr: NOTE: Si aucune valeur n'est donnée, une valeur de 60 sera appliquée. '' MAX_FEED_OVERRIDE = 1.5

source: Sets the maximum feed override, in the example given, you will be allowed to override the feed by 150% ''''
fr: Ajuste le maximum du correcteur de vitesse, dans l'exemple donné, vous êtes autorisé à augmenter la vitesse de déplacement de 150% ''''

source: will allow you to change the spindle override within a limit from 50% to 120%
fr: vous permet de modifier la vitesse de broche dans une limite de 50% à 120%

source: the first line set the screen layout to control a lathe.
fr: La première ligne ajuste l'interface pour contrôler un tour.

source: The second line is optional and will switch the X axis in a way you need for a back tool lathe. Also the keyboard shortcuts will react in a different way.
fr: La seconde ligne est optionnelle et permet de basculer l'axe X pour utiliser un outil arrière. Le raccourci clavier régit également de manière différente.

source: TIP: See also <<sub:LATHE_specific_section, LATHE specific section>>
fr: TIP: Voir aussi <<sub:LATHE_specific_section, LATHE specific section>>

source: Is the entry to tell linuxcnc/gmoccapy where to look for the ngc files,
fr: Cette entrée indique à linuxcnc/gmoccapy où chercher les fichiers ngc,

source: if not omitted we will look in the following order:
fr: Si ce n'est pas omis, il chercheront dans l'ordre suivant:

source: ==== The configuration of tabs and side panels
fr: ==== La configuration des onglets et des panneaux latéraux

source: You can add embedded programs to gmoccapy like you can do in axis, touchy and gscreen. All is done by gmoccapy automatically if you include a few lines in your INI file in the DISPLAY section. + + If you never used a glade panel, I recommend to read the excellent documentation. http://www.linuxcnc.org/docs/html/gui/gladevcp.html[Glade VCP] +
fr: Vous pouvez ajouter des programmes embarqués dans gmoccapy, comme vous pouvez le faire dans Axis, Touchy et gscreen. Tout est fait automatiquement par gmoccapy si vous incluez quelques lignes dans la section [DISPLAY] de votre fichier ini. + + Si vous n'avez jamais utilisé de panneau Glade, il est recommandé de lire cette excellente documentation. http://www.linuxcnc.org/docs/html/gui/gladevcp.html[Glade VCP] +

source: .Example **** EMBED_TAB_NAME = DRO EMBED_TAB_LOCATION = ntb_user_tabs EMBED_TAB_COMMAND = gladevcp -x {XID} dro.glade
fr: .Exemple **** EMBED_TAB_NAME = DRO EMBED_TAB_LOCATION = ntb_user_tabs EMBED_TAB_COMMAND = gladevcp -x {XID} dro.glade

source: all you have to take care off, is that you include for every tab or side panel the mentioned three lines, +
fr: Vous devez juste bien introduire les trois lignes mentionnées, pour chaque onglet ou panneau latéral, +

source: '''' *EMBED_TAB_NAME* + represents the name of the tab or side panel, it is up to you what name you use, but it must be present! +
fr: 'EMBED_TAB_NAME' représente le nom de l'onglet ou du panneau latéral, mettez le nom que vous voulez mais mettez en un!

source: '''' *EMBED_TAB_LOCATION* + is the place where your program will be placed in the GUI. valid values are: +
fr: 'EMBED_TAB_LOCATION' situe l'emplacement de votre programme dans l'interface graphique. Les valeurs valides sont:

source: .valid values are: **** * ntb_user_tabs (as main tab, covering the complete screen)' * ntb_preview (as tab on the preview side)' * box_left (on the left, complete high of the screen) * box_right (on the right, in between the normal screen and the button list) * box_coolant_and_spindle (will hide the coolant and spindle frames and introduce your glade file here) * box_cooling (will hide the cooling frame and introduce your glade file) * box_spindle (will hide the spindle frame and introduce your glade file) * box_vel_info (will hide the velocity frames and introduce your glade file) * box_custom_1 (will introduce your glade file left of vel_frame) * box_custom_2 (will introduce your glade file left of cooling_frame) * box_custom_3 (will introduce your glade file left of spindle_frame) * box_custom_4 (will introduce your glade file right of spindle_frame) ****
fr: .valeurs valides sont: **** * ntb_user_tabs (comme onglet principal, couvre l'écran complet)' * ntb_preview (comme onglet sur le côté de parcours d'outil)' * box_left (sur la gauche, le haut complet de l'écran) * box_right (sur la droite, entre l'écran normal et la liste des boutons) * box_coolant_and_spindle (permet de masquer le cadre de l'arrosage et le cadre de la broche pour introduire votre fichier Glade) * box_cooling (permet de masquer le cadre de l'arrosage pour introduit votre fichier Glade) * box_spindle (permet de masquer le cadre de la broche pour introduire votre fichier Glade) * box_vel_info (permet de masquer le cadre de vitesse pour introduire votre fichier Glade) * box_custom_1 (permet d'introduire votre fichier Glade à gauche du cadre de vitesse) * box_custom_2 (permet d'introduire votre fichier Glade à gauche du cadre de l'arrosage) * box_custom_3 (permet d'introduire votre fichier Glade à gauche du cadre de la broche) * box_custom_4 (permet d'introduire votre fichier Glade à droite du cadre de la broche) ****

source: see the different INI files included to see the differences +
fr: Lire les différents fichiers ini fournis pour voir les différences +

source: '''' *EMBED_TAB_COMMAND* + is the command to execute, i.e. +
fr: 'EMBED_TAB_COMMAND' est la commande à exécuter, ex:

source: includes a custom glade file called dro.glade in the mentioned location The file must be placed in the config folder of your machine +
fr: Inclus un fichier Glade personnalisé appelé dro.glade à l'emplacement mentionné. Le fichier doit être placé dans le répertoire config de la machine +

source: will just open a new user window called h_buttonlist.glade note the difference, this one is stand alone, and can be moved around independent from gmoccapy window +
fr: Permet juste d'ouvrir une nouvelle fenêtre utilisateur appelée h_buttonlist.glade noter la différence, celle-ci est autonome et peut être déplacé indépendamment de la fenêtre de gmoccapy +

source: will add a live image from a web cam to the location you specified. take care that camview-emc is installed, as it is not by default. You find detailed information for camview and linuxcnc at: http://psha.org.ru/b/camview-emc.html[cam view] +
fr: Permet d'ajouter une image live une webcam, à l'emplacement spécifié. Faire attention que camview-emc soit bien installé, car il n'y est pas par défaut. Vous trouverez des informations détaillées pour camview avec linuxcnc sur le site du développeur: http://psha.org.ru/b/camview-emc.html[cam view] +

source: will add a the panel manual-example.ui, include a custom python handler, hitcounter.py and make all connections after realizing the panel according to manual-example.hal. +
fr: Permet d'ajouter le panneau manual-example.ui, d'inclure le fichier d'entêtes python hitcounter.py et de faire toutes les connections après la réalisation du panneau selon manual-example.hal. +

source: here are some examples: +
fr: Voici quelques exemples: +

source: '''' *ntb_user_tabs - with integrated camview program* +
fr: 'ntb_user_tabs' - avec le programme camview intégré

source: '''' *ntb_preview - as maximized version* +
fr: 'ntb_preview' - version maximisée

source: '''' *box_left - showing gmoccapy in edit mode* +
fr: 'box_left' - montrant gmoccapy en mode édition

source: '''' *box_right - and gmoccapy in MDI mode* +
fr: 'box_right' - et gmoccapy en mode MDI

source: ==== Configuration of User Created Messages
fr: ==== Configuration des messages créés par l'utilisateur

source: Gmoccapy has the ability to create hal driven user messages. To use them you need to introduce some lines in the [DISPLAY] section of the INI file.
fr: Gmoccapy a la capacité de créer des messages utilisateur destinés à Hal. Pour utiliser ce fonction, vous devez ajouter quelques lignes dans la section [DISPLAY] du fichier ini.

source: Here is how to set up 3 user popup message dialogs the messages support pango markup language. Detailed information about the markup language can be found at https://developer.gnome.org/pango/stable/PangoMarkupFormat.html[Pango Markup]
fr: Voici comment construire 3 boîtes de dialogue surgissantes avec message, les messages suportent le langage markup pango. Informations détaillées à propos du lagage markup se trouvent ici: https://developer.gnome.org/pango/stable/PangoMarkupFormat.html[Pango Markup]

source: MESSAGE_TEXT = The text to be displayed, may be pango markup formated+ MESSAGE_TYPE = "status" , "okdialog" , "yesnodialog"+ MESSAGE_PINNAME = is the name of the hal pin group to be created+
fr: MESSAGE_TEXT = Le texte à afficher, doit être formaté en langage markup pango+ MESSAGE_TYPE = "status" , "okdialog" , "yesnodialog"+ MESSAGE_PINNAME = est le nom du groupe de pins de Hal à créer+

source: 'status' : Will just display a message as popup window, using the messaging system of gmoccapy
fr: 'status' : Va juste afficher un message dans une fenêtre surgissante, le système de messagerie de gmoccapy sera utilisé

source: * 'okdialog' : Will hold focus on the message dialog and will activate a "-waiting" Hal_Pin OUT. Closing the message will reset the waiting pin
fr: * 'okdialog' : Va maintenir le focus sur le message du dialogue et va activer un "-waiting" Hal_Pin OUT. Fermer le message va réinitialiser pin en attente

source: * 'yesnodialog' : Will hold focus on the message dialog and will activate a "-waiting" Hal_Pin bit OUT it will also give access to an "-response" Hal_Pin Bit Out, this pin will hold 1 if the user clicks OK, and in all other states it will be 0 Closing the message will reset the waiting pin The response Hal Pin will remain 1 until the dialog is called again
fr: * 'yesnodialog' : Va maintenir le focus sur le message et va activer un "-waiting" Hal_Pin bit OUT il va également donner accès à un "-response" Hal_Pin Bit Out, cette pin restera à 1 si l'utilisateur clique OK et dans tous les autres états elle passera à 0 Fermer le message va réinitialiser la pin en attente La Hal pin de réponse restera à 1 tant que le dialogue est encore appelé

source: .Example **** MESSAGE_TEXT = This is a <span background="#ff0000" foreground="#ffffff">info-message</span> test MESSAGE_TYPE = status MESSAGE_PINNAME = statustest
fr: .Exemple **** MESSAGE_TEXT = This is a <span background="#ff0000" foreground="#ffffff">info-message</span> test MESSAGE_TYPE = status MESSAGE_PINNAME = statustest

source: The specific hal pin conventions for these can be found under the <<sub:User_Created_Message_HAL_Pins, User Messages hal pin section>>
fr: Les conventions de Hal spécifiques pour cela se trouvent sous <<sub:User_Created_Message_HAL_Pins, User Messages hal pin section>>

source: === The RS274NGC Section [[sub:RS274NGC]]
fr: === La section RS274NGC [[sub:RS274NGC]]

source: sets the path to search for macros and other subroutines.
fr: Positionne le chemin de recherche des macros et autres sous-programmes.

source: === The MACRO Section [[sub:MACROS]]
fr: === La section MACRO [[sub:MACROS]]

source: You can add macros to gmoccapy, similar to touchy's way. + A macro is nothing else than a ngc-file. You are able to execute complete + CNC programs in MDI mode, by just pushing one button. + To do so, you have to add a section like so: +
fr: Vous pouvez ajouter des macros à gmoccapy, de la même manière que pour touchy. Une macro n'est rien d'autre qu'un fichier ngc. Vous pouvez exécuter un programme CNC complet en mode MDI, en pressant juste un bouton poussoir. Pour faire cela, vous devez ajouter une section comme ça: +

source: This will add 5 macros to the MDI button list. Please note, that maximal 9 macros will appear in the GUI, due to place reasons. But it is no error placing more in your INI file.
fr: Cela va ajouter 5 macros à la liste de boutons de l'interface graphique. Noter que pour des raisons de place, un maximum de 9 macros apparaissent dans l'interface graphique. Mais il est permis d'en placer plus dans le fichier ini.

source: The name of the file must be *exactly the same* as the name given in the MACRO line. + So the macro '*i_am_lost*' will call the file '*i_am_lost.ngc*'. +
fr: Le nom du fichier doit être *exactement le même* que le nom donné dans la ligne MACRO. Ainsi la macro '*i_am_lost*' doit appeler le fichier '*i_am_lost.ngc*'. +
