Repository: 0000duck/linuxcnc
Catalog: docs/src/gui/gmoccapy.*.po
Languages: fr

source: The mouse wheel will still zoom the preview in every mode.
fr: La roulette de la souris zoomera le parcours d'outil dans tous les modes.

source: TIP: If you select an element in the preview, the selected element will be taken as rotation center point.
fr: TIP: Si vous sélectionnez un élément dans le parcours d'outil, l'élément sélectionné sera pris comme point central des rotations.

source: ==== File to load on start up
fr: ==== Fichier à charger au démarrage

source: Select the file you want to be loaded on start up. In other GUI changing this was very cumbersome, because the users where forced to edit the INI File.
fr: Sélectionnez le fichier que vous voulez charger au démarrage. Dans les autres interfaces graphiques c'était très lourd, parce que les utilisateurs étaient obligés d'éditer le fichier ini.

source: If a file is loaded, it can be set by pressing the current button to avoid that any program is loaded at start up, just press the None button.
fr: Si un fichier est chargé, il peut être réglé en pressant le bouton courant afin d'éviter que tout autre fichier soit chargé au démarrage, pressez juste le bouton Aucun.

source: The file selection screen will use the filters you have set in the INI File, if there aren't any filters given, you will only see *ngc* files. The path will be set according to the INI settings in [DISPLAY] PROGRAM_PREFIX
fr: L'écran de sélection de fichier utilise les filtres que vous avez défini dans le fichier ini, Si aucun filtre n'est trouvé, vous verrez seulement les fichiers 'ngc'. Le chemin sera réglé selon les paramètres de la section [DISPLAY] PROGRAM_PREFIX du fichier ini.

source: ==== Jump to dir
fr: ==== Saut au répertoire

source: you can set here the directory to jump to if you press the corresponding button in the file selection dialog.
fr: Vous pouvez ajuster ici le répertoire dans lequel sauter si vous pressez le bouton correspondant dans le dialogue de sélection de fichier.

source: ==== Themes and Sounds
fr: ==== Thèmes et Sons

source: This lets the user select what desktop theme to apply and what error and messages sounds should be played. By default "Follow System Theme" is set.
fr: Ceci permet à l'utilisateur de sélectionner quel thème de bureau appliquer et quels sons de messages d'erreur devront être joués. Par défaut "Follow System Theme" est utilisé.

source: === Hardware
fr: === Matériel

source: ==== Hardware MPG Scales
fr: ==== Échelle matériel MPG

source: For the different Hal Pin to connect MPG Wheels to, you may select individual scales to be applied. The main reason for this was my own test to solve this through hal connections, resulting in a very complex hal file. Imagine a user having an MPG Wheel with 100 ipr and he wants to slow down the max vel from 14000 to 2000 mm/min, that needs 12000 impulses, resulting in 120 turns of the wheel! Or an other user having a MPG Wheel with 500 ipr and he wants to set the spindle override witch has limits from 50 to 120 % so he goes from min to max within 70 impulses, meaning not even 1/4 turn.
fr: Échelles pour les différentes pins de Hal à connecter à la manivelle du MPG, vous pouvez sélectionner des échelles individuelles. La raison principale était mon propre test pour résoudre cette question grâce à des connections de Hal, le résultat était un fichier de Hal vraiment très complexe. Imaginez un utilisateur ayant un MPG avec 100 ppr et qui veux ralentir la vitesse max de 14000 à 2000 mm/min, il lui faut 12000 impulsions, ce qui demande 120 tours de manivelle! Ou un autre utilisateur ayant une manivelle MPG avec 500 ppr et qui veux ajuster le correcteur de vitesse broche à des limites comprises entre 50 et 120% alors il ira du minimum au maximum en 70 impulsions, ce qui veux dire même pas 1/4 de tour.

source: By default all scales are set using the calculation:
fr: Par défaut, toutes les échelles sont réglées en utilisant cette formule:

source: ==== Keyboard shortcuts
fr: ==== Les raccourcis clavier

source: Some users want to jog there machine using the keyboard buttons and there are others that will never allow this. So everybody can select whether to use them or not.
fr: Certains utilisateurs veulent jogger leur machine en utilisant les touches du clavier et d'autres qui ne permettrons jamais cela. Donc, tout le monde pourras choisir de les utiliser ou non.

source: Default is to use keyboard shortcuts.
fr: Par défaut il est possible d'utiliser les raccourcis clavier.

source: Please take care if you use a lathe, than the shortcuts will be different. See <<sub:LATHE_specific_section,the Lathe section>>
fr: Faites attention, si vous utilisez un tour, les raccourcis seront différents. Voir <<sub:LATHE_specific_section,la section tour>>

source: Arrow Left = X minus
fr: Flèche vers la gauche = X moins

source: Arrow Right = X plus
fr: Flèce vers la droite = X plus

source: Arrow up = Y plus
fr: Flèche vers le haut = Y plus

source: Arrow Down = Y minus
fr: Flèche vers le bas = Y moins

source: Page Down = Z minus
fr: Page Down = Z moins

source: F1 = Estop (will work even if keyboard shortcuts are disabled)
fr: F1 = Arrêt d'urgence (il fonctionne même si les raccourcis clavier sont désactivés)

source: F2 = Machine on
fr: F2 = Marche machine

source: ESC = Abort
fr: ESC = Abandon

source: There are additional keys for message handling, see <<sub:Message_behavior_and_appearance,Message behavior and appearance>> * WINDOWS = Delete last message * <STRG><SPACE> = Delete all messages
fr: Il existe d'autres touches pour gérer les messages, voir comportement et <<sub:Message_behavior_and_appearance,apparence des messages>> 'WINDOWS' = Effacer le dernier message '<STRG><SPACE>' = Effacer tous les messages

source: ==== Unlock options
fr: ==== Options de déverrouillage

source: you have three options to unlock the settings page:
fr: Vous disposez de trois options pour déverrouiller la page des réglages:

source: use unlock code (the user must give a code to get in)
fr: Utiliser un code de déverrouillage (l'utilisateur doit donner le code pour pouvoir entrer).

source: Do not use unlock code (There will be no security check, not recommended)
fr: Ne pas utiliser de code de déverrouillage (il n'y aura pas de vérification de sécurité, pas recommandé).

source: Use hal pin to unlock (hardware pin must be high to unlock the settings, see <<sub:hardware_unlock_pin, hardware unlock pin>>
fr: Utiliser une pin de Hal pour déverrouiller (une pin matérielle doit être haute pour déverrouiller la page des réglages, voir <<sub:hardware_unlock_pin, pin de déverrouillage matérielle>>.

source: Default is use unlock code (default = *123*)
fr: Par défaut, utilise le code de déverrouillage '123'.

source: ==== Spindle
fr: ==== La broche

source: The start RPM sets the rpm to be used if the spindle is started and no S value has been set.
fr: La vitesse de démarrage Ajuste la vitesse de rotation de la broche à utiliser si la broche démarrée sans avoir fixé la valeur S.

source: With the MIN and MAX settings you set the limits of the spindle bar shown in the INFO frame on the main screen. It is no error giving wrong values. If you give a maximum of 2000 and your spindle makes 4000 rpm, only the bar level will be wrong on higher speeds than 2000 rpm.
fr: Avec les réglages MIN et MAX, vous réglez les limites de la barre de vitesse du cadre INFO de l'écran principal. Aucune erreur ne sera donnée si les valeurs sont mauvaises. Si vous donnez un maximum de 2000 et que votre broche tourne à 4000 tr/mn, seul le niveau de la barre de vitesse sera mauvais aux vitesses supérieures à 2000 tr/mn.

source: default values are MIN = 0 MAX = 6000
fr: Les valeurs par défaut sont MIN = 0 MAX = 6000

source: ==== Turtle Jog [[sub:turtle_jog]]
fr: ==== Jog tortue [[sub:turtle_jog]]

source: This settings will have influence on the jog velocities.
fr: Ce réglage va influer sur les vitesses de jog.

source: 'hide turtle jog button' will hide the button right of the jog velocity slider, if you hide this button, please take care that it shows the rabbit icon, otherwise you will not be able to jog faster than the turtle jog velocity, which is calculated using the turtle jog factor.
fr: 'cacher le bouton de jog-tortue' le bouton, à droite du curseur de vitesse, sera masqué, si vous masquez ce bouton, attention que son icône devienne bien celle du lapin, autrement il ne serait plus possible de jogger plus rapidement qu'à la vitesse du jog-tortue, qui est calculée avec le facteur de jog-tortue.

source: 'Turtle jog factor' sets the scale to apply for turtle jog mode. If you set a factor of 20, the max jog velocity will be 1/20 of max velocity of the machine if in turtle mode (button pressed, showing the turtle)
fr: 'Facteur de jog-tortue' fixe le facteur d'échelle à appliquer au mode jog-tortue. Si vous réglez un facteur de 20, la vitesse de jog maximale sera de 1/20 de la vitesse machine maximale si ce mode est activé (bouton pressé, icône de tortue)

source: NOTE: This button can be activated using the <<sub:Jog_Vel_and_Turtle-Jog,turtle-jog>> hal pin.
fr: NOTE: Ce bouton peut être activé en utilisant la pin de Hal <<sub:Jog_Vel_and_Turtle-Jog,turtle-jog>>.

source: === Advanced Settings
fr: === Réglages avancés

source: ==== Tool Measurement [[sub:Tool_Measurement_Setup]]
fr: ==== Mesure de longueur d'outil [[sub:Tool_Measurement_Setup]]

source: If this part is not sensitive, you do not have a valid INI file configuration to use tool measurement.
fr: Si cette partie n'est pas active, c'est que vous n'avez pas configuré la mesure d'outil dans le fichier ini.

source: Please check <<sub:Auto_Tool_Measurement, Auto Tool Measurement>>
fr: Veuillez vous référer au chapitre: <<sub:Auto_Tool_Measurement, Mesure automatique d'outil>>

source: * Use auto tool measurement : If checked, after each tool change, a tool measurement will be done, the result will be stored in the tool table and an G43 will be executed after the change.
fr: * Utiliser la mesure d'outil automatique : Si coché, une mesure de longueur d'outil sera effectuée après chaque changement d'outil, le résultat sera stocké dans la table d'outils et un G43 sera exécuté après le changement.

source: *Probe informations* + The following informations are taken from your INI file and must be given in absolute coordinates
fr: *Informations sonde* + Les informations suivantes sont tirées du fichier ini et doivent être fournies en coordonnées absolues.

source: X Pos. = The X position of the tool switch
fr: X Pos. = C'est la position en X du contact de sonde.

source: Y Pos. = The Y position of the tool switch
fr: Y Pos. = C'est la position en Y du contact de sonde.

source: Z Pos. = The X position of the tool switch, we will go as rapid move to this coordinate
fr: Z Pos. = C'est la position de sécurité en Z, au dessus du contact de sonde, le mouvement de plongée jusqu'à cette coordonnée, se fera en vitesse rapide.

source: * Max. Probe = is the distance to search for contact, an error will be launched, if no contact is given. The distance has to be given in relative coordinates, beginning the move from Z Pos., so you have to give a negative value to go down!
fr: * Max. Sonde = C'est la profondeur maximale jusqu'à laquelle le palpeur pourras chercher le contact de sonde, une erreur se produira si le contact n'est pas rencontré. Cette cote doit être donnée en coordonnées relatives à la pièce, en commençant le mouvement depuis Z Pos., de sorte que cette cote doit être négative pour aller en plongée!

source: * Probe Height = is the height of your probe switch, you can measure it. Just touch off the base, where the probe switch is located and set that to zero. Then make a tool change and watch the tool_offset_z value, that is the hight you must enter here.
fr: * Hauteur sonde = C'est la hauteur du contact de sonde, qui peut être mesurée. Touchez la base, sur laquelle le contact de sonde est posé et faites le zéro en Z. Puis faites un changement d'outil et regardez la valeur de 'tool_offset_z', c'est cette valeur que vous devez saisir ici.

source: *Probe velocities* +
fr: *Vitesses sonde* +

source: * Search Vel. = The velocity to search for the tool switch, after contact the tool will go up again and then goes toward the probe again with probe vel, so you will get better results. * Probe Vel. = Is the velocity for the second movement to the switch, it should be slower to get better touch results.(In sim mode, this is commented out in macros/change.ngc, otherwise the user would have to click twice on the probe button)
fr: * Vitesse rech. = C'est la vitesse de recherche du contact de sonde, après l'activation du contact, l'outil remonte pour dégager le contact, puis replonge de nouveau en 'Vitesse sonde', pour affiner les résultats. * Vitesse sonde = C'est la vitesse du second mouvement vers le contact, elle doit être assez faible pour obtenir les meilleurs résultats au toucher.(En mode simulation, c'est commenté dans macros/change.ngc, autrement l'utilisateur devra double-cliquer sur le bouton de sonde)

source: *Tool Changer* + If your 4'th axis is used in a tool changer, you may want to hide the DRO and all the other buttons related to that axis. +
fr: *Changeur d'outil* + Si un quatrième axe est utilisé pour un changeur d'outil, vous pouvez cacher le DRO tous les autres boutons relatifs à cet axe. +

source: You can do that by checking the checkbox, that will hide: +
fr: Vous pouvez le faire en cochant la case, ce qui masquera: +

source: 4'th axis DRO
fr: DRO du 4eme axe.

source: 4'th axis Jog button
fr: Bouton de jog du 4eme axe.

source: 4'th axis home button
fr: Bouton Home du 4eme axe.

source: column of 4'th axis in the offsetpage
fr: La colonne du 4eme axe de la page des décalages.

source: column of 4'th axis in the tolleditor
fr: La colonne du 4eme axe de l'éditeur de table d'outils.

source: ==== Message behavior and appearance [[sub:Message_behavior_and_appearance]]
fr: ==== Comportement et apparence des messages [[sub:Message_behavior_and_appearance]]

source: This will display small popup windows displaying the message or error text, the behavior is very similar to the one axis uses. You can delete a specific message, by clicking on it's close button, if you want to delete the last one, just hit the WINDOWS key on your keyboard, or delete all messages at ones with <STRG><SPACE>.
fr: Cela permet d'afficher des petites fenêtres surgissantes contenant des messages ou des textes d'erreur, leur comportement est très similaire à celui utilisé par Axis. Vous pouvez supprimer un massage spécifique, en cliquant sur son bouton de fermeture, si vous voulez effacer le dernier, pressez juste sur la touche <WINDOWS> de votre clavier, ou pour les effacer tous sur les touches <CTRL><ESPACE>.

source: You are able to set some options:
fr: Vous pouvez définir quelques options:

source: X Pos = The position of the top left corner of the message in X counted in pixel from the top left corner of the screen.
fr: X Pos = C'est la position en X, du coin supérieur gauche de la fenêtre de message, comptée en pixels depuis le coin supérieur gauche de l'écran.

source: Y Pos = The position of the top left corner of the message in Y counted in pixel from the top left corner of the screen.
fr: Y pos = C'est la position en Y, du coin supérieur gauche de la fenêtre de message, comptée en pixels depuis le coin supérieur gauche de l'écran.

source: Width = The width of the message box
fr: Largeur = C'est la largeur de la boîte de message.

source: * max = The maximum messages you want to see at ones, if you set this to 10, the 11th message will delete the first one, so you will only see the last 10 ones. * Font = The font and size you want to use to display the messages * use frames = If you activate the checkbox, each message will be displayed in a frame, so it is much easiere to distinguish the messages. But you will need a little bit more space. * The button launch test message will just do what it is supposed to, it will show a message, so you can see the changes of your settings without the need to generate an error.
fr: * max = C'est le maximum de messages visibles, si vous réglez cette valeur à 10, le 11eme message sera effacé, de sorte que seuls les 10 derniers seront visibles. * Font = La police et la taille de cette police, pour afficher les messages. * Utiliser cadres = Si vous cochez cette case, chaque message sera affiché dans un cadre, il sera donc plus facile de distinguer les messages. Mais au détriment de la place nécessaire. * Le bouton, lancer un message de test, affichera un échantillon de message, ainsi, il est possible de visualiser les changements produits par vos réglages, sans générer d'erreur éventuelle.

source: ==== Run from line option
fr: ==== Démarrer à la ligne sélectionnée

source: You can allow or disallow the run from line. This will set the corresponding button insensitive (grayed out), so the user will not be able to use this option.
fr: Vous pouvez activer ou désactiver la fonction Démarrer à la ligne sélectionnée. Ce qui activera le bouton correspondant ou le désactivera en le rendant grisé, dans ce cas l'utilisateur ne pourra plus utiliser cette option.

source: WARNING: It is not recommend to use run from line, as LinuxCNC will not take care of any previous lines in the code before the starting line. So errors or crashes are very probably.
fr: WARNING: Il n'est pas recommandé d'activer et d'utiliser cette fonction, parce que LinuxCNC ne tiendra aucun compte des lignes de code précédent celle sélectionnée. La probabilité de crash induit par ces lignes est très élevée.

source: Default is disable run from line
fr: Par défaut, le démarrage à un ligne sélectionnée est invalidé.

source: ==== Log Actions
fr: ==== Historique des actions

source: If this button is active, nearly every button press or relevant action of LinuxCNC will be logged in the ALARM history. This is very useful for debugging.
fr: Si ce bouton est activé, presque toute pression sur un bouton ou action de LinuxCNC seront enregistrées dans l'historique des alarmes. C'est très utile pour le débogage.

source: == LATHE specific section [[sub:LATHE_specific_section]]
fr: == Section spécifique au tour (LATHE) [[sub:LATHE_specific_section]]

source: If in the INI File LATHE = 1 is given, the GUI will change its appearance to the special needs for a lathe. Mainly the Y axis will be hidden and the jog buttons will be arranged in a different order.
fr: Si dans le fichier ini, on trouve LATHE = 1, alors, l'interface graphique va changer d'apparence pour s'adapter aux besoins spécifiques d'un tour. Principalement, l'axe Y disparaît et les boutons de jog sont ré-arrangés dans un ordre différent.

source: Normal Lathe:
fr: 'Tour avec outil frontal:'

source: Back Tool Lathe:
fr: 'Tour avec outil arrière:'

source: As you see the R DRO has a black background and the D DRO is gray. This will change according to the active G-Code G7 or G8. The active mode is visible by the black background, meaning in the shown images G8 is active.
fr: Comme vous le voyez, le DRO R est sur fond noir et le DRO D sur fond gris. Cela changera selon le G-code actif, G7 (mode diamètre) ou G8 (mode rayon). Le mode actif est donc visible grâce à la couleur du fond, signifiant sur les images précédentes que G8 est actif.

source: The next difference to the standard screen is the location of the Jog Button. X and Z have changed places and Y is gone. You will note that the X+ and X- buttons changes there places according to normal or back tool lathe.
fr: La différence suivante par rapport à l'écran standard, c'est la position des boutons de jog. X et Z ont changé de place et Y a disparu. Vous noterez que les boutons X+ et X- sont permutés, selon que le tour est à outil frontal ou à outil arrière.

source: Also the keyboard behavior will change:
fr: De plus, le comportement du clavier va changer:

source: Arrow Left = Z minus
fr: Flèche vers la gauche = Z moins

source: Arrow Right = Z plus
fr: Flèche vers la droite = Z plus

source: Arrow up = X minus
fr: Flèche vers le haut = X moins

source: Arrow Down = X plus
fr: Flèche vers le bas = X plus

source: Arrow up = X plus
fr: Flèche vers le haut = X plus

source: Arrow Down = X minus
fr: Flèche vers le bas = X moins

source: The tool information frame will show not only the Z offset, but also the X offset and the tool table is showing all lathe relevant information.
fr: Le cadre d'informations outil affichera non seulement le décalage en Z, mais aussi, le décalage en X, et les informations de la table d'outils affichées, sont toutes celles d'un tour.

source: == Plasma specific section
fr: == Section spécifique au Plasma

source: There is a very good WIKI, which is actually growing, maintained by Marius
fr: Il existe un très bon WIKI, qui est en fait, de plus en plus maintenu par Marius,

source: see http://wiki.linuxcnc.org/cgi-bin/wiki.pl?Gmoccapy_plasma[Plasma wiki page]
fr: voir la http://wiki.linuxcnc.org/cgi-bin/wiki.pl?Gmoccapy_plasma[page Wiki Plasma]

source: == VIDEO on you tube
fr: == Vidéos sur you tube

source: This are videos showing gmoccapy in action, unfortunately the videos don't show the latest version of gmoccapy, but the way to use it will not change much in the future. I will try to actualize the videos as soon as possible.
fr: Ce sont des vidéos montrant gmoccapy en action, malheureusement, les vidéos ne montrent pas la dernière version de gmoccapy, mais la façon de l'utiliser ne changera pas beaucoup dans l'avenir. Je vais essayer d'actualiser les vidéos dès que possible.

source: === Basic Usage
fr: === Usage de base

source: German = + English = https://www.youtube.com/watch?v=O5B-s3uiI6g
fr: en Allemand = + Anglais = https://www.youtube.com/watch?v=O5B-s3uiI6g

source: === Simulated Jog Wheels
fr: === Manivelles de jog simulées

source: English = http://youtu.be/ag34SGxt97o
fr: en Anglais = http://youtu.be/ag34SGxt97o

source: === Settings Page
fr: === Page des réglages

source: German Settings = + English Settings = https://www.youtube.com/watch?v=AuwhSHRJoiI
fr: Réglages en Allemand = + Réglages en Anglais = https://www.youtube.com/watch?v=AuwhSHRJoiI

source: === Simulated Hardware Button
fr: === Boutons matériels simulés

source: German Hardware_Button = http://www.youtube.com/watch?v=DTqhY-MfzDE + English Hardware Button = http://www.youtube.com/watch?v=ItVWJBK9WFA
fr: Allemand Hardware_Button = http://www.youtube.com/watch?v=DTqhY-MfzDE English Hardware Button = http://www.youtube.com/watch?v=ItVWJBK9WFA

source: === User Tabs
fr: === Onglets personnalisés

source: English User Tabs = http://www.youtube.com/watch?v=rG1zmeqXyZI
fr: Anglais User Tabs = http://www.youtube.com/watch?v=rG1zmeqXyZI

source: === Tool_Measurement_Video [[sub:Tool_Measurement_Videos]]
fr: === Vidéos de mesure d'outil [[sub:Tool_Measurement_Videos]]

source: == Known problems
fr: == Problèmes connus

source: === Strange numbers in the info area
fr: === Nombres étranges dans la zone d'information

source: If you get strange numbers in the info area of gmoccapy like:
fr: Si vous rencontrez d'étranges nombres dans la zone d'information de gmoccapy comme:

source: You have made your config file using an older version of StepConfWizard. It has made a wrong entry in the INI file under the [TRAJ] named MAX_LINEAR_VELOCITY = xxx. Change that entry to MAX_VELOCITY = xxx
fr: Vous devez avez sans doute faits votre configuration avec une ancienne version de StepConf. Il a fait une mauvaise entrée dans le fichier ini, sous [TRAJ] nommée MAX_LINEAR_VELOCITY = xxx. Changez cette entrée en MAX_VELOCITY = xxx
