Repository: 0000duck/linuxcnc
Catalog: docs/src/gui/gmoccapy.*.po
Languages: fr

source: Gmoccapy offers an integrated auto tool measurement. + To use this feature, you will need to do some additional settings and you may want to use the offered hal pin to get values in your own ngc remap procedure.
fr: Gmoccapy offre une mesure automatique de la longueur d'outil. Pour utiliser cette fonctionnalité, vous aurez quelques réglages additionnels à effectuer et vous pourrez utiliser la pin de Hal offerte pour obtenir les valeurs dans votre propre procédure de remap ngc.

source: IMPORTANT: Before starting the first test, do not forget to enter the Probe height and probe velocities on the settings page! See <<sub:Tool_Measurement_Setup,Settings Page Tool Measurement>>
fr: IMPORTANT: Avant de lancer le premier test, n'oubliez pas d'entrer la hauteur de la sonde et sa vitesse d'avance dans la page des réglages! Voir <<sub:Tool_Measurement_Setup,Mesure de longueur d'outil>> dans la page des réglages avancés.

source: It might be also a good idea to take a look at the tool measurement video: see <<sub:Tool_Measurement_Videos,tool measurement related videos>>
fr: Ça pourrait aussi être une bonne idée de jeter un coup d’œil à la vidéo sur la mesure d'outil, voir les <<sub:Tool_Measurement_Videos,videos relatives à la mesure de longueur d'outil>>

source: Tool Measurement in gmoccapy is done a little bit different to many other GUI. + You should follow theese steps: * touch of you workpiece in X and Y * measure the hight of your block from the base where your tool switch is located, to the upper face of the block (including chuck etc.) * Push the button block height and enter the measured value * Go to auto mode and start your program
fr: La mesure de longueur d'outil dans gmoccapy est un peu différente de beaucoup d'autres interfaces graphiques. Vous devez suivre ces étapes: * Faites l'origine pièce en touchant la pièce en X et Y. * Mesurez le dessus de votre block depuis la base ou se trouve votre contact de mesure jusqu'à la face supérieure du block (inclure mandrin etc.) * Pressez le bouton 'hauteur du block' et entrez la valeur mesurée. * Passez en mode auto et lancez votre programme.

source: here is a small sketch:
fr: voici une représentation:

source: With the first given tool change the tool will be measured and the offset will be set automatically to fit the block height. The advantage of the gmoccapy way is, that you do not need a reference tool.
fr: Au premier changement d'outil rencontré, l'outil sera mesuré et le décalage sera introduit automatiquement dans la hauteur du bloc. L'avantage de la méthode de gmoccapy, c'est qu'il n'y a pas besoin d'un outil de référence.

source: Your program must contain a tool change at the beginning! The tool will be measured, even it has been used before, so there is no danger, if the block height has changed. There are several videos showing the way to do that on you tube. =============================================================
fr: Votre programme doit contenir un changement d'outil au début! L'outil sera mesuré, même si il a déjà été utilisé avant, donc il n'y a aucun danger, si la hauteur du block a bien été renseignée. Il existe plusieurs vidéos sur youtube montrant cette façon de faire. =============================================================

source: === Tool measurement pins
fr: === Pins de Hal de mesure d'outil

source: Gmoccapy offers 5 pins for tool measurement purpose + The pins are mostly used to be read from a gcode subroutine, so the code can react to different values.
fr: Gmoccapy offre 5 pins pour la mesure d'outil. Ces pins de Hal sont principalement utilisées pour être lues depuis un sous-programme en G-code, afin que le code puisse réagir aux différentes valeurs.

source: gmoccapy.toolmeasurement = HAL_BIT ; enable or not tool measurement
fr: gmoccapy.toolmeasurement = HAL_BIT ; active ou non la mesure d'outil.

source: gmoccapy.blockheight = HAL_FLOAT ; the measured value of the top face of the workpiece
fr: gmoccapy.blockheight = HAL_FLOAT ; la valeur mesurée de la face supérieure de la pièce.

source: gmoccapy.probeheight = HAL_FLOAT ; the probe switch height
fr: gmoccapy.probeheight = HAL_FLOAT ; la hauteur du contact de sonde.

source: gmoccapy.searchvel = HAL_FLOAT ; the velocity to search for the tool probe switch
fr: gmoccapy.searchvel = HAL_FLOAT ; la vitesse de recherche du contact de sonde.

source: gmoccapy.probevel = HAL_FLOAT ; the velocity to probe tool length
fr: gmoccapy.probevel = HAL_FLOAT ; la vitesse de plongée lors de la mesure de longueur d'outil.

source: === Tool Measurement INI File modifications
fr: === Modifications au fichier ini pour la mesure d'outil

source: Modify your INI File to include the following:
fr: Modifiez votre fichier ini pour y inclure ce qui suit:

source: ==== The RS274NGC section
fr: ==== La section RS274NGC

source: [RS274NGC] # Enables the reading of INI and HAL values from gcode FEATURES=12
fr: [RS274NGC] # active la lecture de valeurs dans les fichiers ini et HAL depuis le G-code FEATURES=12

source: # is the sub, with is called when a error during tool change happens ON_ABORT_COMMAND=O <on_abort> call
fr: # est le sous-programme appelé en cas d'erreur durant un changement d'outil ON_ABORT_COMMAND=O <on_abort> call

source: # The remap code REMAP=M6 modalgroup=6 prolog=change_prolog ngc=change epilog=change_epilog
fr: # Le code de remap REMAP=M6 modalgroup=6 prolog=change_prolog ngc=change epilog=change_epilog

source: ==== The tool sensor section
fr: ==== Section senseur d'outil

source: The position of the tool sensor and the start position of the probing movement, all values are absolute coordinates, except MAXPROBE, what must be given in relative movement.
fr: La position du senseur d'outil et la position de départ du mouvement de palpage, toutes les valeurs sont en coordonnées absolues, excepté celle de MAXPROBE, qui doit être donnée en relatif.

source: ==== The Change position section
fr: ==== La section Position de changement

source: this is not named TOOL_CHANGE_POSITION on purpose - canon uses that name and will interfere otherwise + The position to move the machine before giving the change tool command. All values are in absolute coordinates
fr: Ne pas la nommer TOOL_CHANGE_POSITION, car ce nom est déjà utilisé par l'interface canonique, ce qui pourrait causer des interférences. C'est la position à laquelle placer le mobile, avant d'envoyer la commande de changement d'outil. Toutes les valeurs sont en coordonnées absolues.

source: ==== The Python section
fr: ==== La section Python

source: the Python plugins serves interpreter and task
fr: La section des plugins Python sert à l'interpréteur et aux tâches.

source: [PYTHON] # The path to start a search for user modules PATH_PREPEND = python # The start point for all. TOPLEVEL = python/toplevel.py
fr: [PYTHON] # Le chemin où rechercher les modules personnalisés PATH_PREPEND = python # Le point de départ pour tout. TOPLEVEL = python/toplevel.py

source: === Needed Files
fr: === Fichiers nécessaires

source: You must copy the following files to your config dir
fr: Vous devez copier les fichiers suivants dans votre répertoire config:

source: First make a directory 'python' in your config folder + from 'your_linuxcnc-dev_directory/configs/sim/gmoccapy/python' + Copy 'toplevel.py' to your 'config_dir/python' folder + Copy 'remap.py' to your 'config_dir/python' folder + Copy 'stdglue.py' to your 'config_dir/python' folder +
fr: Premièrement, créez un répertoire 'python' dans votre dossier config + depuis 'votre_linuxcnc-dev_directory/configs/sim/gmoccapy/python' + Copiez 'toplevel.py' dans votre dossier 'config_dir/python' + Copiez 'remap.py' dans votre dossier 'config_dir/python' + Copiez 'stdglue.py' dans votre dossier 'config_dir/python' +

source: from 'your_linuxcnc-dev_directory/configs/sim/gmoccapy/macros' + copy 'on_abort.ngc' to the directory specified as SUBROUTINE_PATH see <<sub:RS274NGC, RS274NGC Section>> + from 'your_linuxcnc-dev_directory/configs/sim/gmoccapy/macros' + copy 'change.ngc' to the directory specified as SUBROUTINE_PATH see <<sub:RS274NGC, RS274NGC Section>> + open 'change.ngc' with a editor and uncomment the following lines (49 and 50): +
fr: depuis 'votre_répertoire_linuxcnc-dev/configs/sim/gmoccapy/macros' copiez 'on_abort.ngc' dans le répertoire spécifié comme SUBROUTINE_PATH, voir <<sub:RS274NGC, Section RS274NGC>> depuis 'votre_répertoire_linuxcnc-dev/configs/sim/gmoccapy/macros' copiez 'change.ngc' dans le répertoire spécifié comme SUBROUTINE_PATH, voir <<sub:RS274NGC, Section RS274NGC>> ouvrir 'change.ngc' avec un éditeur et dé-commentez les lignes 49 et 50: +

source: You may want to modify this file to fit more your needs, feel free, but do not ask for support ;-)
fr: Vous pouvez modifier ce fichier pour l'adapter à vos besoins, n'hésitez pas, mais ne me demandez pas d'aide ;-)

source: === Needed Hal connections
fr: === Connections de Hal nécessaires

source: connect the tool probe in your hal file like so
fr: Connectez le contact de la sonde de mesure dans votre fichier hal, de cette façon

source: net probe motion.probe-input <= <your_input_pin>
fr: net probe motion.probe-input <= <votre_pin_d_entree>

source: The line might look like this:
fr: La ligne pourrait ressembler à ça:

source: In your postgui.hal file add:
fr: Dans votre fichier postgui.hal ajoutez:

source: # The next lines are only needed if the pins had been connected before unlinkp iocontrol.0.tool-change unlinkp iocontrol.0.tool-changed unlinkp iocontrol.0.tool-prep-number unlinkp iocontrol.0.tool-prepared
fr: # Les lignes suivantes sont requises si les pins ont bien été connectées avant unlinkp iocontrol.0.tool-change unlinkp iocontrol.0.tool-changed unlinkp iocontrol.0.tool-prep-number unlinkp iocontrol.0.tool-prepared

source: # link to gmoccapy toolchange, so you get the advantage of tool description on change dialog net tool-change gmoccapy.toolchange-change <= iocontrol.0.tool-change net tool-changed gmoccapy.toolchange-changed <= iocontrol.0.tool-changed net tool-prep-number gmoccapy.toolchange-number <= iocontrol.0.tool-prep-number net tool-prep-loop iocontrol.0.tool-prepare <= iocontrol.0.tool-prepared -------
fr: # liens vers le changement d'outil de gmoccapy, ainsi vous aurez # en plus la description de l'outil sur la boite dialogue de changement net tool-change gmoccapy.toolchange-change <= iocontrol.0.tool-change net tool-changed gmoccapy.toolchange-changed <= iocontrol.0.tool-changed net tool-prep-number gmoccapy.toolchange-number <= iocontrol.0.tool-prep-number net tool-prep-loop iocontrol.0.tool-prepare <= iocontrol.0.tool-prepared -------

source: == The settings page [[sub:The_settings_page]]
fr: == La page des réglages [[sub:The_settings_page]]

source: To enter the page you will have to click on:
fr: Cliquez pour entrer dans cette page:

source: and give an unlock code, witch is *123* as default. If you want to change it at this time you will have to edit the hidden preference file, see <<sub:the_display_section,the display section>> for details.
fr: et donnez un code de déverrrouillage, qui est par défaut *123*. Si vous voulez le changer à ce moment là, vous devrez éditer le fichier caché des préférences, voir <<sub:the_display_section,la section DISPLAY>> pour plus de détails.

source: The page looks at the moment like so:
fr: A ce moment là, la page ressemble à ça:

source: The page is separated in three main tabs:
fr: La page est séparée en trois principaux onglets:

source: === Appearance
fr: === Apparences

source: on this tab you will find the following options:
fr: Sur cet onglet vous trouverez les options suivantes:

source: ==== Main Window
fr: ==== Fenêtre principale

source: Here you can select how you wish the GUI to start. The main reason for this was the wish to get an easy way for the user to set the starting options without the need to touch code.
fr: Ici vous pouvez choisir l'aspect de l'interface graphique que vous voulez pour démarrer. La principale raison à cela était le souhait d'avoir un moyen facile pour l'opérateur de définir les options sans avoir à écrire de code.

source: You have three options:
fr: Vous avez trois options:

source: start as fullscreen
fr: Démarrer en plein écran

source: start maximized
fr: Démarrer avec un écran maximisé

source: start as window
fr: Démarrer dans une fenêtre

source: If you select start as window the spinboxes to set the position and size will get active. One time set, the GUI will start every time on the place and with the size selected. Nevertheless the user can change the size and position using the mouse, but that will not have any influence on the settings.
fr: Si vous choisissez de démarrer dans une fenêtre, les boutons de taille et de position de la fenêtre deviendront actifs. Une fois ajustée, l'interface graphique re-démarrera à chaque fois dans la même position et avec la même taille. Néanmoins, l'opérateur pourras modifier la taille et la position à l'aide de la souris, mais ça n'auras pas d'influence sur les réglages initiaux.

source: '*hide the cursor*' does allow to hide the cursor, what is very useful if you use a touch screen.
fr: 'Cacher le curseur' cache le curseur, ce qui est très utile si vous utilisez un écran tactile.

source: ==== Keyboard
fr: ==== Clavier

source: If this section is not sensitive, you have not installed a virtual keyboard, + supported are *onboard* and *matchbox-keyboard*. =============================================================
fr: Si cette section n'est pas active, c'est parce que vous n'avez pas installé de clavier virtuel, + Les claviers pris en charges sont 'embarqué' et 'matchbox-keyboard'. =============================================================

source: The check-boxes allows the user to select if he want the on board keyboard to be shown immediately, when entering the MDI Mode, when entering the offset page, the tooledit widget or when open a program in the EDIT mode. The keyboard button on the bottom button list will not been affected by this settings, so you be able to show or hide the keyboard by pressing the button. The default behavior will be set by the check-boxes.
fr: Les cases à cocher permettent à l'utilisateur de sélectionner si il veut qu'un clavier embarqué s'ouvre immédiatement, en entrant en mode MDI, en entrant sur la page d'offset, le widget d'édition de tables d'outils ou en ouvrant un programme en mode EDIT. Le bouton de clavier dans la liste de boutons du bas ne sera pas affecté par ce choix, il vous sera possible de cacher ou d'ouvrir le clavier en pressant ce bouton. Le comportement par défaut sera fixé par les cases à cocher.

source: Default are :
fr: Par défault :

source: show keyboard on offset = True
fr: Montrer le clavier en offset = True

source: show keyboard on tooledit = False
fr: Montrer le clavier en tooledit = False

source: show keyboard on MDI = True
fr: Montrer le clavier en MDI = True

source: show keyboard on EDIT = True
fr: Montrer le clavier en EDIT = True

source: show keyboard on load file = False
fr: Montrer le clavier lors du chargement d'un fichier = False

source: If the keyboard layout is not correct, i.e. clicking X gives Z, than the layout has not been set properly, related to your locale settings. + For onboard it can be solved with a small batch file with the following content:
fr: Si la disposition du clavier est incorrecte, par exemple: cliquer Z donne W, c'est lié à vos paramètres régionaux qui n'ont pas été réglés correctement. Pour le clavier embarqué, ça peut être résolu par le petit fichier batch avec le contenu suivant:

source: #!/bin/bash setxkbmap -model pc105 -layout de -variant basic ---------
fr: #!/bin/bash setxkbmap -model pc105 -layout fr -variant basic ---------

source: the letters "de" are for German, you will have to set them according to your locale settings + Just execute this file before starting LinuxCNC, it can be done also adding a starter to your local folder
fr: Les lettres "fr" sont pour la France, vous devez les régler correctement en accord avec vos réglages locaux. Exécutez ce fichier avant le démarrage de LinuxCNC, il également possible d'ajouter un lanceur dans votre dossier local.

source: so that the layout is set automatically on starting.
fr: de sorte que l'interface graphique s'ouvre automatiquement au démarrage.

source: For matchbox-keyboard you will have to make your own layout, for a German layout ask in the forum.
fr: Pour un matchbox-keyboard vous aurez à faire votre propre mise en page, pour une mise en page en Allemand, demandez sur le forum.

source: ==== On Touch Off
fr: ==== Touch Off On

source: give the option to show the preview tab or the offset page tab if you enter the touch off mode by clicking the corresponding bottom button.
fr: permet de montrer l'onglet de parcours d'outil, ou l'onglet de la page de décalage, si vous entrez en mode toucher en cliquant le bouton correspondant parmi les boutons du bas.

source: show preview
fr: montrer le parcours d'outil

source: show offsets
fr: montrer les décalages

source: As the notebook tabs are shown, you are able to switch between both views in any case.
fr: Comme les onglets sont affichés, vous êtes en mesure de basculer d'une vue à l'autre dans tous les cas.

source: ==== DRO Options
fr: ==== Options de DRO

source: You have the option to select the background colors of the different DRO states. So users suffering from protanopia (red/green weakness) are able to select proper colors
fr: Vous pouvez choisir les couleurs de fond selon les différents états des DRO. Ainsi, les utilisateurs souffrant de protanopie (faiblesse au rouge/vert) seront en mesure de choisir les couleurs appropriées

source: By default the backgrounds are:
fr: Par défaut, les couleurs sont les suivantes:

source: Relative mode = black
fr: Mode relatif = black

source: Absolute mode = blue
fr: Mode absolu = blue

source: Distance to go = yellow
fr: Distance restante = yellow

source: and the foreground color of the DRO can be selected with:
fr: et la couleur de fond du DRO peut être choisie avec:

source: 'show dro in preview', the DRO will be shown in the preview window + 'show offsets', the Offsets will be shown in the preview window + 'show DTG' , the distance to go will be shown in the preview window + + + 'show DRO Button' will allow you to display additional buttons on the left side of the DRO. +
fr: 'show dro in preview', le DRO est affiché dans la fenêtre de parcours d'outil. + 'show offsets', les décalages sont affichés dans la fenêtre de parcours d'outil. + 'show DTG' , la distance restante est affichée dans la fenêtre de parcours d'outil. + 'show DRO Button' vous permet d'afficher un bouton additionnel sur le côté gauche du DRO. +

source: It will display: + one button to switch from relative to absolute coordinates, + one button to toggle between distance to go and the other states + and one button to toggle the units from metric to imperial and vice versa.
fr: Seront affichés: un bouton pour basculer entre coordonnées relatives et coordonnées absolues, un bouton pour basculer entre la distance restante et les autres états et un bouton pour basculer entre les unités, de métriques vers impériales et vice versa.

source: WARNING: It is not recommended to use this option, because the user will loose the auto unit option, which will toggle the units according to the active gcode G20 / G21
fr: WARNING: Il n'est pas du tout recommandé d'utiliser cette option, parce que l'opérateur peux perdre l'option d'unité automatique, qui va basculer les unités en accord avec le G-code actif G20 / G21

source: NOTE: *You can change through the DRO modes (absolute, relative, distance to go) by clicking on the DRO!*
fr: NOTE: 'Vous pouvez changer cycliquement les modes du DRO (absolu, relatif, distance restante), en cliquant directement sur celui-ci!'

source: 'Use Auto Units' allows to disable the auto units option of the display, so you can run a program in inches and watch the DRO in mm.
fr: 'Utiliser Unités Auto' permet de désactiver l'option d'unités auto de l'affichage, ainsi vous pouvez exécuter un programme en pouces et regarder la visu en mm.

source: 'size' allows to set the size of the DRO font, default is 28, if you use a bigger screen you may want to increase the size up to 56. If you do use 4 axis, the DRO font size will be 3/4 of the value, because of space reason.
fr: 'taille' permet d'ajuster la taille de la police du DRO, par défaut à 28, si vous utilisez un grand écran, vous pouvez augmenter cette valeur jusqu'à 56. Si vous utilisez 4 axes, la fonct du DRO sera des 3/4 de cette valeur, pour des raisons d'espace.

source: 'digits' sets the number of digits of the DRO from 1 to 5. NOTE: Imperial will show one digit more that metric. So if you are in imperial machine units and set the digit value to 1, you will get no digit at all in metric.
fr: 'digits' ajuste le nombre de digits du DRO, entre 1 et 5. NOTE: Impériale affiche un digit de plus que métrique. Donc, si vous êtes en unités machine impériales et que vous entrez la valeur 1, vous ne verrez aucun digit en métrique.

source: ==== Preview
fr: ==== Parcours d'outil

source: 'Grid Size' + Sets the grid size of the preview window. + Unfortunately the size *has to be set in inches*, even if your machine units are metric. We do hope to fix that in a future release.
fr: 'Grid Size' Ajuste la taille de la grille dans la fenêtre du parcours d'outil. Malheureusement, cette taille *doit être réglée en pouces*, même si votre unité machine est métrique. Nous espérons corriger ça dans une future version.

source: NOTE: The grid will not be shown in perspective view.
fr: NOTE: La grille n'est pas visible dans la vue en perspective.

source: 'Show DRO' + Will show the a DRO also in the preview window, it will be shown automatically in fullsize preview
fr: 'Show DRO' Affichera un DRO également dans la fenêtre du parcours d'outil, il s'affichera aussi automatiquement en mode parcours d'outil en plein écran

source: 'Show DTG' + Will show also the DTG (direct distance to end point) in the preview, only if Show DRO is active and not fullsize preview.
fr: 'Show DTG' Affichera aussi le DTG (distance restante) dans le parcours d'outil, seulement si Afficher DRO est actif et non en parcours d'outil pleine taille.

source: 'Show Offsets' + Will show the offsets in the preview window,
fr: 'Show Offsets' Affichera les décalages dans la fenêtre de parcours d'outil.

source: NOTE: If you only check this option and leave the others unchecked, you will get in fullsize preview a offset page
fr: NOTE: Si vous cochez seulement cette option et laissez les autres non cochées, vous aurez en parcours d'outil pleine taille, une page de décalages.

source: 'Mouse Button Mode' + With this combobox you can select the button behavior of the mouse to rotate, move or zoom within the preview. +
fr: 'Mode bouton souris' Avec cette liste déroulante, vous pouvez sélectionner le comportement des boutons de la souris pour faire pivoter, déplacer ou zoomer le parcours d'outil. +

source: * left rotate, middle move, right zoom * left zoom, middle move, right rotate * left move, middle rotate, right zoom * left zoom, middle rotate, right move * left move, middle zoom, right rotate * left rotate, middle zoom, right move
fr: * gauche rotation, milieu déplacement, droite zoom * gauche zoom, milieu déplacement, droite rotation * gauche déplacement, milieu rotation, droite zoom * gauche zoom, milieu rotation, droite déplacement * gauche déplacement, milieu zoom, droite rotation * gauche rotation, milieu zoom, droite déplacement

source: Default is left move, middle zoom, right rotate
fr: Par défaut: gauche déplacement, milieu zoom, droite rotation
