Repository: 0000duck/linuxcnc
Catalog: docs/src/gui/gmoccapy.*.po
Languages: fr

source: .The macro files must follow some rules: **** * the name of the file need to be the same as the name mentioned in the macro line, just with the ngc extension * The file must contain a subroutine like so: '*O<i_am_lost> sub*', the name of the sub must match exactly (*case sensitive*) the name of the macro * the file must end with an endsub '*O<i_am_lost> endsub*' followed by an '*M2*' command * the files need to be placed in a folder specified in your INI file in the RS274NGC section (see <<sub:RS274NGC,RS274NGC>>) ****
fr: .Les fichiers de macro doivent suivre quelques règles: * Le nom du fichier doit être le même que celui mentionné sur la ligne de la macro, avec juste l'extension ngc * Le fichier doit contenir un sous-programme comme ça: '*O<i_am_lost> sub*', le nom du sous-programme doit correspondre exactement (*sensible à la casse*) au nom de la macro * Le fichier doit se terminer avec un endsub '*O<i_am_lost> endsub*' suivi par une commande '*M2*' * Le fichier doit être placé dans le répertoire spécifié dans la section RS274NGC du fichier ini (voir <<sub:RS274NGC,RS274NGC>>)

source: The code in between sub and endsub will be executed by pushing the corresponding macro button.
fr: Le code contenu entre sub et endsub sera exécuté en pressant sur le bouton correspondant à la macro.

source: You will find the sample macros in macros folder placed in the gmoccapy sim folder. ===========================================================
fr: Vous trouverez des exemples de macros dans le répertoire macros contenu dans le répertoire sim de gmoccapy. ===========================================================

source: Gmoccapy will also accept macros asking for parameters like:
fr: Gmoccapy accepte aussi les macros demandant des paramètres comme ça:

source: The parameters must be separated by spaces. This calls a file 'go_to_position.ngc' with the following content:
fr: Les paramètres doivent être séparés par des espaces. Ceci appelle un fichier 'go_to_position.ngc' avec le contenu suivant:

source: ; Testfile go to position ; will jog the machine to a given position
fr: ; Testfile go to position ; qui va déplacer le mobile à la position donnée

source: (DBG, Will now move machine to X = #1 , Y = #2 , Z = #3) G0 X #1 Y #2 Z #3
fr: (DBG, Le mobile va aller en X = #1 , Y = #2 , Z = #3) G0 X #1 Y #2 Z #3

source: after pushing the '*execute macro button*', you will be asked to enter the values for '*X-pos Y-pos Z-pos*' and the macro will only run if all values have been given.
fr: Après l'appui sur le bouton '*exécuter macro*', il sera demandé d'entrer les valeurs pour '*X-pos Y-pos Z-pos*' et la macro pourra ne démarrer que si toutes les valeurs sont renseignées.

source: === The TRAJ Section [[sub:The_TRAJ_Section]]
fr: === La section TRAJ [[sub:The_TRAJ_Section]]

source: Sets the maximal velocity of the machine, this value will also take influence to default velocity.
fr: Ajuste la vitesse maximale de la machine, cette valeur également influencer la vitesse par défaut.

source: == HAL Pins
fr: == Pins de HAL

source: gmoccapy exports several hal pin to be able to react to hardware devices. + The goal is to get a GUI that may be operated in a tool shop, completely/mostly without mouse or keyboard.
fr: gmoccapy exporte plusieurs pins de Hal pour être en mesure de réagir aux périphériques matériels. L'objectif étant d'avoir une interface graphique pouvant être utilisée dans un atelier, complètement et le plus souvent, sans souris ni clavier.

source: *You will have to do all connections to gmoccapy pins in your postgui.hal file, because they are not available before loading the GUI completely.* ===========================================================
fr: *Vous devez faire toutes les connections des pins de Hal de gmoccapy, dans votre fichier postgui.hal, parce qu'elles ne sont pas disponibles avant le chargement complet de l'interface graphique.* ===========================================================

source: === Right and bottom button lists
fr: === Boutons du bas et de droite

source: The screen has two main button lists, one on the right side an one on the bottom. + The right handed buttons will not change during operation, but the bottom button list will change very often. + The buttons are count from up to down and from left to right beginning with "0". +
fr: L'écran dispose de deux principales séries de boutons, une sur le côté droit et une en bas. Les boutons de droite ne changerons pas durant les opérations, alors que la série du bas sera très souvent modifiée. Les boutons sont comptabilisés du haut en bas et de gauche à droite, en commençant par "0". +

source: In hal_show you will see the right (vertical) buttons are:
fr: Dans hal_show vous pouvez voir que les boutons de droite (verticalement) sont:

source: and the bottom (horizontal) buttons are:
fr: et les boutons du bas (horizontalement) sont:

source: as the buttons in the bottom list will change according the mode and other influences, the hardware buttons will activate different functions, and you don't have to take care about switching functions around in hal, because that is done completely by gmoccapy!
fr: Les boutons de la série du bas vont changer selon le mode, ainsi que pour d'autres raisons, les boutons matériels activent différentes fonctions et vous n'avez pas à vous soucier des connections de Hal, c'est gmoccapy qui prends tout ça complètement en charge!

source: The sens of this is to be able to use the screen without an touch panel, or protect it from excessive use by placing hardware buttons around the panel.
fr: L'utilité de ça, c'est d'être capable d'utiliser un écran sans qu'il soit tactile, ou de le protéger d'une utilisation intensive en plaçant des boutons matériels autour du panneau.

source: === Velocities and overrides
fr: === Vitesses et correcteurs de vitesse

source: All sliders from gmoccapy can be connected to hardware encoder or hardware potmeters. +
fr: Tous les curseurs de gmoccapy peuvent être connectés à des codeurs matériels ou à des potentiomètres. +

source: '''' To connect encoders the following pin are exported:
fr: Pour connecter des codeurs, les pins suivantes sont exportées:

source: * gmoccapy.max-vel-counts = HAL_S32 ; (Maximal Velocity of the machine) * gmoccapy.jog-speed-counts = HAL_S32 ; (Jog velocity) * gmoccapy.spindle-override-counts = HAL_S32 ; (spindle override) * gmoccapy.feed-override-counts = HAL_S32 ; (feed override) * gmoccapy.reset-feed-override = HAL_BIT ; (reset the feed override to 100 %) * gmoccapy.reset-spindle-override = HAL_BIT ; (reset the spindle override to 100 %)
fr: * gmoccapy.max-vel-counts = HAL_S32 ; (Vitesse maximale de la machine) * gmoccapy.jog-speed-counts = HAL_S32 ; (Vitesse de jog) * gmoccapy.spindle-override-counts = HAL_S32 ; (Correcteur de vitesse broche) * gmoccapy.feed-override-counts = HAL_S32 ; (Correcteur de vitesse d'avance) * gmoccapy.reset-feed-override = HAL_BIT ; (Remet le correcteur de vitesse d'avance à 100%) * gmoccapy.reset-spindle-override = HAL_BIT ; (Remet le correcteur de vitesse broche à 100%)

source: '''' To connect potmeters, use the following hal pin:
fr: Pour connecter des potentiomètres, utiliser les pins de Hal suivantes:

source: * gmoccapy.analog-enable = HAL_BIT ; Must be True, to allow analog inputs * gmoccapy.jog-vel-value = HAL_FLOAT ; To adjust the jog velocity slider * gmoccapy.max-vel-value = HAL_FLOAT ; To adjust the max velocity slider * gmoccapy.feed-override-value = HAL_FLOAT ; To adjust the feed override slider * gmoccapy.spindle-override-value = HAL_FLOAT ; To adjust the spindle override slider
fr: * gmoccapy.analog-enable = HAL_BIT ; (Doit être True, pour autoriser les entrées analogiques] * gmoccapy.jog-vel-value = HAL_FLOAT ; (Pour ajuster le curseur de vitesse de jog] * gmoccapy.max-vel-value = HAL_FLOAT ; (Pour ajuster le curseur de vitesse max] * gmoccapy.feed-override-value = HAL_FLOAT ; (Pour ajuster le curseur du correcteur de vitesse d'avance] * gmoccapy.spindle-override-value = HAL_FLOAT ; (Pour ajuster le curseur du correcteur de vitesse broche]

source: The float pin do accept values from 0.0 to 1.0, being the percentage value you want to set the slider value.
fr: Les pins float acceptent les valeurs comprises entre 0.0 et 1.0, soit le pourcentage auquel doit être ajustée la valeur du curseur.

source: WARNING: If you use both connection types, do not connect the same slider to both pin, as the influences between the two has not been tested! Different sliders may be connected to the one or other hal connection type.
fr: WARNING: Pour utiliser les deux types de connection, ne pas connecter les deux pins à la fois au même curseur, l'influence entre les deux n'a pas été testée! Les différents curseurs peuvent être connectés à l'un ou l'autre des types de connection.

source: IMPORTANT: Please be aware, that for the jog velocity depends on the turtle button state, it will lead to different slider scales depending on the mode (turtle or rabbit). Please take also a look to <<sub:Jog_Vel_and_Turtle-Jog,jog velocities and turtle-jog hal pin>> for more details.
fr: IMPORTANT: Soyez attentif au fait que la vitesse de jog dépend de l'état du bouton 'tortue', ce qui produira des échelles différentes selon les différents curseurs et selon le mode, tortue ou lapin. Regardez également les pins de Hal de <<sub:Jog_Vel_and_Turtle-Jog,vitesses de jog et jog-tortue>> pour plus de détails.

source: .Example **** Spindle Override Min Value = 20 % + Spindle Override Max Value = 120 % + gmoccapy.analog-enable = 1 + gmoccapy.spindle-override-value = 0.25 + + value to set = Min Value + (Max Value - Min Value) * gmoccapy.spindle-override-value + value to set = 20 + (120 - 20) * 0.25 + value to set = 45 % + ****
fr: .Exemple **** Spindle Override Min Value = 20 % + Spindle Override Max Value = 120 % + gmoccapy.analog-enable = 1 + gmoccapy.spindle-override-value = 0.25 + + value to set = Min Value + (Max Value - Min Value) * gmoccapy.spindle-override-value + value to set = 20 + (120 - 20) * 0.25 + value to set = 45 % + ****

source: === jog hal pins
fr: === Pin de Hal pour le jog

source: All axis given in the INI File have a jog-plus and a jog-minus pin, so hardware momentary switches can be used to jog the axis. +
fr: Tous les axes définis dans le fichier ini ont chacun une pin jog-plus et une pin jog-moins, de sorte que des contacts physiques peuvent être utilisés pour jogger chaque axe. +

source: For the standard config following hal Pin will be available:
fr: Pour la configuration standard, les pins de Hal suivantes sont disponibles:

source: if you use a 4 axis INI file, there will be two additional pins
fr: Si une configuration 4 axes est définie dans le fichier ini, il y a deux pins additionnelles

source: gmoccapy.jog-<your fourth axis letter >-plus
fr: gmoccapy.jog-<lettre de votre quatrième axe >-plus

source: gmoccapy.jog-<your fourth axis letter >-minus
fr: gmoccapy.jog-<lettre de votre quatrième axe >-minus

source: for a "C" axis you will see:
fr: pour un axe "C" vous devriez avoir:

source: === jog velocities and turtle-jog hal pin [[sub:Jog_Vel_and_Turtle-Jog]]
fr: === Pins de Hal de vitesse de jog et de jog-tortue [[sub:Jog_Vel_and_Turtle-Jog]]

source: The jog velocity can be selected with the corresponding slider. + The scale of the slider will be modified if the turtle button (the one showing a rabbit or a turtle) has been toggled. If the button is not visible, it might have been disabled on the <<sub:turtle_jog,settings page>>. If the button shows the rabbit-icon, the scale is from min to max machine velocity. If it shows the turtle, the scale will reach only 1/20 of max velocity by default. The used divider can be set on the <<sub:turtle_jog,settings page>>.
fr: La vitesse de jog peut être ajustée avec le curseur correspondant. L'échelle du curseur sera différente selon la position du bouton tortue (celui qui montre une tortue ou un lapin). Si le bouton n'est pas visible, c'est qu'il a été désactivé dans la <<sub:turtle_jog,page des réglages>>. Si le bouton montre un lapin, l'échelle se situera entre la vitesse machine minimale et la vitesse machine maximale. Si le bouton montre une tortue, l'échelle atteindra seulement 1/20 de la vitesse max par défaut. Le facteur de division utilisé peut être ajusté sur la <<sub:turtle_jog,page des réglages>>.

source: So using a touch screen it is much easier to select smaller velocities.
fr: Donc, en utilisant un écran tactile, il est plus facile de sélectionner les petites vitesses.

source: === jog increment hal pins
fr: === Pins de Hal d'incrément de jog

source: The jog increments are selectable through hal pins, so a select hardware switch can be used to select the increment to use. There will be a maximum of 10 hal pin for the increments given in the INI File, if you give more increments in your INI File, they will be not reachable from the GUI as they will not be displayed.
fr: Les incréments de jog sont sélectionnables par des pins de Hal, un contact physique est donc utilisable pour sélectionner l'incrément à utiliser. Il y a un maximum de 10 pins de Hal pour les incréments définis dans le fichier ini, si il en est défini d’avantage dans le fichier ini, ils ne seront pas accessibles depuis l'interface graphique puisqu'ils ne seront pas affichés.

source: If you have 6 increments in your hal you will get *7* pins:
fr: Si vous avez 6 incréments dans votre Hal, il vous faudra *7* pins:

source: jog-inc-0 is unchangeable and will represent continuous jogging.
fr: jog-inc-0 n'est pas modifiable et représente le mode de jog continu.

source: === hardware unlock pin [[sub:hardware_unlock_pin]]
fr: === Pin de déverrouillage matériel [[sub:hardware_unlock_pin]]

source: to be able to use a key switch to unlock the settings page the following pin is exported.
fr: pour pouvoir utiliser un interrupteur à clé pour déverrouiller la page des réglages, la pin suivante est exportée.

source: The settings page is unlocked if the pin is high. + To use this pin, you need to activate it on the settings page.
fr: La page des réglages est déverrouillée si la pin est à l'état haut. Pour utiliser cette pin, elle doit être activée dans la page des réglages.

source: === Error pins
fr: === Pins d'erreur

source: gmoccapy.error is an bit out pin, to indicate an error, so a light can lit or even the machine may be stopped. It will be reseted with the pin gmoccapy.delete-message. gmoccapy.delete-message will delete the first error and reset the gmoccapy.error pin to False after the last error has been cleared. +
fr: gmoccapy.error est une pin de sortie de type bit, pour indiquer une erreur, allumer un voyant ou même provoquer un arrêt machine. Elle est remise à zéro avec la pin gmoccapy.delete-message. gmoccapy.delete-message va effacer la première erreur et repasser la pin gmoccapy.error à l'état bas après que la dernière erreur ait été effacée. +

source: NOTE: Messages or user infos will not affect the gmoccapy.error pin, but the gmoccapy.delete-message pin will delete the last message if no error is shown!
fr: NOTE: Les messages ou les infos utilisateur n'affectent pas la pin gmoccapy.error, mais la pin gmoccapy.delete-message efface le dernier message si aucune erreur n'est affichée!

source: === User Created Message HAL Pins [[sub:User_Created_Message_HAL_Pins]]
fr: === Pins de Hal de création de message utilisateur [[sub:User_Created_Message_HAL_Pins]]

source: gmoccapy may react to external errors, using 3 different user messages: + All are HAL_BIT pin. +
fr: gmoccapy peut réagir aux erreurs externes en utilisant 3 différents messages utilisateur: Tous sont des pins HAL_BIT. +

source: === Spindle feedback pins
fr: === Pins de Hal de retour broche

source: There are two pins for spindle feedback
fr: Il y a deux pins de retour broche

source: 'gmoccapy.spindle_feedback_bar' will accept an float input to show the spindle speed + 'gmoccapy.spindle_at_speed_led' is an bit-pin to lit the GUI led if spindle is at speed +
fr: 'gmoccapy.spindle_feedback_bar' accepte une entrée de type float pour représenter la vitesse de broche 'gmoccapy.spindle_at_speed_led' est une pin de type bit, indiquant sur l'interface graphique que la broche a atteint la vitesse demandée. +

source: === Pins to indicate program progress information
fr: === Pins d'indication de l'évolution du programme

source: There are three pins giving information over the program progress +
fr: Il y a trois pins donnant des informations sur le déroulement du programme. +

source: * gmoccapy.program.length = HAL_S32 ; showing the total number of lines of the program * gmoccapy.program.current-line = HAL_S32 ; indicating the current working line of the program * gmoccapy.program.progress = HAL_FLOAT ; giving the program progress in percentage
fr: * gmoccapy.program.length = HAL_S32 ; montrant le nombre total de lignes du programme * gmoccapy.program.current-line = HAL_S32 ; indiquant la ligne du travail en cour * gmoccapy.program.progress = HAL_FLOAT ; donant la progression du programme en pourcentage

source: The values may not be very accurate, if you are working with subroutines or large remap procedures, also loops will cause different values.
fr: Ces valeurs peuvent ne pas être très précises, si vous travaillez avec des sous-programmes ou des boucles, les résultats peuvent avoir des valeurs différentes.

source: === Pins to modify soft limits
fr: === Pins de modification des limites logicielles

source: Gmoccapy allows you to modify the soft limits using hal pin. The pin do allow to reduce or enlarge the soft limits, so you are able to protect your rotary table from collision just switching a hal pin. If you do not use it, just reduce your soft limits. An other option would be a tool changer which is placed in the working area, you do not want a collision during normal work, but you are forced to enter the tool change area to change a tool, so during tool change you enlarge the soft limits.
fr: Gmoccapy permet de modifier les limites logicielles en utilisant des pins de Hal. La pin va permettre de réduire ou d'augmenter les limites logicielles, ainsi par exemple, il est possible de protéger une table rotative contre toute collision, juste en basculant une pin de Hal. Si vous ne l'utilisez pas, réduisez juste votre limite logicielle. Une autre option pourrait être un changeur d'outil placé dans la zone de travail, pour ne pas avoir de collision pendant le travail normal, mais il y a obligation de rentrer dans la zone de changement d'outil justement pour le changement d'outil, pour cela, pendant le changement d'outil les limites logicielles seront élargies.

source: * gmoccapy.axis-to-set = HAL_S32 ; indicating the joint of the axis to modify (X=0, Y=1, Z=2 ...) * gmoccapy.set-max-limit = HAL_BIT ; if set the value will modify the max limit value, else the min value * gmoccapy.limit-value = HAL_FLOAT ; the new value to set as soft limit
fr: * gmoccapy.axis-to-set = HAL_S32 ; indique l'axe à modifier (X=0, Y=1, Z=2 ...) * gmoccapy.set-max-limit = HAL_BIT ; si haute, la valeur modifiée sera celle de la limite max, sinon, celle de la limite min * gmoccapy.limit-value = HAL_FLOAT ; valeur de la nouvelle limite logicielle à utiliser

source: This has not been tested with a rotary axis, so be careful with that kind of axis. There will be no check to the limits you set, so if you set a limit and the tool is out of your limit area you will get an error about being outside the soft limits.
fr: Cela n'a pas été bien testé avec un axe rotatif, soyez prudent avec ce genre d'axe. Il n'y aura pas de contrôle des limites que vous définirez, si vous définissez une limite et que l'outil est en dehors de celle-ci, vous aurez une erreur de dépassement des limites logicielles.

source: IMPORTANT: You are responsible to take care about that!
fr: IMPORTANT: Vous devez être très attentif à ce propos!

source: You are only allowed to set limits if the machine is on! A value of 0 as limit is not allowed, please give a value of 0.000001 instead. The GUI will react to changes of the limit-value pin, so to modify the limits you have to apply a value change to that pin.
fr: Il est seulement permi de définir les limites si la machine est en marche! Une valeur de limite fixée à 0 est interdite, il faut donner une valeur minimale de 0.000001 à la place. L'interface graphique va réagir aux changements de la pin limit-value, afin de modifier les limites à appliquer selon la valeur de cette pin.

source: WARNING: This is very experimental at the moment, so please take care for your security.
fr: WARNING: C'est vraiment expérimental en ce moment, la plus grande prudence s'impose pour votre sécurité.

source: === Tool related pin
fr: === Pins de Hal relatives à l'outil

source: ==== Tool Change Pin
fr: ==== Pin de changement d'outil

source: This pin are provided to use gmoccapy's internal tool change dialog, similar to the one known from axis, but with several modifications, so you will not only get the message to change to 'tool number 3', but also the description of that tool like '7.5 mm 3 flute cutter'. The information is taken from the tool table, so it is up to you what to display.
fr: Cette pin de Hal est prévue pour utiliser le dialogue de changement d'outil interne à gmoccapy, similaire à celui bien connu d'Axis, mais avec plusieurs modifications, de sorte que vous n'aurez plus seulement le message pour 'monter l'outil N°3', mais aussi la description de cet outil, telle que 'fraise 3 dents 7.5 mm'. L'information est tirée de la table d'outils, ce qui est affiché dépend donc de vous.

source: * gmoccapy.toolchange-number = HAL_S32 ; The number of the tool to be changed * gmoccapy.toolchange-change = HAL_BIT ; Indicate that a tool has to be changed * gmoccapy.toolchange-changed = HAL_BIT ; Indicate toll has been changed
fr: * gmoccapy.toolchange-number = HAL_S32 ; Le numéro de l'outil appelé * gmoccapy.toolchange-change = HAL_BIT ; Indique qu'un outil doit être changé * gmoccapy.toolchange-changed = HAL_BIT ; Indique que l'outil a bien été changé

source: usually they are connected like this for a manual tool change:
fr: en général, ils sont connectés comme ceci pour un changement d'outil manuel:

source: ==== tool offset pins
fr: ==== Pins de Hal de décalage d'outil

source: This pins allows you to show the active tool offset values for X and Z in the tool information frame. + You should know that they are only active after G43 has been send.
fr: Ces pins de Hal permettent d'afficher la valeur de décalage de l'outil actif pour X et Z dans le cadre des outils. Vous devez savoir que ça sera effectif seulement après qu'un G43 n'ait été envoyé.

source: just connect them like so in your postgui hal.
fr: connectez les comme ça dans votre postgui hal:

source: Please note, that gmoccapy takes care of its own to update the offsets, sending an G43 after any tool change, *but not in auto mode!*
fr: Veuillez noter que gmoccapy s'occupe de rafraîchir l'affichage des valeurs de décalage, d'envoyer un G43 après chaque changement d'outil, 'mais pas en mode automatique!'

source: IMPORTANT: So writing a program makes you responsible to include an G43 after each tool change!
fr: IMPORTANT: Il est donc de la responsabilité de l'opérateur d'inclure dans ses programmes, un G43 après chaque changement d'outil!

source: == Auto Tool Measurement [[sub:Auto_Tool_Measurement]]
fr: == Mesure de longueur d'outil automatique [[sub:Auto_Tool_Measurement]]
