Repository: 0000duck/linuxcnc
Catalog: docs/src/gui/image-to-gcode.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = Image to G Code
fr: = Image-to-gcode: Usiner un depth maps

source: image::images/image-to-gcode.png[align="center"]
fr: image::images/image-to-gcode.png[align="left"]

source: == What is a depth map?
fr: == Qu'est-ce qu'un depth map?

source: A depth map is a greyscale image where the brightness of each pixel corresponds to the depth (or height) of the object at each point.
fr: Il s'agit d'une image en échelle de gris dont la luminosité de chaque pixel corresponds à la profondeur (ou hauteur) de chaque point de l'objet.

source: == Integrating image-to-gcode with the AXIS user interface
fr: == Intégrer image-to-gcode dans l'interface utilisateur d'AXIS

source: Add the following lines to the '[FILTER]' section of your .ini file to make AXIS automatically invoke image-to-gcode when you open a .png, .gif, or .jpg image
fr: Ajoutez les lignes suivantes dans la section: '[FILTER]' de votre fichier .ini pour qu'AXIS invoque automatiquement image-to-gcode à l'ouverture d'une image .png, .gif, ou .jpg:

source: The standard 'sim/axis.ini' configuration file is already configured this way.
fr: Le fichier de configuration: 'sim/axis.ini' est déjà configuré de cette façon.

source: == Using image-to-gcode
fr: == Utilisation d'image-to-gcode

source: Start image-to-gcode either by opening an image file in AXIS, or by invoking image-to-gcode from the terminal, as follows:
fr: image-to-gcode peut être démarré soit en ouvrant une image dans AXIS, soit en invoquant image-to-gcode dans une console, de la manière suivante:

source: Verify all the settings in the right-hand column, then press OK to create the gcode. Depending on the image size and options chosen, this may take from a few seconds to a few minutes. If you are loading the image in AXIS, the gcode will automatically be loaded and previewed once image-to-gcode completes. In AXIS, hitting reload will show the image-to-gcode option screen again, allowing you to tweak them.
fr: Ajustez les réglages dans la colonne de droite, puis pressez OK pour créer le G-code. Selon la taille de l'image et les options choisies, le traitement peut durer de quelques secondes à quelques minutes. Quand une image est chargée dans Axis, le G-code sera automatiquement chargé et visualisé dans AXIS une fois le traitement terminé. Dans AXIS, presser Recharger, pour afficher de nouveau l'écran d'options d' image-to-gcode, ainsi il est possible de travailler en boucle.

source: == Option Reference
fr: == Les différentes options

source: === Units
fr: === Unités

source: Specifies whether to use G20 (inches) or G21 (mm) in the generated g-code and as the units for each option labeled '(units)'.
fr: Spécifie quelle unité sera utilisée dans le G-code généré G20 (pouces) ou G21 (mm), ce sera également l'unité utilisée par toutes les options marquées: '(units)'.

source: If “no”, the black pixel is the lowest point and the white pixel is the highest point. If “yes”, the black pixel is the highest point and the white pixel is the lowest point.
fr: Si 'no', le pixel noir sera le point le plus bas et le pixel blanc le point le plus haut. Si 'yes', le pixel noir sera le point le plus haut et le pixel blanc le point le plus bas.

source: If 'yes', the darkest pixel is remapped to black, the lightest pixel is remapped to white.
fr: Si 'yes', le pixel le plus sombre est ramené au noir, le pixel le plus lumineux est ramené au blanc.

source: If 'None', the input image is used as-is, and details which are at the very edges of the image may be cut off. If 'White' or 'Black', then a border of pixels equal to the tool diameter is added on all sides, and details which are at the very edges of the images will not be cut off.
fr: Si 'None', l'image chargée sera utilisée telle-quelle, les détails les plus aux bords de l'image pourraient être usinés. Si 'White' ou 'Black', alors une bordure de pixels égale au diamètre de l'outil sera ajoutée sur tout le pourtour pour éviter ce risque.

source: === Tolerance (units)
fr: === Tolerance (unités)

source: When a series of points are within 'tolerance' of being a straight line, they are output as a straight line. Increasing tolerance can lead to better contouring performance in LinuxCNC, but can also remove or blur small details in the image.
fr: Quand une série de points est proche d'une ligne droite au point d'être dans la 'tolérance' , elle sera traitée comme une ligne droite en sortie. Augmenter la tolérance peut donner de meilleures performances de contourage avec LinuxCNC, mais peut aussi estomper ou gommer les détails les plus fins de l'image.

source: === Pixel Size (units)
fr: === Pixel Size (unités)

source: One pixel in the input image will be this many units--usually this number is much smaller than 1.0. For instance, to mill a 2.5x2.5-inch object from a 400x400 image file, use a pixel size of .00625, because 2.5 / 400 = .00625.
fr: Il y a beaucoup d'unités pour un pixel dans l'image entrée. Habituellement ce nombre est beaucoup plus petit que 1.0. Par exemple, pour usiner un objet de 50x50mm depuis une image de 400x400 pixels, utiliser un 'pixel size' de 0.125, parce que 50 / 400 = 0.125.

source: === Plunge Feed Rate (units per minute)
fr: === Plunge Feed Rate (unités par minute)

source: The feed rate for the initial plunge movement.
fr: Vitesse du mouvement de plongée initial.

source: === Feed Rate (units per minute)
fr: === Feed Rate (unités par minute)

source: The feed rate for other parts of the path.
fr: Vitesse d'avance travail pour le reste de l'usinage.

source: The spindle speed S code that should be put into the gcode file.
fr: Vitesse de rotation de la broche, en tours/mn

source: Possible scan patterns are:
fr: Modèles de balayage possibles:

source: Rows
fr: Rangées

source: Columns
fr: Colonnes

source: Rows, then Columns
fr: Rangées puis colonnes

source: Columns, then Rows
fr: Colonnes puis rangées

source: Possible scan directions are:
fr: Directions de balayage possibles:

source: Positive: Start milling at a low X or Y axis value, and move towards a high X or Y axis value
fr: Positive: le fraisage commence à de petites valeurs de X ou Y et se poursuit avec des valeurs croissantes.

source: Negative: Start milling at a high X or Y axis value, and move towards a low X or Y axis value
fr: Négative: le fraisage commence à des valeurs élevées de X ou Y et se poursuit avec des valeurs décroissantes.

source: Alternating: Start on the same end of the X or Y axis travel that the last move ended on. This reduces the amount of traverse movements
fr: Alternative: le fraisage commence aux valeurs de X ou Y où s'est terminé le dernier mouvement. Cela réduit les déplacements 'en l'air'.

source: Up Milling: Start milling at low points, moving towards high points
fr: Up Milling: le fraisage commence en points bas et se poursuit vers les points hauts.

source: Down Milling: Start milling at high points, moving towards low points
fr: Down Milling: le fraisage commence en points hauts et se poursuit vers les points bas.

source: === Depth (units)
fr: === Depth (unités)

source: The top of material is always at 'Z=0'. The deepest cut into the material is 'Z=-depth.'
fr: Le dessus du bloc est toujours à 'Z=0'. La profondeur d'usinage dans le matériau est de 'Z=-depth'.

source: The distance between adjacent rows or columns. To find the number of pixels for a given units distance, compute 'distance/pixel size' and round to the nearest whole number. For example, if 'pixel size=.006' and the desired step over 'distance=.015', then use a Step Over of 2 or 3 pixels, because '.015/.006=2.5''.'
fr: Distance entre rangées ou colonnes adjacentes. Pour trouver le nombre en pixels pour une distance donnée en unités, calculer: 'distance/pixel size' et arrondir au nombre le plus proche. Par exemple: si 'pixel size=.006' et le pas souhaité sur la 'distance=.015', alors utilisez un Step Over de 2 ou 3 pixels, parce que '.015/.006=2.5'.

source: The diameter of the cutting part of the tool.
fr: Le diamètre du taillant de l'outil.

source: The height to move to for traverse movements. image-to-gcode always assumes the top of material is at 'Z=0'.
fr: La hauteur de sécurité pour les mouvements en vitesse rapide. image-to-gcode considère toujours le dessus du matériau comme étant: 'Z=0'.

source: The shape of the cutting part of the tool. Possible tool shapes are:
fr: La forme du taillant de l'outil. Les formes possibles sont:

source: Ball End
fr: Hémisphèrique

source: Flat End
fr: Bout plat

source: 45 degree “vee”
fr: Vé à 45 degrés

source: 60 degree “vee”
fr: Vé à 60 degrés

source: This controls whether areas that are relatively flat along a row or column are skipped. This option only makes sense when both rows and columns are being milled. Possible bounding options are:
fr: Contrôle si les zones relativement plates le long d'une colonne ou d'une rangée peuvent être ignorées. Ces options n'ont de sens que pour un fraisage dans les deux directions. Trois choix sont possibles:

source: None: Rows and columns are both fully milled.
fr: None: toutes les rangées et les colonnes seront entièrement fraisées.

source: Secondary: When milling in the second direction, areas that do not strongly slope in that direction are skipped.
fr: Secondary: lors du fraisage dans la deuxième direction, les zones qui ne présentent pas une forte pente dans cette direction seront ignorées.

source: Full: When milling in the first direction, areas that strongly slope in the second direction are skipped. When milling in the second direction, areas that do not strongly slope in that direction are skipped.
fr: Full: lors du fraisage dans la première direction, les zones qui présentent une forte pente dans la deuxième direction seront ignorées. Lors du fraisage dans la deuxième direction, les zones qui ne présentent pas une forte pente dans cette direction seront ignorées.

source: When 'Lace bounding' is not 'None', slopes greater than 'Contact angle' are considered to be 'strong' slopes, and slopes less than that angle are considered to be weak slopes.
fr: Quand 'Lace bounding' n'est pas None, les pentes qui présentent une pente supérieure à 'Contact angle' seront considérées comme de 'fortes' pentes et celles en dessous de cet angle considérées comme de faible pentes.

source: === Roughing offset and depth per pass
fr: === Offset d'ébauche et profondeur par passe d'ébauche

source: Image-to-gcode can optionally perform rouging passes. The depth of successive roughing passes is given by 'Roughing depth per pass'. For instance, entering 0.2 will perform the first roughing pass with a depth of 0.2, the second roughing pass with a depth of 0.4, and so on until the full Depth of the image is reached. No part of any roughing pass will cut closer than Roughing Offset to the final part. The following figure shows a tall vertical feature being milled. In this image, Roughing depth per pass is 0.2 inches and roughing offset is 0.1 inches.
fr: Image-to-gcode peut facultativement produire des passes d'ébauche. La profondeur des passes d'ébauche successives est fixée par 'Roughing depth per pass'. Par exemple, entrer 0.2 pour une première passe d'ébauche d'une profondeur de 0.2, la seconde passe d'ébauche aura une profondeur de 0.4 et ainsi de suite, jusqu'à-ce que la profondeur totale Depth de l'image soit atteinte. Aucune des passes d'ébauche n'usinera plus près de la partie finale que Roughing Offset. La figure ci-dessous montre une grande profondeur verticale à usiner. Sur cette image, la profondeur des passes d'ébauche est de 0.2 pouces et Roughing Offset de 0.1 pouces.

source: .Roughing passes and final pass[[roughing-passes]]
fr: .Passes d'ébauche[[cap:Passes-Ebauche]]
