Repository: 0000duck/linuxcnc
Catalog: docs/src/gui/mini.*.po
Languages: fr

source: Backplot [Backplot] will show the tool path that can be viewed from a chosen direction. '3-D' is the default. Other choices and controls are displayed along the top and right side of the pop-in. If you are in the middle of a cut when you press one of these control buttons the machine will pause long enough to re-compute the view.
fr: Le bouton 'Parcours d'outil' du menu, affiche un tracé produit par le cheminement de l'outil pendant l'usinage. Cette trace est affichable selon plusieurs plans et en '3-D' qui est le mode par défaut. Les choix sont affichés au dessus et à droite de cette fenêtre. Si l'usinage est déjà en cours depuis un certain temps quand cette fenêtre est activée, il lui faudra un peu de temps pour recalculer la vue du parcours.

source: Along the right side of the pop-in there is a small pyramid shaped graphic that tries to show the angle you are viewing the tool path from. Below it are a series of sliders that allow you to change the angle of view and the size of the plot. You can rotate the little position angle display with these. They take effect when you press the [Refresh] button. The [Reset] button removes all of the paths from the display and readies it for a new run of the program but retains your settings for that session.
fr: Sur le côté droit de la fenêtre une petite pyramide graphique montre l'angle depuis lequel l'opérateur voit le tracé du parcours d'outil. En dessous, une série de curseurs permettent de modifier les angles et la taille de la vue. Il est possible de contrôler les modifications en regardant l'attitude de la petite pyramide. Les modifications ne prendront effet qu'après appui sur le bouton 'Rafraîchir'. Le bouton 'Reset' efface toutes les traces du parcours affiché et prépare la fenêtre pour un nouveau lancement du programme, il conserve toutefois les orientations et le niveau de zoom actuellement définis.

source: If backplot is started before a program is started, it will try to use some color lines to indicate the kind of motion that was used to make it. A green line is a rapid move. A black line is a feed rate move. Blue and red indicate arcs in counterclockwise and clockwise directions.
fr: Si un parcours d'outil est lancé avant qu'un programme ne soit démarré, il va afficher quelques lignes de couleur pour indiquer le type de tracé qui sera utilisé. Une ligne verte représente un mouvement en vitesse d'avance rapide. Une ligne noire, un mouvement en vitesse d'avance travail. Une ligne bleue et une ligne rouge indiquent respectivement un arc en sens anti-horaire et un arc en sens horaire.

source: The backplotter with Mini allows you to zoom and rotate views after you have run your program but it is not intended to store a tool path for a long period of time.
fr: Le tracé du parcours d'outil de Mini permet de zoomer et d'orienter les vues du programme en cours d'exécution mais il n'est pas conçu pour enregistrer un chemin d'outil sur une longue période de temps.

source: === Tool Page
fr: === Page des outils

source: The tool page is pretty much like the others. You can set length and diameter values here and they become effective when you press the [Enter] key. You will need to set up your tool information before you begin to run a program. You can't change tool offsets while the program is running or when the program is paused.
fr: La page des outils permet d'ajuster la longueur et le diamètre des outils, ces valeurs deviennent effectives dès l'appui sur la touche 'Entrée'. Il est nécessaire de définir les paramètres des outils avant de lancer le programme. Les offsets d'outils ne peuvent pas être modifiés une fois le programme démarré ni quand il est en pause.

source: .Mini Tool Display[[cap:Mini-Tool-Display]]
fr: .Affichage de la table d'outils de Mini

source: image::images/minitool.png[align="center"]
fr: image::images/minitool_fr.png[]

source: The [Add Tools] and [Remove Tools] buttons work on the bottom of the tool list so you will want to fill in tool information in descending order. Once a new tool has been added, you can use it in a program with the usual G-code commands. There is a 32 tool limit in the current LinuxCNC configuration files but you will run out of display space in Mini long before you get there.
fr: Les boutons 'Ajouter un outil' et 'Enlever le dernier outil' portent sur la fin de la liste des outils de sorte que l'ajout d'outils s'effectuent vers le bas. Quand un nouvel outil est ajouté, il est utilisable dans le programme avec la commande G-code habituelle. Le nombre maximum d'outils est de 32 dans le fichier de configuration de LinuxCNC mais vous serez arrivé au bout des possibilités d'affichage de Mini bien avant cela.

source: [TIP] You can use Menu > View > Show Popin Full to see more tools if you need.
fr: [TIP] A la place vous pouvez utiliser le 'menu → Vues → Afficher dans toute la fenêtre' pour voir plus d'outils si nécessaire.

source: === Offset Page
fr: === Page des offsets

source: The offset page can be used to display and setup work offsets. The coordinate system is selected along the left hand side of the window. Once you have selected a coordinate system you can enter values or move an axis to a teach position.
fr: La page des offsets peut être utilisée pour afficher et ajuster les décalages d'origine des différents systèmes de coordonnées. Le système de coordonnées est choisi dans la colonne de gauche, par sélection d'une case à cocher. Quand un système de coordonnées est choisi il est possible d'entrer directement les valeurs ou de déplacer l'axe à une position d'apprentissage.

source: .Mini Offset Display[[cap:Mini-Offset-Display]]
fr: .Mini Offset Display

source: image::images/minioffsets.png[align="center"]
fr: image::images/minioffsets_fr.png[]

source: You can also teach using an edgefinder by adding the radius and length to the offset_by widgets. When you do this you may need to add or subtract the radius depending upon which surface you choose to touch from. This is selected with the add or subtract radiobuttons below the offset windows.
fr: Il est également possible d'utiliser une pinnule puis d'ajouter le rayon et la longueur par le bouton 'Apprentissage'. Pour cela, il peut être nécessaire d'ajouter ou de soustraire le rayon de la pinnule selon la surface qui est touchée. C'est la case à cocher 'Soustraire' ou 'Ajouter' qui permet ce choix.

source: The zero all for the active coordinate system button will remove any offsets that you have showing but they are not set to zero in the variable file until you press the write and load file button as well. This write and load file button is the one to use when you have set all of the axis values that you want for a coordinate system.
fr: Le bouton 'Tous les Gxx à zéro' enlève tous les décalages du système courant visibles sur l'écran mais ne modifie pas les variables dans le fichier tant que le bouton 'écrire et recharger' n'est pas pressé. Le bouton 'écrire et recharger' est à presser pour valider et recharger tous les changements effectués sur les valeurs des systèmes de coordonnées.

source: == Keyboard Bindings
fr: == Raccourcis clavier

source: A number of the bindings used with tkLinuxCNC have been preserved with mini. A few of the bindings have been changed to extend that set or to ease the operation of a machine using this interface. Some keys operate the same regradless of the mode. Others change with the mode that LinuxCNC is operating in.
fr: Un certain nombre de raccourcis clavier utilisés avec TkLinuxCNC ont été conservés avec Mini. Quelques uns ont changé pour étendre leurs fonctions ou pour faciliter les opérations sur une machine utilisant cette interface. Certaines touches opèrent de la même manière quelque soit le mode. D'autres change en fonction du mode de travail de LinuxCNC.

source: === Common Keys
fr: === Touches courantes

source: 'Pause' - Toggle feedhold
fr: 'Pause' - Bascule du correcteur de vitesse travail

source: 'Escape' - abort motion
fr: 'Echap' - Abandonne le mouvement

source: 'F1' - toggle estop/estop reset state
fr: 'F1' - Bascule l'état de l'Arrêt d'Urgence

source: 'F2' - toggle machine off/machine on state
fr: 'F2' - Marche/Arrêt machine

source: 'F3' - manual mode
fr: 'F3' - Mode manuel

source: 'F4' - auto mode
fr: 'F4' - Mode Auto

source: 'F5' - MDI mode
fr: 'F5' - Mode MDI

source: 'F6' - reset interpreter
fr: 'F6' - Réinitialise l'interpréteur

source: The following only work for machines using auxiliary I/O
fr: Les touches suivantes fonctionnent seulement pour les machines utilisant des entrées sorties auxiliaires

source: 'F7' - toggle mist on/mist off
fr: 'F7' - Marche/Arrêt du brouillard

source: 'F8' - toggle flood on/flood off
fr: 'F8' - Marche/Arrêt arrosage

source: 'F9' - toggle spindle forward/off
fr: 'F9' - Marche/Arrêt broche sens horaire

source: 'F10' - toggle spindle reverse/off
fr: 'F10' - Marche/Arrêt broche sens anti-horaire

source: 'F11' - decrease spindle speed
fr: 'F11' - Diminue la vitesse de broche

source: 'F12' - increase spindle speed
fr: 'F12' - Augmente la vitesse de broche

source: === Manual Mode (((Manual)))
fr: === Mode Manuel (((Manuel)))

source: '1-9 0' - set feed override to 10%-90%, 0 is 100%
fr: '1-9 0' - Positionne le correcteur de vitesse d'avance travail de 10% en 10%, de 0 à 100%

source: '~' - set feed override to 0 or feedhold
fr: '~' - Positionne le correcteur de vitesse à 0

source: 'x' - select X axis
fr: 'x' - Sélectionne l'axe X

source: 'y' - select Y axis
fr: 'y' - Sélectionne l'axe Y

source: 'z' - select Z axis
fr: 'z' - Sélectionne l'axe Z

source: 'a' - select A axis
fr: 'a' - Sélectionne l'axe A

source: 'b' - select B axis
fr: 'b' - Sélectionne l'axe B

source: 'c' - select C axis
fr: 'c' - Sélectionne l'axe C

source: 'Left Right Arrow' - jog X axis
fr: 'Flèches Gauche et Droite' - jog de l'axe X

source: 'Up Down Arrow' - jog Y axis
fr: 'Flèches Haut et Bas' - jog de l'axe Y

source: 'Page Up Down' - jog Z axis
fr: 'Pg.up et Pg.down' - jog de l'axe Z

source: '- _' - jog the active axis in the minus direction
fr: '- _' - jog de l'axe actif dans la direction moins

source: '+ =' - jog the active axis in the plus direction.
fr: '+ =' - jog l'axe actif dans la direction plus

source: 'Home' - home selected axis
fr: 'Home' - POM de l'axe actif

source: 'i I' - toggle through jog increments
fr: 'i I' - Bascule cyclique des incréments de jog

source: The following only work with a machine using auxiliary I/O
fr: Les touches suivantes ne fonctionnent que sur les machines utilisant des entrées sorties auxiliaires

source: 'b' - take spindle brake off
fr: 'b' - Relâcher le frein de broche

source: 'Alt-b' - put spindle brake on
fr: 'Alt-b' - Engager le frein de broche

source: === Auto Mode (((Auto)))
fr: === Mode Auto (((Auto)))

source: '1-9,0' - set feed override to 10%-90%, 0 is 100%
fr: '1 à 9,0' - Positionne le correcteur de vitesse d'avance travail de 10% en 10%, de 0 à 100%

source: 'o/O' - open a program
fr: 'o/O' - Ouvre un programme

source: 'r/R' - run an opened program
fr: 'r/R' - Lance le programme ouvert

source: 'p/P' - pause an executing program
fr: 'p/P' - Met le programme en pause

source: 's/S' - resume a paused program
fr: 's/S' - Reprise d'un programme en pause

source: 'a/A' - step one line in a paused program
fr: 'a/A' - Avance d'une ligne dans un programme en pause

source: == Misc
fr: == Divers

source: One of the features of Mini is that it displays any axis above number 2 as a rotary and will display degree units for it. It also converts to degree units for incremental jogs when a rotary axis has the focus.
fr: Une des possibilités de Mini est d'afficher n'importe quel axe, au delà de 2, comme étant un axe rotatif, il affiche alors des degrés pour celui-ci. Il converti également les unités en degrés quand un axe rotatif a le focus.
