Repository: 0000duck/linuxcnc
Catalog: docs/src/gui/mini.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = MINI GUI
fr: = L'interface graphique MINI

source: [[cha:mini-gui]] (((Mini GUI)))
fr: [[cha:Mini]] (((Mini)))

source: .The Mini Graphical Interface (upon starting)[[fig:startmini]]
fr: .L'interface graphique Mini[[fig:startminif]]

source: image::images/mini01.png[align="center"]
fr: image::images/mini01_fr.png[]

source: Mini was designed to be a full screen graphical interface. It was first written for the Sherline(((Sherline))) CNC but is available for anyone to use, copy, and distribute under the terms of the GPL copyright.
fr: Mini a été prévu pour être une interface graphique plein écran. Il a été écrit initialement pour Sherline(((Sherline))) CNC mais est disponible pour ceux qui veulent l'utiliser, le copier le distribuer selon les termes de la GPL.

source: Rather than popup new windows for each thing that an operator might want to do, Mini allows you to display these within the regular screen. Parts of this chapter are copied from the instructions that were written for that mill by Joe Martin and Ray Henry. footnote:[Much of this chapter quotes from a chapter of the Sherline CNC Operators Manual.]
fr: Au lieu d'ouvrir une nouvelle fenêtre pour chaque chose que l'opérateur veux faire, Mini permet de les afficher toutes dans la même fenêtre. Certaines parties de ce chapitre sont des copies des instructions écrites par Joe Martin et Ray Henry. footnote:[La plus grande partie du texte de ce chapitre, a été tirée du Sherline CNC Operators Manual.]

source: == Screen layout
fr: == L'écran

source: .Mini Display for a Running LinuxCNC[[fig:runmini]]
fr: .Affichage de Mini lors du fonctionnement de LinuxCNC[[fig:runminif]]

source: image::images/mini02.png[align="center"]
fr: image:images/mini_fr.png[align="left"]

source: The Mini screen is laid out in several sections. These include a menu across the top, a set of main control buttons just below the menu, and two rather large columns of information that show the state of your machine and allow you to enter commands or programs.
fr: L'écran de Mini est visible dans plusieurs sections, voir la figure ci-dessus. Il inclu une barre de menu, un jeu de boutons de contrôle juste en dessous et deux larges colonnes d'information montrant l'état de la machine et permettant à l'opérateur d'entrer des commandes ou des programmes.

source: When you compare starting screen with run screen you will see many differences. In the second figure
fr: Quand on compare <<fig:startminif, entre l'écran d'accueil>> et <<fig:runminif,l'écran en cours de fonctionnement>>, des différences apparaissent. Sur la seconde image:

source: each axis has been homed -- the display numbers are dark green
fr: Chaque axe a été référencé sur son origine -- L'affichage de la visu est vert sombre

source: the LinuxCNC mode is auto -- the auto button has a light green background
fr: LinuxCNC est en mode auto(((Auto))) -- le bouton est vert clair

source: the backplotter has been turned on -- backplot is visible in the pop-in window
fr: Le parcours d'outil a été activé -- le parcours d'outil est visible dans la fenêtre

source: the tool path from the program is showing in the display.
fr: Le bloc de G-code en cours est en surbrillance blanche sur fond rouge parmi les lignes défilantes du programme.

source: Once you start working with Mini you will quickly discover how easily it shows the conditions of the LinuxCNC and allows you to make changes to it.
fr: Dès le début de l'utilisation de Mini on découvre combien il est facile de visualiser le fonctionnement de LinuxCNC et d'agir sur lui.

source: == Menu Bar
fr: == Barre de menu

source: The first row is the menu bar across the top. Here you can configure the screen to display additional information. Some of the items in this menu are very different from what you may be accustomed to with other programs. You should take a few minutes and look under each menu item in order to familiarize yourself with the features that are there.
fr: La première ligne est occupée par la barre de menu. Elle permet de configurer les informations optionnelles que l'écran doit afficher. Certains des items du menu sont très différents de ce qu'il est coutume de rencontrer avec d'autres programmes. Il faut prendre quelques minutes pour regarder chaque item du menu et se familiariser avec les possibilités qu'il offre.

source: The menu includes each of the following sections and subsections.
fr: Le menu inclus chacune des sections et sous-sections suivantes.

source: * 'Program' - This menu includes both reset and exit functions. Reset will return the LinuxCNC to the condition that it was in when it started. Some startup configuration items like the normal program units can be specified in the ini file.
fr: * 'Programme' - ce menu inclus les deux fonctions 'reset' et 'quitter'. Reset renvoie LinuxCNC dans l'état dans lequel il était quand il à démarré. Certains items de conditions de démarrage comme les unités du programme peuvent être spécifiés dans le fichier ini.

source: * 'View' - This menu includes several screen elements that can be added so that you can see additional information during a run. These include
fr: * 'Vues' - ce menu inclus plusieurs éléments d'affichage pouvant être ajoutés pendant qu'un programme s'exécute, pour donner des information supplémentaires. Ce qui inclus:

source: ** 'Position_Type' - This menu item adds a line above the main position displays that shows whether the displays are in inches or metric and whether they are Machine or Relative location and if they are Actual positions or Commanded positions. These can be changed using the Settings menu described below.
fr: ** 'Type_de_position' - cet item ajoute une ligne, au dessus de l'afficheur principal de position, qui indique si la position affichée est en coordonnées machine (absolues) ou en coordonnées pièce (relatives), si la position affichée est actuelle ou commandée et si l'unité et le pouce le millimètre. Ce qui peut être modifié en agissant sur le menu 'Réglages' décrit plus loin.

source: ** 'Tool_Info' - This adds a line immediately below the main position displays that shows which tool has been selected and the length of offset applied.
fr: ** 'Informations_outil' - cet item ajoute une ligne immédiatement sous l'afficheur principal, elle affiche quel outil est sélectionné et la valeur de l'offset appliqué.

source: ** 'Offset_Info' - adds a line immediately below the tool info that shows what offsets have been applied. This is a total distance for each axis from machine zero.
fr: ** 'Informations_offset' - ajoute une ligne immédiatement sous celle des informations outil, elle affiche les offsets de travail actuellement appliqués. C'est la distance totale pour chaque axe depuis son point d'origine machine.

source: ** 'Show_Restart' - adds a block of buttons to the right of the program display in auto mode. These allow the operator to restart a program after an abort or estop. These will pop in whenever estop or abort is pressed but can be shows by the operator anytime auto mode is active by selecting this menu item.
fr: ** 'Afficher_Reprise' - ajoute, en mode Auto, un bloc de boutons en bas à droite de l'affichage du programme. Ces boutons permettent à l'opérateur de relancer un programme après un A/U ou un Abandon. Le programme est figé lorsqu'un A/U ou un Abandon est engagé, mais l'opérateur peut ici choisir le bloc sur lequel redémarrer dans le mode Auto, en activant cet item de menu.

source: ** 'Hide_Restart' - removes the block of buttons that control the restart of a program that has been aborted or estopped.
fr: ** 'Masquer_Reprise' - enlève le bloc de boutons contrôlant la reprise d'un programme stoppé par Abandon ou Arrêt d'Urgence.

source: ** 'Show_Split_Right' - changes the nature of the right hand column so that it shows both mode and pop-in information.
fr: ** 'Diviser_la_vue_droite' - modifie la nature de l'affichage de la colonne de droite pour qu'il montre plus d'informations.

source: ** 'Show_Mode_Full' - changes the right hand column so that the mode buttons or displays fill the entire right side of the screen. In manual mode, running with mode full you will see spindle and lube control buttons as well as the motion buttons.
fr: ** 'Afficher_en_mode_complet' - modifie l'affichage de la colonne de droite, soit en mode boutons et la colonne divisée, soit affichage sur la colonne entière. En mode manuel et en utilisant ce mode entier, les boutons de la broche et du lubrifiant sont visibles en plus des boutons de mouvement.

source: ** 'Show_Popin_Full' - changes the right hand column so that the popin fills the entire right side of the screen.
fr: ** 'Afficher_dans_toute_la_fenêtre' - modifie l'affichage dans la colonne de droite pour qu'elle soit remplie entièrement.

source: * 'Settings' - These menu items allow the operator to control certain parameters during a run.
fr: * 'Réglages' - Les items de ce menu permettent à l'opérateur de contrôler certains paramètres en cours d'usinage.

source: ** 'Actual_Position' - sets the main position displays to actual(machine based) values.
fr: ** 'Position_Actuelle' - régle l'afficheur principal sur des valeurs de position actuelle (basées sur la machine).

source: ** 'Commanded_Position' - sets the main position displays to the values that they were commanded to.
fr: ** Position_Commandée' - régle l'afficheur principal sur des valeurs de position commandée (positions cibles).

source: ** 'Machine_Position' - sets the main position displays to the absolute distance from where the machine was homed.
fr: ** 'Position_Machine' - régle l'afficheur principal sur des valeurs de position absolue, distance depuis le point d'origine machine.

source: ** 'Relative_Position' - sets the main position displays to show the current position including any offsets like part zeros that are active. For more information on offsets see the chapter on coordinate systems.
fr: ** 'Position_Relative' - règle l'affichage principal pour qu'il affiche les valeurs de la position courante en incluant tous les offsets comme les origines pièces qui seraient actives. Pour plus de détails voir le chapitre sur les 'Systèmes de coordonnées'.

source: * 'Info' - lets you see a number of active things by writing their values into the MESSAGE pad.
fr: * 'Informations' - Indique diverses activités en affichant des valeurs dans la zone MESSAGES.

source: ** 'Program_File' - will write the currently active program file name.
fr: ** 'Fichier_programme' - Indique le nom du fichier programme actif.

source: ** 'Editor_File' - will write the currently active file if the editor pop in is active and a file has been selected for editing.
fr: ** 'Éditeur_de_Fichiers' - Indique le nom de l'éditeur de texte lancé quand un fichier est choisi pour être édité.

source: ** 'Parameter_File' - will write the name of the file being used for program parameters. You can find more on this in the chapters on offsets and using variables for programming.
fr: ** 'Fichier_de_paramètres' - Indique le nom du fichier devant être utilisé pour enregistrer les paramètres du programme. Il est possible d'avoir plus d'informations dans le chapitre sur les offsets et l'utilisation des paramètres dans les programmes.

source: ** 'Tool_File' - will write the name of the tool file that is being used during this run.
fr: ** 'Fichiers_d'outils' - Indique le nom du fichier d'outils utilisé pour l'usinage en cours.

source: ** 'Active_G-Codes' - will write a list of all of the modal program codes that are active whenever this item is selected. For more information about modal codes see the introductory part programming chapter.
fr: ** 'G-Codes_actifs' - Indique la liste des G-codes modaux actifs au moment ou cet item a été sélectionné. Pour plus d'informations sur les codes modaux, se reporter aux chapitres sur la programmation.

source: 'Help' - opens a text window pop in that displays the contents of the help file.
fr: 'Aide' - Ouvre une fenêtre de texte contenant un fichier d'aide.

source: You will notice between the info menu and the help menu there are a set of four buttons. These are called check buttons because they have a small box that shows red if they have been selected. These four buttons, Editor, Backplot, Tools, and Offsets pop in each of these screens. If more than one pop-in is active (button shown as red) you can toggle between these pop-ins by right clicking your mouse.
fr: Noter que entre le menu informations et le menu d'aide il y a un jeu de quatre cases à cocher. Elles sont appelées cases sélectionnables car elles passent au rouge si elles sont sélectionnées. Ces quatre cases, Éditeur, Parcours d'outil, Outils et Offsets activent les différents écrans. Si plus d'une de ces cases est validée (case en rouge) il est possible de passer de l'un à l'autre des écrans surgissant par un clic droit de la souris.

source: == Control Button Bar
fr: == Barre de boutons de contrôle

source: Below the menu line is a horizontal line of control buttons. These are the primary control buttons for the interface. Using these buttons you can change mode from [MANUAL] to [AUTO] to [MDI] (Manual Data Input). These buttons show a light green background whenever that mode is active.
fr: Sous la ligne de menu se trouve une ligne de boutons de contrôle. Ce sont les boutons principaux de l'interface. En utilisant ces boutons ilest possible de changer de mode cycliquement entre 'MANUEL' puis 'AUTO' puis MDI (Manual Data Input). Ces boutons ont un fond vert clair quand le mode correspondant est actif.

source: You can also use the [FEEDHOLD], [ABORT], and [ESTOP] buttons to control a programmed move.
fr: Il est également possible d'utiliser les boutons 'VITESSE-0', 'ABANDON' et 'A/U' pour contrôler le programme.

source: === MANUAL (((Manual)))
fr: === MANUEL (((Manuel)))

source: This button or pressing <F3> sets the LinuxCNC to Manual mode and displays an abbreviated set of buttons the operator can use to issue manual motion commands. The labels of the jog buttons change to match the active axis. Whenever Show_Mode_Full is active in in manual mode, you will see spindle and lube control buttons as well as the motion buttons. A keyboard <i> or <I> will switch from continuous jog to incremental jog. Pressing that key again will toggle the increment size through the available sizes.
fr: Ce bouton, ou la touche <F3> placent LinuxCNC en mode Manuel et affiche un jeu condensé de boutons que l'opérateur peut utiliser pour effectuer des commandes de mouvements manuels. Les labels des boutons de jog varient pour refléter l'axe actif. Quand en plus de ce mode manuel, la vue en mode complet est activée, les boutons de la broche et du lubrifiant sont visibles en plus de ceux de mouvement. La touche <i> ou <I> basculera entre jog en continu et jog par incréments. Presser cette touche plusieurs fois provoquera le changement cyclique de la taille de l'incrément de jog.

source: .Manual Mode Buttons[[cap:Manual-Mode-Buttons]]
fr: .Boutons du mode Manuel

source: image::images/miniman.png[align="center"]
fr: image::images/miniman_fr.png[]

source: .From the Sherline CNC Operators Manual: *********************************************************************** A button has been added to designate the present position as the home position. We felt that a machine of this type (Sherline 5400) would be simpler to operate if it didn't use a machine home position. This button will zero out any offsets and will home all axes right where they are.
fr: .Provenant du manuel utilisateur de Sherline CNC: **** Un bouton à été ajouté pour désigner la position actuelle comme étant la position d'origine. Une machine simple telle que la Sherline 5400 serait facile à utiliser sans avoir de position d'origine. Ce bouton met les offsets de tous les axes à zéro et place l'origine de tous les axes au point courant.

source: Axis focus is important here. Notice in <<fig:startmini,startup figure>> that in manual mode you see a line or 'groove' around the X axis to highlight its position display. This groove says that X is the active axis. It will be the target for jog moves made with the 'plus' and 'minus' jog buttons. You can change axis focus by clicking on any other axis display. You can also change axis focus in manual mode if you press its name key on your keyboard. Case is not important here. [Y] or [y] will shift the focus to the Y axis. [A] or [a] will shift the focus to the A axis. To help you remember which axis will jog when you press the jog buttons, the active axis name is displayed on them.
fr: Ce concentrer sur les axes est important ici. Noter que sur la capture <<fig:startminif,du début de chapitre>> qui est en mode manuel, on voit un cadre autour de l'axe X pour mettre son affichage en évidence. Ce cadre (le focus) indique que l'axe X est l'axe actif. Il est l'axe cible pour les mouvements de jog faits par appui sur les boutons 'plus' ou 'moins'. Il est possible de changer l'axe actif en cliquant sur l'affichage d'un autre axe. C'est également possible en mode manuel en pressant la touche de son nom sur le clavier. La casse n'a pas d'importance [Y] ou [y] donneront le focus à l'axe Y. [A] ou [a] le donneront à l'axe A. Pour aider à se rappeler quel est l'axe actif avant de faire un jog, son nom est indiqué sur les boutons de jog.

source: LinuxCNC can jog (move a particular axis) as long as you hold the button down when it is set for 'continuous', or it can jog for a preset distance when it is set for 'incremental'. You can also jog the active axis by pressing the plus [+] or minus [-] keys on the keyboard. Again, case is not important for keyboard jogs. The two small buttons between the large jog buttons let you set which kind of jog you want. When you are in incremental mode, the distance buttons come alive. You can set a distance by pressing it with the mouse. You can toggle between distances by pressing [i] or [I] on the keyboard. Incremental jog has an interesting and often unexpected effect. If you press the jog button while a jog is in progress, it will add the distance to the position it was at when the second jog command was issued. Two one-inch jog presses in close succession will not get you two inches of movement. You have to wait until the first one is complete before jogging again.
fr: LinuxCNC peut faire un jog (mouvement d'un axe particulier) aussi longtemps que le bouton est maintenu pressé, si le jog est réglé sur 'continu', ou il peut se déplacer d'une valeur prédéfinie, quand il est réglé sur 'incréments'. Il est aussi possible de faire un jog de l'axe actif en pressant les touches [+] ou moins [-] du clavier. De nouveau, la casse n'a pas d'importance pour les jogs au clavier. Les deux petits boutons situés entre les deux gros du jog, permettent de choisir quel type de jog est souhaite. Quand on est en mode incréments, les boutons de taille d'incréments sont accessibles. La sélection d'une taille d'incrément se fait par clic sur la case à cocher avec la souris ou cycliquement en pressant la touche [i] ou [I] sur le clavier. Le jog par incréments présente quelques effets intéressants autant qu'inattendus. Si vous pressez le bouton de jog alors qu'un mouvement de jog est déjà en cours, la distance à laquelle il était lorsque est arrivée la commande du second jog, sera ajoutée à la position. Deux pressions successives rapides de 10mm d'incrément ne donneront pas 20mm de mouvement. Vous devez attendre que le premier soit terminé avant d'envoyer le second.

source: Jog speed is displayed above the slider. It can be set using the slider by clicking in the slider's open slot on the side you want it to move toward, or by clicking on the [Default] or [Rapid] buttons. This setting only affects the jog move while in manual mode. Once a jog move is initiated, jog speed has no effect on the jog. As an example of this, say you set jog mode to 'incremental' and the increment to 1 inch. Once you press the [Jog] button it will travel that inch at the rate at which it started. ***********************************************************************
fr: La vitesse de jog est affichée au dessus du curseur. Il est possible de régler le curseur en cliquant dans la glissière du curseur, du côté où vous voulez son déplacement, ou en cliquant sur les boutons 'Défaut' ou 'Rapide'. Ces réglages n'affectent que les mouvements de jog en mode manuel. Tant qu'un mouvement de jog est en cours, un changement de la vitesse de jog est sans effet sur le jog. Par exemple, disons que vous avez réglé le jog par incréments de 10mm. Même si vous pressez le bouton Jog, le déplacement de dix millimètres se finira à la vitesse à laquelle il a commencé. ****

source: When the Auto button is pressed, or <F4> on the keyboard, and LinuxCNC is set to that mode, a set of the traditional auto operation buttons is displayed, and a small text window opens to show a part program. During run the active line will be displayed as white lettering on a red background.
fr: Quand le bouton Auto est pressé, ou <F4> sur le clavier, LinuxCNC passe dans ce mode, un jeu de boutons traditionnels des opérations en auto est affiché et une petite fenêtre textuelle s'ouvre, montrant une partie du programme. Durant un usinage, la ligne active est affichée en surbrillance blanche sur fond rouge.

source: In the auto mode, many of the keyboard keys are bound to controls. For example, the numbers above the qwerty keys are bound to feed rate override. The 0 sets 100%, 9 sets 90% and such. Other keys work much the same as they do with the tkLinuxCNC graphical interface.
fr: Dans le mode auto, beaucoup de touches sont liées aux contrôles. Par exemple, les touches numérotées au dessus du clavier sont liées aux réglages du correcteur de vitesse d'avance travail. Le <0> l'ajuste à 100%, le <9> l'ajuste à 90% etc. D'autres touches fonctionnent de la même manière qu'avec l'interface TkLinuxCNC.

source: .Auto Mode[[cap:Auto-Mode]]
fr: .Mode Auto

source: image::images/miniauto.png[align="center"]
fr: image::images/miniauto_fr.png[]

source: Auto mode does not normally display the active or modal codes. If the operator wishes to check these, use menu Info→Active_G-Codes. This will write all modal codes onto the message scratch pad.
fr: Le mode Auto n'affiche normalement pas les G-codes actifs ou modaux. Si l'opérateur veut les voir, il doit utiliser le menu 'Informations' → 'G-codes actifs' et afficher ainsi la liste des codes modaux dans la zone de texte MESSAGES.

source: If abort or estop is pressed during a run, a set of buttons will display to the right of the text that allow the operator to shift the restart line forward or backward. If the restart line is not the last active line, it will be highlighted as white letters on a blue background. Caution, a very slow feed rate, and a finger poised over the pause button is advised during any program restart.
fr: Si un Arrêt d'Urgence ou un Abandon est pressé pendant un usinage, un jeu de boutons s'affiche en bas et à droite, ils permettent à l'opérateur de décaler la ligne de reprise vers l'avant ou vers l'arrière. Si la ligne de reprise n'est pas la dernière ligne active, elle sera mise en surbrillance blanche sur fond bleu. ATTENTION, une vitesse très faible et un doigt collé sur le bouton de pause est prudent pendant toute reprise de programme!
