Repository: 0000duck/linuxcnc
Catalog: docs/src/gui/mini.*.po
Languages: fr

source: .From the Sherline CNC Operators Manual: *********************************************************************** The real heart of CNC machine tool work is the auto mode. Sherline's auto mode displays the typical functions that people have come to expect from LinuxCNC. Along the top are a set of buttons which control what is happening in auto mode. Below them is the window that shows the part of the program currently being executed. As the program runs, the active line shows in white letters on a red background. The first three buttons, [Open], [Run], and [Pause] do about what you'd expect. [Pause] will stop the run right where it is. The next button, [Resume], will restart motion. They are like feedhold if used this way. Once [Pause] is pressed and motion has stopped, [Step] will resume motion and continue it to the end of the current block. Press [Step] again to get the motion of the next block. Press [Resume] and the interpreter goes back to reading ahead and running the program. The combination of [Pause] and [Step] work a lot like single block mode on many controllers. The difference is that [Pause] does not let motion continue to the end of the current block. Feed rate Override ... can be very handy as you approach a first cut. Move in quickly at 100 percent, throttle back to 10% and toggle between [Feedhold] and 10% using the pause button. When you are satisfied that you've got it right, hit the zero to the right of nine (feedrate=100%) and go.
fr: .Provenant du manuel utilisateur de Sherline CNC: **** Ce qui est le mieux avec une machine CNC, c'est le mode auto. Le mode auto affiche les fonctions typiques que tout le monde espère utiliser avec LinuxCNC. Au dessus de la fenêtre un jeu de boutons qui contrôlent ce qui se passe en mode auto. En dessous, la fenêtre montrant la partie du programme en cours d'exécution. Quand le programme est lancé, la ligne active s'affiche en surbrillance blanche sur fond rouge. Les trois premiers boutons, [Ouvrir], [Lancer] et [Pause] font ce que leurs noms indiquent. [Pause] stoppe le programme en cours d'exécution là où il est. Le bouton suivant, [Reprise], reprend le mouvement. Le résultat est le même si le bouton [Vitesse-0] était pressé au lieu du bouton [Pause], le mouvement est stoppé, [Pas à pas] reprend aussi le mouvement, mais il ne continue que jusqu'à la fin du bloc courant. Presser une nouvelle fois [Pas à pas] exécutera le mouvement du bloc suivant. Presser [Reprise] à ce moment là et l'interpréteur reviendra en arrière lire et relancer le programme. La combinaison entre [Pause] et [Pas à pas] marche un peu comme un seul bloc dans plusieurs interpréteurs. Avec la différence que [Pause] ne laisse pas le mouvement se poursuivre jusqu'à la fin du bloc courant. Le correcteur de vitesse d'avance travail peut se révéler très pratique pour s'approcher de la matière pour un premier usinage. Le placer sur 100% pour les déplacements rapides, le régler sur 10% et basculez entre [Vitesse-0] et 10% en utilisant le bouton [Pause]. Quand vous êtes satisfait et que les choses se présentent bien, pressez le zéro à la droite du neuf en haut du clavier, et c'est parti.

source: The [Verify] button runs the interpreter through the code without initiating any motion. If Verify finds a problem it will stop the read near the problem block and put up some sort of message. Most of the time you will be able to figure out the problem with your program by reading the message and looking in the program window at the highlighted line. Some of the messages are not very helpful. Sometimes you will need to read a line or two ahead of the highlight to see the problem. Occasionally the message will refer to something well ahead of the highlight line. This often happens if you forget to end your program with an acceptable code like %, M2, M30, or M60. ***********************************************************************
fr: Le bouton [Vérifier] passe le code dans l'interpréteur sans production de mouvements. Si Vérifier trouve un problème il stoppe la lecture juste derrière le bloc posant problème et affiche un message. La plupart du temps vous serez en mesure de régler le problème avec votre programme par la lecture du message et en vérifiant la ligne de code en surbrillance dans la fenêtre du programme. Certains messages,toutefois, ne sont pas d'un grand secours. Parfois vous devrez lire une ou deux lignes en avant de celle en surbrillance pour voir le problème. Occasionnellement le message fait référence à quelque chose très en avant de la ligne en surbrillance. Le plus souvent ça se produit si vous oubliez de terminer votre programme par un code correct comme %, M2, M30, ou M60. ****

source: The MDI button or <F5> sets the Manual Data Input mode. This mode displays a single line of text for block entry and shows the currently active modal codes for the interpreter.
fr: Le bouton MDI ou la touche <F5> activent le mode d'entrée de données en manuel (Manual Data Input). Ce mode affiche un simple champ de saisie d'une ligne de texte et montre les codes modaux actuellement actifs dans l'interpréteur.

source: .From the Sherline CNC Operators Manual: *********************************************************************** MDI mode allows you to enter single blocks and have the interpreter execute them as if they were part of a program (kind of like a one-line program). You can execute circles, arcs, lines and such. You can even test sets of program lines by entering one block, waiting for that motion to end, and then enter the next block. Below the entry window, there is a listing of all of the current modal codes. This listing can be very handy. I often forget to enter a g00 before I command a motion. If nothing happens I look down there to see if g80 is in effect. G80 stops any motion. If it's there I remember to issue a block like g00 x0 y0 z0. In MDI you are entering text from the keyboard so none of the main keys work for commands to the running machine. [F1] will Estop the control. ***********************************************************************
fr: .Provenant du manuel utilisateur de Sherline CNC: **** Le mode MDI vous permet d'entrer de simples blocs et de les faire exécuter par l'interpréteur comme si ils étaient une partie d'un programme (Une sorte de programme d'une seule ligne). Vous pouvez exécuter des cercles, des arcs, des lignes et autres. Vous pouvez aussi mettre au point une ligne de programme en entrant cette ligne comme un seul bloc, attendre que le mouvement se termine et entrer le bloc suivant. Sous la fenêtre d'entrée, se trouve une liste des codes modaux courants. Cette liste peut être très pratique. J'oublie parfois d'entrer un G0 avant une commande de mouvement. Si rien ne se passe je regarde dans la liste si G80 est actif. G80 stoppe tous les mouvements. Si il y est je me rappelle de mettre un bloc comme G00 X0 Y0 Z0. Dans le MDI, vous entrez du texte depuis le clavier, ainsi toutes les touches principales ne fonctionnent pas comme raccourcis clavier pour les commandes machine. [F1] engage l'Arrêt d'Urgence. ****

source: Since many of the keyboard keys are needed for entry, most of the bindings that were available in auto mode are not available here.
fr: Puisque les touches du clavier sont nécessaires à la saisie du texte, beaucoup des raccourcis clavier disponibles en mode auto ne le sont pas ici.

source: === [FEEDHOLD] -- [CONTINUE]
fr: === VITESSE-0 et CONTINUER

source: Feedhold is a toggle. When the LinuxCNC is ready to handle or is handling a motion command this button shows the feedhold label on a red background. If feedhold has been pressed then it will show the continue label. Using it to pause motion has the advantage of being able to restart the program from where you stopped it. Feedhold will toggle between zero speed and whatever feed rate override was active before it was pressed. This button and the function that it activates is also bound to the pause button on most keyboards.
fr: Vitesse-0 est une bascule. Quand LinuxCNC est prêt pour exécuter, ou qu'il exécute une commande de mouvement, ce bouton affiche son label VITESSE-0 sur fond rouge. Si Vitesse-0 a été pressé il affiche le label CONTINUER. Utiliser ce bouton pour faire une pause dans un mouvement présente l'avantage d'être capable de relancer le programme d'où il a été stoppé. Vitesse-0 bascule simplement entre vitesse zéro et la vitesse d'avance travail avec l'éventuel correcteur qui était actif au moment de l'arrêt. Ce bouton et la fonction qu'il active sont également liés à la touche pause de la plupart des claviers.

source: === [ABORT]
fr: === ABANDON

source: The abort button stops any motion when it is pressed. It also removes the motion command from the LinuxCNC. No further motions are cued up after this button is pressed. If you are in auto mode, this button removes the rest of the program from the motion cue. It also records the number of the line that was executing when it was pressed. You can use this line number to restart the program after you have cleared up the reasons for pressing it.
fr: Le bouton Abandon stoppe tous les mouvements quand il est pressé. Il désactive aussi la commande de marche de LinuxCNC. Plus aucun mouvement ne survient après l'appui sur ce bouton. Si vous êtes en mode auto, ce bouton enlève le reste du programme du planificateur de mouvements. Il enregistre aussi le numéro de la ligne qui s'exécutait quand il a été pressé. Vous pouvez vous servir de ce numéro de ligne pour redémarrer le programme après avoir supprimé la raison de l'appui...

source: === [ESTOP]
fr: === Arrêt d'Urgence

source: The estop button is also a toggle but it works in three possible settings.
fr: Le bouton d'Arrêt d'Urgence est une bascule mais il a trois fonctionnements possibles.

source: - When Mini starts up it will show a raised button with red background with black letters that say 'ESTOP PUSH'. This is the correct state of the machine when you want to run a program or jog an axis. Estop is ready to work for you when it looks like this. - If you push the estop button while a motion is being executed, you will see a recessed gray button that says 'ESTOPPED'. You will not be able to move an axis or do any work from the Mini gui when the estop button displays this way. Pressing it with your mouse will return Mini to normal ready condition. - A third view is possible here. A recessed green button means that estop has been take off but the machine has not been turned on. Normally this only happens when <F1> estop has been pressed but <F2> has not been pressed.
fr: - Au démarrage de Mini c'est un bouton avec le texte A/U écrit en noir sur fond rouge. C'est état de la machine est correct pour charger un programme ou faire un jog sur un axe. L'Arrêt d'Urgence est libéré quand il s'affiche dans cet état. - Si vous pressez sur le bouton d'Arrêt d'Urgence pendant qu'un mouvement est exécuté, le texte sur le bouton devient 'A/U Engagé' sur fond gris et le bouton s'enfonce. Plus aucun mouvement n'est possible et plus rien ne réagi sur l'interface Mini tant que l'Arrêt d'Urgence est dans cet état. Le presser à nouveau à la souris le fera repasser en conditions normales de fonctionnement. - Un troisième état est encore possible. Un bouton enfoncé portant le texte 'A/U Libéré' sur fond vert signifie que l'A/U a bien été libéré mais que la machine n'a pas été mise en marche. Normalement cet état apparaît quand l'A/U était libéré mais que la touche Marche Machine <F2> a été pressée.

source: Joe Martin says, "When all else fails press a software [ESTOP]." This does everything that abort does but adds in a reset so that the LinuxCNC returns to the standard settings that it wakes up on. If you have an external estop circuit that watches the relevant parallel port or DIO pin, a software estop can turn off power to the motors.
fr: Joe Martin disait, "Quand tout le reste a échoué, pressez un Arrêt d'Urgence software". Si vous avez un circuit externe qui gère l'A/U en surveillant une broche du port parallèle ou celle d'une carte d'entrées/sorties, un arrêt d'urgence software pourra couper la puissance sur les moteurs.

source: .From the Sherline CNC Operators Manual: *********************************************************************** Most of the time, when we abort or E-Stop it's because something went wrong. Perhaps we broke a tool and want to change it. We switch to manual mode and raise the spindle, change tools, and assuming that we got the length the same, get ready to go on. If we return the tool to the same place where the abort was issued, LinuxCNC will work perfectly. It is possible to move the restart line back or ahead of where the abort happened. If you press the [Back] or [Ahead] buttons you will see a blue highlight that shows the relationship between the abort line and the one on which LinuxCNC will start up again. By thinking through what is happening at the time of the restart you can place the tool tip where it will resume work in an acceptable manner. You will need to think through things like tool offsets, barriers to motion along a diagonal line, and such, before you press the [Restart] button. ***********************************************************************
fr: .Provenant du manuel utilisateur de Sherline CNC: **** La plupart du temps, quand un Abandon ou un Arrêt d'Urgence est engagé c'est parce que quelque chose se passe mal. Peut être un outil cassé et qui doit être changé. On passe alors en mode manuel et on arrête la broche, on change l'outil et en supposant que sa longueur reste la même, on est prêt pour relancer le programme. Si on renvoie l'outil à la même place ou il était avant, LinuxCNC va fonctionner parfaitement. Il est aussi possible de se déplacer sur la ligne suivante ou précédente de celle ou c'est produit l'abandon. Si vous pressez le bouton [Arrière] ou [Avant] vous voyez une ligne en surbrillance bleue montrant l'écart entre la ligne sur laquelle l'abandon s'est produit (restée en surbrillance rouge) et la ligne à laquelle LinuxCNC va redémarrer. En réfléchissant à ce qui va se produire au moment de la reprise vous serez en mesure de placer l'arête de l'outil là où la reprise pourra se faire de manière acceptable. Vous aurez peut être à solutionner certaines difficultés comme celles créées par les compensations de rayon d'outil le long d'une ligne diagonale et vous devrez être sûr de vous avant de presser sur le bouton [Reprise]. ****

source: == Left Column
fr: == Colonne de gauche

source: There are two columns below the control line. The left side of the screen displays information of interest to the operator. There are very few buttons to press here.
fr: Il y a deux colonnes sous la barre de contrôle. La colonne de gauche affiche les informations intéressant l'opérateur. Il y a seulement deux boutons dans cette zone.

source: === Axis Position Displays
fr: === Afficheurs de position des axes

source: The axis position displays work exactly like they do with tkLinuxCNC. The color of the letters is important.
fr: Ces afficheurs d'axe se comportent exactement comme ceux de TkLinuxCNC. La couleur des afficheurs est importante.

source: Red indicates that the machine is sitting on a limit switch or the polarity of a min or max limit is set wrong in the ini file.
fr: Rouge, elle indique que la machine est en appui sur un contact de fin de course ou que la polarité d'une limite est mal positionnée dans le fichier ini.

source: Yellow indicates that the machine is ready to be homed.
fr: Jaune, elle indique que la machine est prête pour faire ses prises d'origine.

source: Green indicates that the machine has been homed.
fr: Verte, elle indique que la machine a bien été référencée sur ses points d'origine.

source: The position can be changed to display any one of several values by using the menu settings. The startup or default settings can be changed in the ini file so these displays wake up just the way that you want them.
fr: Le type de position affichée peut varier, selon les options choisies dans le menus 'Réglages'. Les réglages par défaut, ou de démarrage, peuvent être changés dans le fichier ini pour correspondre à vos besoins.

source: === Feed rate Override (((feed override)))
fr: === Correcteur de vitesse travail(((correcteur vitesse)))

source: Immediately below the axis position displays is the feed rate override slider. You can operate feed rate override and feedhold in any mode of operation. Override will change the speed of jogs or feed rate in manual or MDI modes. You can adjust feed rate override by grabbing the slider with your mouse and dragging it along the groove. You can also change feed rate a percent at a time by clicking in the slider's groove. In auto mode you can also set feed override in 10% increments by pressing the top row of numbers. This slider is a handy visual reference to how much override is being applied to programmed feed rate.
fr: Immédiatement sous les afficheurs de position on trouve un curseur, c'est le correcteur de vitesse travail. Vous pouvez agir sur le correcteur de vitesse et sur le bouton Vitesse-0 dans tous les modes de marche. Le correcteur agit sur la vitesse de jog et sur la vitesse d'avance travail dans les modes manuel ou MDI. Il est possible de modifier la position du curseur en le déplaçant à la souris le long de sa glissière. Il est également possible de modifier le correcteur de 1% à chaque fois qu'un clic de souris est fait dans la glissière du curseur. En mode Manuel il est possible d'ajuster le correcteur par incréments de 10% avec les touches chiffrées du haut du clavier. Le curseur est une référence visuelle très pratique pour estimer la correction appliquée sur la vitesse d'avance programmée.

source: The message display located under the axis positions is a sort of scratch pad for LinuxCNC. If there are problems it will report them there. If you try to home or move an axis when the [ESTOP] button is pressed, you'll get a message that says something about commanding motion when LinuxCNC is not ready. If an axis faults out for something like falling behind, the message pad will show what happened. If you want to remind an operator to change a tool, for example, you can add a line of code to your program that will display in the message box. An example might be (msg, change to tool #3 and press resume). This line of code, included in a program, will display 'change to tool #3 and press resume' in the message box. The word msg, (with comma included) is the command to make this happen; without 'msg,' the message wouldn't be displayed. It will still show in the auto modes' display of the program file.
fr: L'affichage des messages situé sous le curseur du correcteur de vitesse est une sorte de bloc-notes pour LinuxCNC. Si un problème survient, il est reporté sur ce bloc-notes. Si vous essayez de déplacer un axe alors que l'Arrêt d'Urgence est engagé, vous recevez un message qui dit quelques choses à propos des conditions de marche empêchant LinuxCNC de répondre à la commande de mouvement. Si un axe est en défaut, par exemple un dépassement de limite, le message affiché sur le bloc-notes indiquera ce qui se passe. Pour demander à l'opérateur de changer d'outil par exemple, vous pouvez aussi ajouter une ligne de code dans le programme qui s'affichera sur l'écran, dans la boîte de messages. Un exemple pourrait être: (msg, Montez l'outil N°3 puis pressez Reprise). Cette ligne de code, incluse dans un programme, va afficher 'Montez l'outil 3 puis pressez Reprise' dans la boîte de messages. Le mot msg, (avec la virgule) est la commande qui fait apparaître le commentaire, sans 'msg', le message ne serait pas affiché.

source: To erase messages simply click the message button at the top of the pad or, on the keyboard, hold down the [Alt] key and press the [m] key.
fr: Pour effacer les messages cliquer simplement sur le bandeau --MESSAGES-- au dessus du bloc-notes ou au clavier, presser <m> tout en maintenant la touche 'Alt' appuyée.

source: == Right Column
fr: == Colonne de droite

source: The right column is a general purpose place to display and work. Here you can see the modal buttons and text entry or displays. Here you can view a plot of the tool path that will be commanded by your program. You can also write programs and control tools and offsets here. The modal screens have been described above. Each of the popin displays are described in detail below.
fr: La colonne de droite est l'emplacement sur lequel seront affichés les différents éléments résultants des choix de l'utilisateur. C'est ici que seront visibles les différentes entrées de texte, les différents affichages et les boutons du mode manuel. C'est ici que le parcours d'outil sera affiché pendant l'exécution d'un programme. C'est également ici que l'éditeur de texte s'ouvrira pour permettre l'édition des programmes, l'édition des tables d'outils ou d'offsets. L'écran du mode manuel a déjà été décrit précédemment. Chaque écran surgissant va être décrit en détail ci-dessous.

source: === Program Editor
fr: === Éditeur de texte

source: .Mini Text Editor[[cap:Mini-Text-Editor]]
fr: .Éditeur de texte de Mini

source: image::images/miniedit.png[align="center"]
fr: image::images/miniedit_fr.png[]

source: The editor is rather limited compared to many modern text editors. It does not have 'undo' nor 'paste' between windows with the clipboard. These were eliminated because of interaction with a running program. Future releases will replace these functions so that it will work the way you've come to expect from a text editor. It is included because it has the rather nice feature of being able to number and renumber lines in the way that the interpreter expects of a file. It will also allow you to cut and paste from one part of a file to another. In addition, it will allow you to save your changes and submit them to the LinuxCNC interpreter with the same menu click. You can work on a file in here for a while and then save and load if the LinuxCNC is in Auto mode. If you have been running a file and find that you need to edit it, that file will be placed in the editor when you click on the editor button on the top menu.
fr: L'éditeur de texte de Mini peut sembler un peu limité par rapport aux éditeurs de texte modernes. Il a été inclus parce qu'il comporte l'excellente possibilité de numéroter et renuméroter un programme de la même manière que l'interpréteur le fait avec un fichier. Il permet également le couper/coller d'une partie vers une autre du fichier. En plus, il permet d'enregistrer les changements faits dans le programme et de soumettre celui-ci à l'interpréteur de LinuxCNC depuis le même menu. Il est possible de travailler sur un fichier ouvert dans cet éditeur puis de l'enregistrer et de le recharger si LinuxCNC est en mode Auto. Si vous avez lancé un fichier et que vous avez besoin de l'éditer, ce fichier sera placé dans l'éditeur quand vous cliquez sur le bouton 'Éditeur' du menu.

source: === Backplot Display(((backplot)))
fr: === Parcours d'outil(((trace d'outil )))

source: .Minis Backplotter[[cap:Minis-Backplotter]]
fr: .Parcours d'outil de Mini

source: image::images/minibkplot.png[align="center"]
fr: image::images/minibkplot_fr.png[]
