Repository: 0000duck/linuxcnc
Catalog: docs/src/gui/ngcgui.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = NGCGUI
fr: = L'utilitaire graphique NGCGUI

source: image::images/ngcgui.png[]
fr: image::images/ngcgui_fr.png[]

source: == Overview
fr: == Vue d'ensemble

source: 'NGCGUI' is a tcl application for using LinuxCNC subroutines.
fr: 'NGCGUI' est un utilitaire écrit en TCL, pour utiliser les sous-programmes de LinuxCNC.

source: * 'NGCGUI' can run as a standalone application or can be embedded in multiple tab pages in the axis gui * 'PYNGCGUI' is an alternate, python implementation of ngcgui. * 'PYNGCGUI' can run as a standalone application or can be embedded as a tab page (with its own set of multiple subroutine tabs) in any gui that supports embedding of gladevcp applications. Example guis include: axis, touchy, gscreen and gmoccapy
fr: * 'NGCGUI' peut être lancé comme une application autonome ou embarqué dans des pages multi-onglets dans l'interface graphique Axis * 'PYNGCGUI' est une alternative de Ngcgui, implémentée en Python. * 'PYNGCGUI' peut également être une application autonome ou embarquée dans une page à onglets (avec ses propres et multiples jeux de sous programmes) dans ses onglets, dans n'importe quelle interface graphique supportant l'intégration des applications Gladevcp. Par exemple, sont incluse: axis, touchy, gscreen et gmoccapy

source: Using NGCGUI or PYNGCGUI:
fr: Utilisation de NGCGUI ou PYNGCGUI:

source: Tab pages are provided for subroutines specified in the INI file
fr: Les pages d'onglets sont fournies pour les sous-programmes spécifiés dans le fichier ini.

source: New subroutines tab pages can be added using Custom tab pages
fr: De nouvelles pages à onglets peuvent être ajoutées à l'aide des onglets personnalisés.

source: Each subroutine tab page provides entry boxes for all subroutine parameters
fr: Chaque page d'onglets de sous-programme fournit des boîtes de saisie pour tous les paramètres de sous-programme.

source: The entry boxes can have a default value and an label that are identified by special comments in the subroutine file
fr: Les boîtes de saisie peuvent avoir une valeur par défaut et une étiquette, qui sont identifiées par des commentaires spéciaux, dans le fichier de sous-programme.

source: Subroutine invocations are concatenated together to form a multiple step program
fr: Les invocations de sous-programmes sont concaténés pour former un programme multi-étapes.

source: Any single-file gcode subroutine that conforms to ngcgui conventions can be used
fr: Tout sous-programme G-code qui est conforme aux conventions ngcgui peut être utilisé.

source: Any gcmc (Gcode-meta-compiler) program that conforms to ngcgui conventions for tagging variables can be used. (The gcmc executable must be installed separately, see: http://www.vagrearg.org/content/gcmc)
fr: Tout programme GCMC (GCode-méta-compilateur) qui est conforme aux conventions ngcgui pour le marquage variables, peut être utilisé.

source: [NOTE] NGCGUI and PYNGCGUI implement the same functions and both process .ngc and .gcmc files that conform to a few ngcgui-specific conventions. In this document, the tern NGCGUI generally refers to either application.
fr: [NOTE] NGCGUI et PYNGCGUI implémentent les mêmes fonctions et les deux processus, les fichier .ngc et les fichiers .gcmc, conformes aux quelques conventions spécifiques ngcgui. Dans le présent document, le terme se réfère généralement à NGCGUI soit l'application.

source: == Demonstration Configurations
fr: == Démonstration et configurations

source: A number of demonstration configurations are located in the sim directory of the Sample Configurations offered by the LinuxCNC configuration picker. The configuration picker is on the system's main menu:
fr: Un bon nombre de configurations de démonstration sont disponibles dans le répertoire sim, parmi les configurations offertes par le sélecteur de configuration de LinuxCNC. Le sélecteur de configuration se trouve dans le menu principal du système, sous:

source: Examples are included for the axis, touchy, gscreen, and gmoccapy guis. These examples demonstrate both 3-axis (XYZ) cartesian configurations (like mills) and lathe (XZ) setups. Some examples show the use of a popupkeyboard for touch screen systems and other examples demonstrate the use of files created for the gcmc (Gcode Meta Compiler) application. The touchy examples also demonstrate incorporation of a gladevcp backplot viewer (gremlin_view).
fr: Des exemples sont inclus pour les interfaces graphiques axis, touchy, gscreen et gmoccapy. Ces exemples montrent des configurations pour machine 3 axes (XYZ cartésiens, telles que fraiseuses) ou les tours (XZ). Certains exemples montrent l'utilisation de claviers surgissants pour systèmes à écran tactile, d'autres exemples montrent l'utilisation de fichiers créés par l'application gcmc ( Gcode Meta Compiler). Les exemples touchy montrent également l'intégration du parcours d'outil gladevcp (gremlin_view).

source: The simplest application is found as:
fr: Les applications simples sont dans:

source: A comprehensive example showing gcmc compatibility is at:
fr: Un exemple compréhensible montrant la compatibilité avec gcmc:

source: A comprehensive example embedded as a gladevcp app and using gcmc is at:
fr: Un exemple compréhensible, intégré dans une application gladevcp et utilisant gcmc:

source: The example sim configurations make use of library files that provide example gcode subroutine (.ngc) files and Gcode-meta-compiler (.gcmc) files:
fr: Les exemples de configurations en sim, fournissent une bibliothèque d'exemples de sous-programme G-code (.ngc) et issus du méta-compilateur-Gcode (.gcmc):

source: * 'nc_files/ngcgui_lib' ** 'arc1.ngc' - basic arc using cutter radius compensation ** 'arc2.ngc' - arc speced by center, offset, width, angle (calls arc1) ** 'backlash.ngc' - routine to measure an axis backlash with dial indicator ** 'db25.ngc' - creates a DB25 plug cutout ** 'gosper.ngc' - a recursion demo (flowsnake) ** 'helix.ngc' - helix or D-hole cutting ** 'helix_rtheta.ngc' - helix or D-hole positioned by radius and angle ** 'hole_circle.ngc' - equally spaced holes on a circle ** 'ihex.ngc' - internal hexagon ** 'iquad.ngc' - internal quadrilateral ** 'ohex.ngc' - outside hexagon ** 'oquad.ngc' - outside quadrilateral ** 'qpex_mm.ngc' - demo of qpockets (mm based) ** 'qpex.ngc' - demo of qpockets (inch based) ** 'qpocket.ngc' - quadrilateral pocket ** 'rectangle_probe.ngc' - probe a rectangular area ** 'simp.ngc' - a simple subroutine example that creates two circles ** 'slot.ngc' - slot from connecting two endpoints ** 'xyz.ngc' - machine exerciser constrained to a box shape
fr: * 'nc_files/ngcgui_lib' ** 'arc1.ngc' - arc simple utilisant la compensation de rayon d'outil ** 'arc2.ngc' - arc par le centre, offset, largeur, angle (appel arc1) ** 'backlash.ngc' - routine pour mesurer le jeu d'un axe (backlash) avec un micromètre ** 'db25.ngc' - crée une découpe de prise DB25 ** 'gosper.ngc' - une démo récursive (flocon de neige) ** 'helix.ngc' - découpe une hélice ou un D-hole ** 'helix_rtheta.ngc' - hélice ou D-hole positionné par rayon et angle ** 'hole_circle.ngc' - trous espacés régulièrement sur un cercle ** 'ihex.ngc' - hexagone interne ** 'iquad.ngc' - quadrilatère interne ** 'ohex.ngc' - hexagone externe ** 'oquad.ngc' - quadrilatère externe ** 'qpex_mm.ngc' - démo de poches en mm ** 'qpex.ngc' - démo de poches en pouce ** 'qpocket.ngc' - poche quadrilatère ** 'rectangle_probe.ngc' - palpation d'une zone rectangulaire ** 'simp.ngc' - un simple sous-programme pour créer deux cercles ** 'slot.ngc' - rainure entre deux points ** 'xyz.ngc' - machine exerciseur à une forme de boîte

source: * 'nc_files/ngcgui_lib/lathe' ** 'g76base.ngc' - gui for g76 threading ** 'g76diam.ngc' - threading speced by major, minor diameters ** 'id.ngc' - bores the inside diameter ** 'od.ngc' - turns the outside diameter ** 'taper-od.ngc' - turns a taper on the outside diameter
fr: * 'nc_files/ngcgui_lib/lathe' ** 'g76base.ngc' - gui pour filetage avec G76 ** 'g76diam.ngc' - filetage avec diamètres majeur et mineur ** 'id.ngc' - alésage d'un diamètre intérieur ** 'od.ngc' - tournage d'un diamètre extérieur ** 'taper-od.ngc' - tournage d'un filetage sur diamètre extérieur

source: * 'nc_files/gcmc_lib' ** 'drill.gcmc' - drill holes in rectangle pattern ** 'square.gcmc' - simple demo of variable tags for gcmc files ** 'star.gcmc' - gcmc demo illustrating functions and arrays ** 'wheels.gcmc' - gcmc demo of complex patterns
fr: * 'nc_files/gcmc_lib' ** 'drill.gcmc' - perçages d'une forme rectangulaire ** 'square.gcmc' - simple démo de tags de variable de fichiers gcmc ** 'star.gcmc' - démo gcmc illustrant les fonctions et les tableaux ** 'wheels.gcmc' - démo gcmc pour des formes complexes

source: To try a demonstration, select a sim configuration and start the linuxCNC program.
fr: Pour essayer une démonstration, sélectionner une configuration sim et démarrer le programme linuxCNC.

source: If using the axis gui, press the 'E-Stop' image:images/tool_estop.gif[] then 'Machine Power' image:images/tool_power.gif[] then 'Home All'. Pick a ngcgui tab, fill in any empty blanks with sensible values and press 'Create Feature' then 'Finalize'. Finally press the 'Run' image:images/tool_run.gif[] button to watch it run. Experiment by creating multiple features and features from different tab pages.
fr: Si Axis est utilisé, presser 'l'Arrêt d'urgence' image:images/tool_estop.gif[] puis 'Marche machine' image:images/tool_power.gif[] puis 'POM de tous les axes'. Choisir un onglet ngcgui, remplir les espaces vides avec des valeurs et presser 'Créer Feature' puis 'Finaliser'. Finalement, presser le bouton 'Run' image:images/tool_run.gif[] pour voir le résultat. Expérimenter en créant de multiples fonctionnalités et caractéristiques depuis les différentes pages d'onglets.

source: Other guis will have similar functionality but the buttons and names may be different.
fr: Les autres GUI devront fonctionner de manière similaire, mais les boutons et les noms peuvent être différents.

source: .Notes [NOTE] ===============================
fr: [NOTE] ===============================

source: The demonstration configs create tab pages for just a few of the provided examples. Any gui with a Custom tab page can open any of the library example subroutines or any user file if it is in the linuxCNC subroutine path.
fr: Les configs de démonstration créent des pages d'onglets pour quelques-uns des exemples fournis. Toute GUI avec une page d'onglets personnalisés peut ouvrir n'importe quel exemple de sous-programme de la bibliothèque, ou n'importe quel fichier utilisateur si il est dans le chemin des sous-programmes de LinuxCNC.

source: To see special key bindings, click inside an ngcgui tab page to get focus and then presss Control-k.
fr: Pour voir les raccourcis clavier spéciaux, cliquer à l'intérieur d'une page d'onglet ngcgui pour avoir le focus, puis Presser Control-k.

source: The demonstration subroutines should run on the simulated machine configurations included in the distribution. A user should always understand the behavior and purpose of a program before running on a real machine. ===============================
fr: Les sous-programmes de démonstration doivent se lancer avec une configuration en mode simulation incluse dans la distribution. L'utilisateur doit comprendre le comportement et le but d'un programme avant de le lancer sur une machine réelle. ===============================

source: == Library Locations
fr: == Emplacement des librairies

source: In linuxCNC installations installed from deb packages, the simulation configs for ngcgui use symbolic links to non-user-writable LinuxCNC libraries for:
fr: Dans les installations LinuxCNC installées à partir de paquets deb, les configs de simulation pour ngcgui utilisent des liens symboliques vers des librairies LinuxCNC protégées en écriture pour l'utilisateur:

source: * 'nc_files/ngcgui_lib' ngcgui-compatible subfiles * 'nc_files/ngcgui_lib/lathe' ngcgui-compatible lathe subfiles * 'nc_files/gcmc_lib' ngcgui-gcmc-compatible programs * 'nc_files/ngcgui_lib/utilitysubs' Helper subroutines * 'nc_files/ngcgui_lib/mfiles' User M files
fr: * 'nc_files/ngcgui_lib' sous-programmes ngcgui-compatibles * 'nc_files/ngcgui_lib/lathe' sous-programmes de tournage ngcgui-compatibles * 'nc_files/gcmc_lib' programmes ngcgui-gcmc-compatibles * 'nc_files/ngcgui_lib/utilitysubs' Assistant de sous-programmes * 'nc_files/ngcgui_lib/mfiles' M-files utilisateur

source: These libraries are located by ini file items that specify the search paths used by linuxCNC (and ngcgui):
fr: Ces librairies sont localisées par des éléments du fichier ini, spécifiant les chemins de recherche utilisés par LinuxCNC (et ngcgui):

source: [NOTE] These are long lines (not continued on multiple lines) that specify the directories used in a search patch. The directory names are separated by colons (:). No spaces should occur between directory names.
fr: [NOTE] Ce sont de longues lignes (non découpées en multiples lignes) qui spécifient les répertoires utilisés dans le chemin de recherche. Les noms de répertoire sont séparés par deux points (:). Aucun espace ne doit être utilisé dans les noms de répertoire.

source: A user can create new directories for their own subroutines and M-files and add them to the search path(s).
fr: Un utilisateur peux créer de nouveaux répertoires pour ces propres sous-programmes et ses M-files et les ajouter dans le(s) chemin de recherche.

source: For example, a user could create directories from the terminal with the commands: ----
fr: Par exemple, un utilisateur peut créer des répertoires depuis la console avec les commandes: ----

source: And then create or copy system-provided files to these user-writable directories. For instance, a user might create a ngcgui-compatible subfile named:
fr: Et puis créer, ou copier des fichiers du système dans ces répertoires, dans lesquels il a les droits d'écriture. Par exemple, un utilisateur peut créer un sous-fichier ngcgui-compatible nomé:

source: To use files in new directories, the ini file must be edited to include the new subfiles and to augment the search path(s). For this example:
fr: Pour utiliser les fichiers de ces nouveaux répertoires, le fichier ini doit être édité pour inclure les nouveaux sous fichiers et pour augmenter le(s) chemin de recherche. Pour cet exemple:

source: [DISPLAY] ... NGCGUI_SUBFILE = example.ngc ... ----
fr: [DISPLAY] ... NGCGUI_SUBFILE = exemple.ngc ... ----

source: LinuxCNC (and ngcgui) use the first file found when searching directories in the search path. With this behavior, you can supersede an ngcgui_lib subfile by placing a subfile with an identical name in a directory that is found earlier in the path search. More information can be found in the INI chapter of the Integrators Manual.
fr: LinuxCNC (et ngcgui) utilisent le premier fichier trouvé quand ils cherchent dans les répertoires contenus dans le chemin de recherche. Avec ce comportement, il est possible de substituer un fichier ngcgui_lib en plaçant un fichier portant un nom identique dans un répertoire qui sera trouvé en premier dans le chemin de recherche. Plus d'informations se trouvent dans le chapitre sur le fichier ini du manuel de configuration.

source: == Standalone Usage === Standalone NGCGUI For usage, type in a terminal: ----
fr: == Utilisation autonome === NGCGUI en autonome Pour l'utiliser, taper dans un terminal: ----

source: Options: [-S subroutine_file] [-p preamble_file] [-P postamble_file] [-o output_file] [-a autosend_file] (autosend to axis default:auto.ngc) [--noauto] (no autosend to axis) [-N | --nom2] (no m2 terminator (use %)) [--font [big|small|fontspec]] (default: "Helvetica -10 normal") [--horiz|--vert] (default: --horiz) [--cwidth comment_width] (width of comment field) [--vwidth varname_width] (width of varname field) [--quiet] (fewer comments in outfile) [--noiframe] (default: frame displays image) ----
fr: Options: [-S subroutine_file] [-p preamble_file] [-P postamble_file] [-o output_file] [-a autosend_file] (envoi auto à Axis défaut:auto.ngc) [--noauto] (pas d'envoi auto à Axis) [-N | --nom2] (pas de terminateur M2 (utilise %)) [--font [big|small|fontspec]] (défaut: "Helvetica -10 normal") [--horiz|--vert] (défaut: --horiz) [--cwidth comment_width] (largeur du champ commentaire) [--vwidth varname_width] (largeur du champ de varname) [--quiet] (moins de commentaires de le fichier de sortie) [--noiframe] (défaut: trame d'affichages image) ----

source: [NOTE] As a standalone application, ngcgui handles a single subroutine file which can be invoked multiple times. Multiple standalone ngcgui applications can be started independently.
fr: [NOTE] En temps qu'application autonome, ngcgui gère un fichier de sous-programme unique, qui peut être invoqué plusieurs fois. Plusieurs applications de ngcgui autonomes, peuvent être démarrées indépendamment.

source: === Standalone PYNGCGUI For usage, type in a terminal: ----
fr: === PYNGCGUI en autonome Pour l'utiliser, taper dans un terminal: ----

source: pyngcgui --help Usage: pyngcgui [Options] [sub_filename] Options requiring values: [-d | --demo] [0|1|2] (0: DEMO standalone toplevel) (1: DEMO embed new notebook) (2: DEMO embed within existing notebook) [-S | --subfile sub_filename] [-p | --preamble preamble_filename] [-P | --postamble postamble_filename] [-i | --ini inifile_name] [-a | --autofile autoauto_filename] [-t | --test testno] [-H | --height height_of_entry widget] (typ 20-40) [-K | --keyboardfile glade_file] (use custom popupkeyboard glade file) Solo Options: [-v | --verbose] [-D | --debug] [-N | --nom2] (no m2 terminator (use %)) [-n | --noauto] (save but do not automatically send result) [-k | --keyboard] (use default popupkeybaord) [-s | --sendtoaxis] (send generated ngc file to axis gui) Notes: A set of files is comprised of a preamble, subfile, postamble. The preamble and postamble are optional. One set of files can be specified from cmdline. Multiple sets of files can be specified from an inifile. If --ini is NOT specified: search for a running linuxCNC and use it's inifile ----
fr: pyngcgui --help Usage: pyngcgui [Options] [sub_filename] Options requiring values: [-d | --demo] [0|1|2] (0: DEMO autonome toplevel) (1: DEMO intégré nouveau notebook) (2: DEMO intégré dans notebook existant) [-S | --subfile sub_filename] [-p | --preamble preambule_filename] [-P | --postamble postambule_filename] [-i | --ini inifile_name] [-a | --autofile autoauto_filename] [-t | --test testno] [-H | --height height_of_entry widget] (typ 20-40) [-K | --keyboardfile glade_file] (utilise fichier glage pour clavier surgissant) Solo Options: [-v | --verbose] [-D | --debug] [-N | --nom2] (pas de terminateur M2 (utilise %)) [-n | --noauto] (sauve mais n’envoie pas le résultat automatiquement) [-k | --keyboard] (utilise défaut clavier surgissant) [-s | --sendtoaxis] (envoie le ngc généré à Axis) Notes: Un jeu de fichiers est fournis pour les préambules, sous-fichiers, postambules. Les préambule et postambule sont optionnels. Un jeu de fichiers peut être spécifié depuis la ligne de commande. De multiples jeux de fichiers peuvent être spécifiés dans un fichier ini. Si --ini n'est PAS spécifié: cherche pour un LinuxCNC fonctionnant et utilise son fichier ini ----

source: [NOTE] As a standalone application, pyngcgui can read an ini file (or a running linuxCNC application) to create tab pages for multiple subfiles.
fr: [NOTE] En temps qu'application autonome, pyngcgui peut lire un fichier ini (ou une application linuxcnc en fonctionnement) pour créer des pages d'onglets pour plusieurs sous-fichiers.

source: == Embedding NGCGUI === Embedding NGCGUI in Axis The following INI file items go in the [DISPLAY] section. (See additional sections below for additional items needed)
fr: == Intégration de NGCGUI === L'intégration de NGCGUI dans Axis Les éléments du fichier ini suivants se trouve dans la section [DISPLAY]. (Voir plus loin pour les éléments additionnels nécessaires)

source: 'TKPKG = Ngcgui 1.0' - the NGCGUI package
fr: 'TKPKG = Ngcgui 1.0' - le paquet NGCGUI

source: * 'TKPKG = Ngcguittt 1.0' - the True Type Tracer package for generating text for engraving (optional, must follow TKPKG = Ngcgui). * 'TTT = truetype-tracer' - name of the truetype tracer program (it must be in user PATH) * 'TTT_PREAMBLE = in_std.ngc' - Optional, specifies filename for preamble used for ttt created subfiles. (alternate: mm_std.ngc)
fr: * 'TKPKG = Ngcguittt 1.0' - le paquet du traceur True Type pour générer du texte à graver (optionnel, doit suivre TKPKG = Ngcgui). * 'TTT = truetype-tracer' - nom du programme traceur truetype (il doit être dans le PATH utilisateur) * 'TTT_PREAMBLE = in_std.ngc' - Optionnel, spécifie nom de fichier pour le préambule utilisé pour créer les sous-fichiers ttt. (alternativement: mm_std.ngc)

source: [NOTE] The optional truetype tracer items are used to specify an ngcgui-compatible tab page that uses the application truetype-tracer. The truetype-tracer application must be installed independently and located in the user PATH.
fr: [NOTE] Les éléments optionnels du traceur TrueType, sont utilisés pour spécifier une page d'onglet, compatible avec ngcgui qui utilise l'application traceur TrueType. L'application traceur TrueType doit être installée de manière indépendante et située dans le PATH de l'utilisateur.

source: === Embedding PYNGCGUI as a gladevcp tab page in a gui The following INI file items go in the [DISPLAY] section for use with the axis, gscreen, or touchy guis. (See additional sections below for additional items needed)
fr: === Intégration de PYNGCGUI comme page d'onglet gladevcp dans une GUI Les éléments suivants du fichier ini se trouve dans la section [DISPLAY], pour être utilisés avec les GUI axis, gscreen, ou touchy. (Voir plus loin pour les éléments additionnels nécessaires)

source: .EMBED_ Items .... EMBED_TAB_NAME = Pyngcgui - name to appear on embedded tab EMBED_TAB_COMMAND = gladevcp -x {XID} pyngcgui_axis.ui - invokes gladevcp EMBED_TAB_LOCATION = name_of_location - where the embeded page is located ....
fr: .EMBED_ Items .... EMBED_TAB_NAME = Pyngcgui - nom qui doit apparaître dans l'onglet EMBED_TAB_COMMAND = gladevcp -x {XID} pyngcgui_axis.ui - invoque gladevcp EMBED_TAB_LOCATION = name_of_location - où la page intégrée est située ....

source: [NOTE] The EMBED_TAB_LOCATION specifier is not used for the axis gui. While pyngcgui can be embedded in axis, integration is more complete when using ngcgui (using TKPKG = Ngcgui 1.0). To specify the EMBED_TAB_LOCATION for other guis, see the example ini files.
fr: [NOTE] Le spécificateur EMBED_TAB_LOCATION n'est pas utilisé pour la GUI Axis. Alors que pyngcgui, lui peut être intégré dans Axis, l'intégration est plus complète avec l'usage de ngcgui (utilisant TKPKG = Ngcgui 1.0). Pour spécifier EMBED_TAB_LOCATION pour les autres GUI, voir les exemples de fichiers ini.

source: [NOTE] The truetype tracer gui front-end is not currently available for gladevcp applications.
fr: [NOTE] Le frontal GUI du traceur truetype n'est pas encore disponible pour les applications gladevcp

source: === Additional INI File items required for ngcgui or pyngcgui The following INI file items go in the [DISPLAY] section for any gui that embeds either ngcgui or pyngcgui.
fr: === Éléments additionnels du fichier ini requis par ngcgui ou pyngcgui Les éléments de fichier ini suivants, se trouvent dans dans la section [DISPLAY], pour toute GUI intégrant ngcgui ou pyngcgui.

source: 'NGCGUI_FONT = Helvetica -12 normal' - specifices the font name,size, normal|bold
fr: 'NGCGUI_FONT = Helvetica -12 normal' - spécifie le nom de la police, sa taille, normal|gras
