Repository: 0000duck/linuxcnc
Catalog: docs/src/gui/ngcgui.*.po
Languages: fr

source: * 'NGCGUI_PREAMBLE = in_std.ngc' - the preamble file to be added in front of the subroutines. When concatenating several common subroutine invocations, this preamble is only added once. For mm-based machines, use mm_std.ngc * 'NGCGUI_SUBFILE = filename1.ngc' - creates a tab from the filename1 subroutine * 'NGCGUI_SUBFILE = filename2.ngc' - creates a tab from the filename2 subroutine * '... etc' * 'NGCGUI_SUBFILE = gcmcname1.gcmc' - creates a tab from the gcmcname1 file * 'NGCGUI_SUBFILE = gcmcname2.gcmc' - creates a tab from the gcmcname2 file * '... etc' * 'NGCGUI_SUBFILE = ""' - creates a custom tab that can open any subroutine in the search path * 'NGCGUI_OPTIONS = opt1 opt2 ...' - NGCGUI options ** 'nonew' - disallow making a new custom tab ** 'noremove' - disallow removing any tab page ** 'noauto' - no autosend (use makeFile, then save or manually send) ** 'noiframe' - no internal image, display images on separate top level widget ** 'nom2' - do not terminate with m2, use % terminator. This option eliminates all the side effects of m2 termination * 'GCMC_INCLUDE_PATH = dirname1:dirname2' - search directories for gcmc include files
fr: * 'NGCGUI_PREAMBLE = in_std.ngc' - le fichier de préambule ajouté devant le sous-programme. Quand plusieurs invocations de sous-programmes sont concaténées, le préambule est seulement ajouté une fois. Pour les machines en métrique, utiliser mm_std.ngc * 'NGCGUI_SUBFILE = filename1.ngc' - crée un onglet depuis le sous-programme filename1 * 'NGCGUI_SUBFILE = filename2.ngc' - crée un onglet depuis le sous-programme filename2 * '... etc' * 'NGCGUI_SUBFILE = gcmcname1.gcmc' - crée un onglet depuis le fichier gcmcname1 * 'NGCGUI_SUBFILE = gcmcname2.gcmc' - crée un onglet depuis le fichier gcmcname2 * '... etc' * 'NGCGUI_SUBFILE = ""' - crée un onglet personnalisé pouvant ouvrir tout sous-programme présent dans le chemin de recherche * 'NGCGUI_OPTIONS = opt1 opt2 ...' - options NGCGUI ** 'nonew' - désactive la possibilité de faire un nouvel onglet personnalisé ** 'noremove' - désactive la suppression de page d'onglets ** 'noauto' - pas d'envoi auto (utiliser makefile, puis sauver ou envoyer manuellement) ** 'noiframe' - pas d'image interne, affiche les images sur un autre niveau de widget séparé ** 'nom2' - ne se termine pas avec m2 mais utilise le terminateur %. Cette option élimine tous les effets de bord du terminateur m2 * 'GCMC_INCLUDE_PATH = dirname1:dirname2' - répertoire de recherche de fichiers include pour gcmc

source: This is an example of embedding NGCGUI into Axis. The subroutines need to be in a directory specified by the [RS274NGC]SUBROUTINE_PATH. Some example subroutines use other subroutines so check to be sure you have the dependences, if any, in a SUBROUTINE_PATH directory. Some subroutines may use custom Mfiles which must be in a directory specified by the [RS274NGC]USER_M_PATH.
fr: C'est un exemple d'intégration de NGCGUI dans Axis. Les sous-programmes doivent être dans un répertoire défini par RS274NGC]SUBROUTINE_PATH. Certains exemples de sous-programmes utilisent d'autres sous-programmes, bien vérifier les dépendances, le cas échéant, dans un répertoire de SUBROUTINE_PATH. Certains sous-programmes peuvent utiliser des M-files qui doivent être dans un répertoire défini par le [RS274NGC]USER_M_PATH.

source: The Gcode-meta-compiler (gcmc) can include statements like: include("filename.inc.gcmc"); By default, gcmc includes the current directory which, for linuxCNC, will be the directory containing the linuxCNC ini file. Additional directories can be prepended to the gcmc search order with the GCMC_INCLUDE_PATH item.
fr: Le méta-compilateur de Gcode (gcmc) peut inclure des déclarations telles que: include("filename.inc.gcmc"); Par défaut, gcmc inclut le répertoire courant qui, pour LinuxCNC, sera le répertoire contenant le fichier ini de LinuxCNC. Des répertoires additionnels peuvent être préfixés à la commande de recherche de gcmc avec l'élément GCMC_INCLUDE_PATH.

source: .Sample axis-gui-based INI ----
fr: .échantillon d'ini basé sur Axis ----

source: [DISPLAY] TKPKG = Ngcgui 1.0 TKPKG = Ngcguittt 1.0 # Ngcgui must precede Ngcguittt
fr: [DISPLAY] TKPKG = Ngcgui 1.0 TKPKG = Ngcguittt 1.0 # Ngcgui doit précéder Ngcguittt

source: NGCGUI_FONT = Helvetica -12 normal # specify filenames only, files must be in [RS274NGC]SUBROUTINE_PATH NGCGUI_PREAMBLE = in_std.ngc NGCGUI_SUBFILE = simp.ngc NGCGUI_SUBFILE = xyz.ngc NGCGUI_SUBFILE = iquad.ngc NGCGUI_SUBFILE = db25.ngc NGCGUI_SUBFILE = ihex.ngc NGCGUI_SUBFILE = gosper.ngc # specify "" for a custom tab page NGCGUI_SUBFILE = "" #NGCGUI_SUBFILE = "" use when image frame is specified if # opening other files is required # images will be put in a top level window NGCGUI_OPTIONS = #NGCGUI_OPTIONS = opt1 opt2 ... # opt items: # nonew -- disallow making a new custom tab # noremove -- disallow removing any tab page # noauto -- no auto send (makeFile, then manually send) # noiframe -- no internal image, image on separate top level GCMC_INCLUDE_PATH = /home/myname/gcmc_includes
fr: NGCGUI_FONT = Helvetica -12 normal # spécifie noms de fichiers seulement, doivent être dans [RS274NGC]SUBROUTINE_PATH NGCGUI_PREAMBLE = in_std.ngc NGCGUI_SUBFILE = simp.ngc NGCGUI_SUBFILE = xyz.ngc NGCGUI_SUBFILE = iquad.ngc NGCGUI_SUBFILE = db25.ngc NGCGUI_SUBFILE = ihex.ngc NGCGUI_SUBFILE = gosper.ngc # specify "" for a custom tab page NGCGUI_SUBFILE = "" #NGCGUI_SUBFILE = "" utilisé quand une trame d'image est spécifiée si # l'ouverture d'autres fichiers est requise # les images seront mise à un niveau de fenêtre supérieur NGCGUI_OPTIONS = #NGCGUI_OPTIONS = opt1 opt2 ... # opt items: # nonew -- désactive la possibilité de faire un nouvel onglet personnalisé # noremove -- désactive la suppression de page d'onglets # noauto -- pas d'envoi auto (utiliser makefile, puis sauver ou envoyer manuellement) # noiframe -- pas d'image interne, affiche les images sur un autre niveau séparé GCMC_INCLUDE_PATH = /home/myname/gcmc_includes

source: [NOTE] The above is not a complete axis gui INI -- the items show are those used by ngcgui. Many additional items are required by LinuxCNC to have a complete INI file.
fr: [NOTE] Le petit ini ci-dessus, n'est pas un ini complet pour Axis, les éléments affichés sont ceux utilisés par ngcgui. Beaucoup d'autres éléments sont requis par LinuxCNC pour d'avoir un fichier INI complet.

source: === Truetype Tracer
fr: === Traceur Truetype

source: Ngcgui_ttt provides support for truetype-tracer (v4). It creates an axis tab page which allows a user to create a new ngcgui tab page after entering text and selecting a font and other parameters. (Truetype-tracer must be installed independently).
fr: Ngcgui_ttt fournit un support pour TrueType-traceur (v4). Il crée une page à onglets dans Axis, qui permet l'utilisateur de créer une nouvelle page à onglet ngcgui, après la saisie de texte et en sélectionnant une police et d'autres paramètres. (TrueType-traceur doit être installé indépendamment).

source: To embed ngcgui_ttt in axis, specify the following items in addition to ngcgui items: .... Item: [DISPLAY]TKPKG = Ngcgui_ttt version_number Example: [DISPLAY]TKPKG = Ngcgui_ttt 1.0 Note: Mandatory, specifies loading of ngcgui_ttt in an axis tab page named ttt. Must follow the TKPKG = Ngcgui item.
fr: Pour intégrer ngcgui_ttt dans Axis, spécifier les éléments suivants en plus de ceux de ngcgui: .... Élément: [DISPLAY]TKPKG = Ngcgui_ttt version_number Exemple: [DISPLAY]TKPKG = Ngcgui_ttt 1.0 Remarque: Spécifier obligatoirement, le chargement de ngcgui_ttt dans la page à onglet d'Axis nommée ttt. Doit suivre l'élément TKPKG = Ngcgui.

source: Item: [DISPLAY]TTT = path_to_truetype-tracer Example: [DISPLAY]TTT = truetype-tracer Note: Optional, if not specified, attempt to use /usr/local/bin/truetype-tracer. Specify with absolute pathname or as a simple executable name in which case the user PATH environment will used to find the program.
fr: Élément: [DISPLAY]TTT = path_to_truetype-tracer Exemple: [DISPLAY]TTT = truetype-tracer Remarque: En option, si non spécifié, tentera d'utiliser /usr/local/bin/truetype-tracer. Spécifier un chemin absolu ou un nom simple d'exécutable dans ce cas, la variable utilisateur PATH sera utilisée pour trouver le programme.

source: Item: [DISPLAY]TTT_PREAMBLE = preamble_filename Example: [DISPLAY]TTT_PREAMBLE = in_std.ngc Note: Optional, specifies filename for preamble used for ttt created subfiles. ....
fr: Élément: [DISPLAY]TTT_PREAMBLE = préambule_filename Exemple: [DISPLAY]TTT_PREAMBLE = in_std.ngc Remarque: Facultatif, spécifie le nom du préambule ttt, utilisé pour créer les sous-fichiers. ....

source: === INI File Path Specifications
fr: === Spécifications du chemin du fichier ini

source: Ngcgui uses the linuxCNC search path to find files.
fr: Ngcgui utilise le chemin de recherche de LinuxCNC pour trouver les fichiers.

source: The search path begins with the standard directory specified by:
fr: Le chemin de recherche commence par le répertoire standard spécifié par:

source: [DISPLAY]PROGRAM_PREFIX = directory_name
fr: [DISPLAY]PROGRAM_PREFIX = nom_repertoire

source: followed by multiple directories specfied by:
fr: suivi par plusieurs répertoires spécifiés par:

source: [RS274NGC]SUBROUTINE_PATH = directory1_name:directory1_name:directory3_name ...
fr: [RS274NGC]SUBROUTINE_PATH = nom_repertoire1:nom_repertoire2:nom_repertoire3 ...

source: Directories may be specifed as absolute paths or relative paths. .... Example: [DISPLAY]PROGRAM_PREFIX = /home/myname/linuxcnc/nc_files Example: [DISPLAY]PROGRAM_PREFIX = ~/linuxcnc/nc_files Example: [DISPLAY]PROGRAM_PREFIX = ../../nc_files ....
fr: Les répertoires peuvent être spécifiés par des chemins absolus ou relatifs. .... Exemple 1: [DISPLAY]PROGRAM_PREFIX = /home/myname/linuxcnc/nc_files Exemple 2: [DISPLAY]PROGRAM_PREFIX = ~/linuxcnc/nc_files Exemple 3: [DISPLAY]PROGRAM_PREFIX = ../../nc_files ....

source: An absolute path beginning with a "/" specifies a complete filesystem location. A path beginning with a "\~/" specifies a path starting from the user's home directory. A path beginning with "~username/" specifies a path starting in username's home directory.
fr: Un chemin absolu commence avec un / qui indique un emplacement par rapport au système de fichiers complet. Un chemin qui commence par ~/ indique un chemin commençant 'depuis' le répertoire home de l'utilisateur. Un chemin qui commence par ~nomutilisateur indique un chemin commençant 'dans' le répertoire utilisateur.

source: .Relative Paths Relative paths are based on the startup directory which is the directory containing the INI file. Using relative paths can facilitate relocation of configurations but requires a good understanding of linux path specifiers.
fr: .Chemins relatifs Un chemin relatif commence dans le répertoire de démarrage qui est celui contenant le fichier ini. L'usage des chemins relatifs facilite l'accès aux configurations mais requiert une bonne compréhension de la façon dont les chemins sont spécifiés sous Linux.

source: .... ./d0 is the same as d0, e.g., a directory named d0 in the startup directory ../d1 refers to a directory d1 in the parent directory ../../d2 refers to a directory d2 in the parent of the parent directory ../../../d3 etc. ....
fr: .... ./d0 le même que d0, ex: un répertoire nommé d0 dans le répertoire de démarrage ../d1 se réfère au répertoire d1 dans le répertoire parent ../../d2 se réfère au répertoire d2 dans le parent du répertoire parent ../../../d3 etc. ....

source: Multiple directories can be specified with [RS274NGC]SUBROUTINE_PATH by separating them with colons. The following example illustrates the format for multiple directories and shows the use of relative and absolute paths.
fr: Plusieurs répertoires peuvent être spécifiés avec [RS274NGC] SUBROUTINE_PATH en les séparant par deux points. L'exemple suivant illustre le format de plusieurs répertoires et montre l'utilisation de chemins relatifs et absolus.

source: .Multiple Directories Example: ----
fr: .Exemple avec plusieurs répertoires: ----

source: This is one long line, do not continue on multiple lines. When linuxCNC and/or ngcgui searches for files, the first file found in the search is used.
fr: C'est une longue ligne, ne pas la couper en plusieurs lignes. Lorsque LinuxCNC et/ou ngcgui recherchent des fichiers, le premier fichier trouvé dans la recherche est utilisé.

source: LinuxCNC (and ngcgui) must be able to find all subroutines including helper routines that are called from within ngcgui subfiles. It is convenient to place utility subs in a separate directory as indicated in the example above.
fr: LinuxCNC (et ngcgui) doivent être en mesure de trouver tous les sous-programmes, dont les routines d'assistance qui sont appelées depuis les sous-fichiers de ngcgui. Il est commode de placer les sous-programmes utilitaires dans un répertoire séparé comme indiqué dans l'exemple ci-dessus.

source: The distribution includes the ngcgui_lib directory and demo files for preambles, subfiles, postambles and helper files. To modify the behavior of the files, you can copy any file and place it in an earlier part of the search path. The first directory searched is [DISPLAY]PROGRAM_PREFIX. You can use this directory but it is better practice to create dedicated directory(ies) and put them at the beginning of the [RS274NGC]SUBROUTINE_PATH.
fr: La distribution comprend le répertoire de ngcgui_lib et des fichiers de démonstration pour préambules, sous-fichiers, postambules et fichiers d'aide. Pour modifier le comportement des fichiers, copier n'importe quel fichier et le placer dans une première partie du chemin de recherche. Le premier répertoire recherché est [DISPLAY] PROGRAM_PREFIX. Il est possible d'utiliser ce répertoire mais il est préférable d'en créer d'autres, dédiés et de les mettre au début de la section [RS274NGC] SUBROUTINE_PATH.

source: In the following example, files in /home/myname/linuxcnc/mysubs will be found before files in ../../nc_files/ngcgui_lib.
fr: Dans l'exemple suivant, les fichiers dans /home/myname/linuxcnc/mysubs seront trouvés avant les fichiers dans ../../nc_files/ngcgui_lib.

source: .Adding User Directory Example: ----
fr: .Exemple d'ajout d'un répertoire personnalisé: ----

source: New users may inadvertently try to use files that are not structured to be compatible with ngcgui requirements. Ngcgui will likely report numerous errors if the files are not coded per its conventions. Good practice suggests that ngcgui-compatible subfiles should be placed in a directory dedicated to that purpose and that preamble, postamble, and helper files should be in separate directory(ies) to discourage attempts to use them as subfiles. Files not intended for use as subfiles can include a special comment: "(not_a_subfile)" so that ngcgui will reject them automatically with a relevant message.
fr: Les nouveaux utilisateurs peuvent essayer d'utiliser, par inadvertance, des fichiers qui ne sont pas structurés de manière à être compatible avec les exigences de ngcgui. Ngcgui signalera probablement de nombreuses erreurs si les fichiers ne sont pas codés selon ses conventions. Une bonne pratique suggère que les sous-fichiers compatibles avec ngcgui, soient placés dans un répertoire dédié à cet effet et que les préambules, postambules et fichiers d'aide soient dans un répertoire séparé, pour décourager les tentatives de les utiliser comme sous-fichiers. Les fichiers non destinés à être utilisés comme sous-fichiers, peuvent inclure un commentaire particulier: "(not_a_subfile) " pour que ngcgui les rejette automatiquement avec un message pertinent.

source: === Summary of INI File item details for NGCGUI usage .... Item: [RS274NGC]SUBROUTINE_PATH = dirname1:dirname2:dirname3 ... Example: [RS274NGC]SUBROUTINE_PATH = ../../nc_files/ngcgui_lib:../../nc_files/ngcgui_lib/utilitysubs Note: Optional, but very useful to organize subfiles and utility files
fr: === Résumé en détail des éléments de fichier ini utilisés par NGCGUI .... Élément: [RS274NGC]SUBROUTINE_PATH = dirname1:dirname2:dirname3 ... Exemple: [RS274NGC]SUBROUTINE_PATH = ../../nc_files/ngcgui_lib:../../nc_files/ngcgui_lib/utilitysubs Remarque: Facultatif, mais très utile pour organiser les sous-fichiers et les fichiers utilitaires

source: Item: [RS274NGC]USER_M_PATH = dirname1:dirname2:dirname3 ... Example: [RS274NGC]USER_M_PATH = ../../nc_files/ngcgui_lib/mfiles Note: Optional, needed to locate custom user mfiles
fr: Élément: [RS274NGC]USER_M_PATH = dirname1:dirname2:dirname3 ... Exemple: [RS274NGC]USER_M_PATH = ../../nc_files/ngcgui_lib/mfiles Remarque: Optionnel, requis pour localiser les M-files personnalisées

source: Item: [DISPLAY]EMBED_TAB_NAME = name to display on embedded tab page Example: [DISPLAY]EMBED_TAB_NAME = Pyngcgui Note: The entries: EMBED_TAB_NAME,EMBED_TAB_COMMAND,EMBED_TAB_LOCATION define an embedded application for several linuxCNC guis
fr: Élément: [DISPLAY]EMBED_TAB_NAME = nom à afficher sur la page d'onglets intégrée Exemple: [DISPLAY]EMBED_TAB_NAME = Pyngcgui Remarque: Les entrées: EMBED_TAB_NAME, EMBED_TAB_COMMAND et EMBED_TAB_LOCATION définissent une application intégrée pour plusieurs interfaces LinuxCNC

source: Item: [DISPLAY]EMBED_TAB_COMMAND = programname followed by arguments Example: [DISPLAY]EMBED_TAB_COMMAND = gladevcp -x {XID} pyngcgui_axis.ui Note: For gladevcp applications, see the man page for gladevcp
fr: Élément: [DISPLAY]EMBED_TAB_COMMAND = nom programme suivi par arguments Exemple: [DISPLAY]EMBED_TAB_COMMAND = gladevcp -x {XID} pyngcgui_axis.ui Remarque: Pour les applications GladeVCP, voir la page du manuel de gladevcp

source: Item: [DISPLAY]EMBED_TAB_LOCATION = name_of_location Example: [DISPLAY]EMBED_TAB_LOCATION = notebook_main Note: See example INI files for possible locations Not required for the axis gui
fr: Élément: [DISPLAY]EMBED_TAB_LOCATION = name_of_location Exemple: [DISPLAY]EMBED_TAB_LOCATION = notebook_main Remarque: Voir exemple de fichiers INI, pour les emplacements possibles Non requis pour Axis

source: Item: [DISPLAY]PROGRAM_PREFIX = dirname Example: [DISPLAY]PROGRAM_PREFIX = ../../nc_files Note: Mandatory and needed for numerous linuxCNC functions It is the first directory used in the search for files
fr: Élément: [DISPLAY]PROGRAM_PREFIX = dirname Exemple: [DISPLAY]PROGRAM_PREFIX = ../../nc_files Remarque: Obligatoire et nécessaire pour de nombreuses fonctions de LinuxCNC C'est le premier répertoire utilisé dans la recherche de fichiers

source: item: [DISPLAY]TKPKG = Ngcgui version_number Example: [DISPLAY]TKPKG = Ngcgui 1.0 Note: Required only for axis gui embedding, specifies loading of ngcgui axis tab pages
fr: Élément: [DISPLAY]TKPKG = Ngcgui version_number Exemple: [DISPLAY]TKPKG = Ngcgui 1.0 Remarque: Nécessaire uniquement pour l'intégration dans Axis, défini le chargement des pages d'onglet ngcgui dans Axis

source: Item: [DISPLAY]NGCGUI_FONT = font_descriptor Example: [DISPLAY]NGCGUI_FONT = Helvetica -12 normal Note: Optional, font_descriptor is a tcl-compatible font specifier with items for fonttype -fontsize fontweight Default is: Helvetica -10 normal Smaller font sizes may be useful for small screens Larger font sizes may be helpful for touch screen applications
fr: Élément: [DISPLAY]NGCGUI_FONT = font_descriptor Exemple: [DISPLAY]NGCGUI_FONT = Helvetica -12 normal Remarque: Facultatif, font_descriptor est un spécificateur de police tcl-compatible avec des éléments pour type de police, taille et largeur de police Par défaut: Helvetica -10 normal Les petites tailles de police peuvent être utiles pour les petits écrans Les grande tailles de police peuvent être utiles pour les écrans tactiles

source: Item: [DISPLAY]NGCGUI_SUBFILE = subfile_filename Example: [DISPLAY]NGCGUI_SUBFILE = simp.ngc Example: [DISPLAY]NGCGUI_SUBFILE = square.gcmc Example: [DISPLAY]NGCGUI_SUBFILE = "" Note: Use one or more items to specify ngcgui-compatible subfiles or gcmc programs that require a tab page on startup. A "Custom" tab will be created when the filename is "". A user can use a "Custom" tab to browse the file system and identify preamble, subfile, and postamble files.
fr: Item: [DISPLAY]NGCGUI_SUBFILE = subfile_filename Exemple: [DISPLAY]NGCGUI_SUBFILE = simp.ngc Exemple: [DISPLAY]NGCGUI_SUBFILE = square.gcmc Exemple: [DISPLAY]NGCGUI_SUBFILE = "" Remarque: Utiliser un ou plusieurs éléments pour spécifier les sous-fichiers ou fichiers gcmc ngcgui-compatibles requérant une page à onglet au démarrage. Un onglet "personnalisé" sera créé quand le nom de fichier est "". Un utilisateur peut utiliser un onglet "personnalisé" pour parcourir le système de fichiers et d'identifier préambule, sous-fichier, et les fichiers de postambule.

source: Item: [DISPLAY]NGCGUI_PREAMBLE = preamble_filename Example: [DISPLAY]NGCGUI_PREAMBLE = in_std.ngc Note: Optional, when specified, the file is prepended to a subfile. Files created with "Custom" tab pages use the preamble specified with the page.
fr: Élément: [DISPLAY]NGCGUI_PREAMBLE = preamble_filename Exemple: [DISPLAY]NGCGUI_PREAMBLE = in_std.ngc Remarque: En option, lorsque spécifié, le fichier est ajouté au début d'un sous-fichier. Les fichiers créés avec des pages d'onglets "Personnalisées" utilisent le préambule spécifié avec la page.

source: Item: [DISPLAY]NGCGUI_POSTAMBLE = postamble_filename Example: [DISPLAY]NGCGUI_POSTAMBLE = bye.ngc Note: Optional, when specified, the file is appended to a subfiles. Files created with "Custom" tab pages use the postamble specified with the page.
fr: Élément: [DISPLAY]NGCGUI_POSTAMBLE = postamble_filename Exemple: [DISPLAY]NGCGUI_POSTAMBLE = bye.ngc Remarque: En option, lorsque spécifié, le fichier est ajouté à un sous-fichiers. Les fichiers créés avec les pages d'onglets "Personnalisées" utilisent le postambule spécifié avec la page.

source: Item: [DISPLAY]NGCGUI_OPTIONS = opt1 opt2 ... Example: [DISPLAY]NGCGUI_OPTIONS = nonew noremove Note: Multiple options are separated by blanks. By default, ngcgui configures tab pages so that: 1) a user can make new tabs 2) a user can remove tabs (except for the last remaining one) 3) finalized files are automatically sent to linuxCNC 4) an image frame (iframe) is made available to display an image for the subfile (if an image is provided) 5) the ngcgui result file sent to linuxCNC is terminated with an m2 (and incurs m2 side-effects)
fr: Élément: [DISPLAY]NGCGUI_OPTIONS = opt1 opt2 ... Exemple: [DISPLAY]NGCGUI_OPTIONS = nonew noremove Remarque: Les options multiples sont séparées par des espaces. Par défaut, ngcgui configure les pages d'onglets de cette manière: 1) l'utilisateur peux faire de nouveaux onglets 2) l'utilisateur peux supprimer des onglets, excepté le dernier restant 3) les fichiers finalisés sont automatiquement envoyés à LinuxCNC 4) une trame d'image (iframe) est rendue disponible pour affichager une image pour le sous-fichier (si une image est fournie) 5) le fichier ngcgui résultant envoyé à LinuxCNC se termine par un M2 (et encourt les effets secondaires de M2)

source: The options nonew, noremove, noauto, noiframe, nom2 respectively disable these default behaviors.
fr: Les options nonew, noremove, noauto, noiframe, nom2 respectivement désactiver ces comportements par défaut.
