Repository: 0000duck/linuxcnc
Catalog: docs/src/gui/ngcgui.*.po
Languages: fr

source: By default, if an image (.png,.gif,jpg,pgm) file is found in the same directory as the subfile, the image is displayed in the iframe. Specifying the noiframe option makes available additional buttons for selecting a preamble, subfile, and postamble and additional checkboxes. Selections of the checkboxes are always available with special keys: Ctrl-R Toggle "Retain values on Subfile read" Ctrl-E Toggle "Expand subroutine" Ctrl-a Toggle "Autosend" (Ctrl-k lists all keys and functions)
fr: Par défaut, si une image (.png,.gif,jpg,pgm) est trouvée dans le même répertoire que le sous-fichier, l'image est affichée dans l'iframe. Spécifier l'option noiframe rends disponibles des boutons additionnels pour sélectionner les cases à cocher des préambules, sous-fichiers et postambules additionnels. La sélection des cases à cocher sont toujours disponible avec les touches spéciales: Ctrl-R bascule "Retain values on Subfile read" Ctrl-E bascule "Expand subroutine" Ctrl-a bascule "Autosend" (Ctrl-k liste complète des touches spéciales)

source: If noiframe is specified and an image file is found, the image is displayed in a separate window and all functions are available on the tab page.
fr: Si noiframe est spécifié et qu'un fichier image est trouvé, l'image est affichée dans une fenêtre séparée et toutes les fonctions sont disponibles dans la page d'onglets.

source: The NGCGUI_OPTIONS apply to all ngcgui tabs except that the nonew, noremove, and noiframe options are not applicable for "Custom" tabs. Do not use "Custom" tabs if you want to limit the user's ability to select subfiles or create additional tab pages.
fr: Les NGCGUI_OPTIONS s'appliquent à tous les onglets ngcgui sauf les options nonew et noremove ne sont pas applicables pour les onglets "personnalisée". Ne pas utiliser d'onglet "personnalisé" si on veux limiter la capacité de l'utilisateur à sélectionner des sous-fichiers ou créer des onglets supplémentaires.

source: Item: [DISPLAY]GCMC_INCLUDE_PATH = dirname1:dirname2:... Example: [DISPLAY]GCMC_INCLUDE_PATH = /home/myname/gcmc_includes:/home/myname/gcmc_includes2 Note: Optional, each directory will be included when gcmc is invoked using the option: --include dirname
fr: Élément: [DISPLAY]GCMC_INCLUDE_PATH = dirname1:dirname2:... Exemple: [DISPLAY]GCMC_INCLUDE_PATH = /home/myname/gcmc_includes:/home/myname/gcmc_includes2 Remarque: En option, chaque répertoire sera incluse lorsque GCMC est invoqué en utilisant l'option: --include dirname

source: == File Requirements for NGCGUI Compatibility === Single-File Gcode (.ngc) Subroutine Requirements
fr: == Exigences des fichiers pour la compatibilité NGCGUI === Exigences des fichiers G-code (.ngc) seuls

source: An NGCGUI-compatible subfile contains a single subroutine definition. The name of the subroutine must be the same as the filename (not including the .ngc suffix). LinuxCNC supports named or numbered subroutines, but only named subroutines are compatible with NGCGUI. For more information see the <<cha:O-Codes,O-Codes>> Chapter.
fr: Un sous-fichiers compatible NGCGUI contient une simple définition de sous-programme. Le nom du sous-programme doit être le même que celui du fichier (non inclus l'extension .ngc). LinuxCNC supporte les sous-programmes nommés ou numérotés, mais seuls les sous-programmes nommés sont compatible avec NGCGUI. Pour plus d'informations voir le chapitre sur les <<cha:O-codes,O-Codes>>.

source: The first non-comment line should be a sub statement. The last non-comment line should be a endsub statement.
fr: La première ligne, autre qu'un commentaire, doit être une déclaration 'sub'. La dernière ligne, autre qu'un commentaire, doit être une déclaration 'endsub'.

source: .examp.ngc: ----
fr: .exemple.ngc: ----

source: (info: info_text_to_appear_at_top_of_tab_page) ; comment line beginning with semicolon ( comment line using parentheses) o<examp> sub BODY_OF_SUBROUTINE o<examp> endsub ; comment line beginning with semicolon ( comment line using parentheses) ----
fr: (info: texte_apparaissant_en_haut_de_la_page_d_onglets ; ligne de commentaire commençant avec un point virgule ( ligne de commentaire utilisant des parenthèses) o<exemple> sub CORPS DU SOUS-PROGRAMME o<exemple> endsub ; ligne de commentaire commençant avec un point virgule ( ligne de commentaire utilisant des parenthèses) ----

source: The body of the subroutine should begin with a set of statements that define local named parameters for each positional parameter expected for the subroutine call. These definitions must be consecutive beginning with #1 and ending with the last used parameter number. Definitions must be provided for each of these parameters (no omissions).
fr: Le corps du sous-programme doit commencer par un jeu de déclarations définissant les paramètres nommés locaux pour chaque paramètre positionnel attendu pour l'appel du sous-programme. Ces définitions doivent être consécutives, commencer par #1 et finir avec le numéro du dernier paramètre utilisé. Les définitions doivent être fournies pour chacun de ces paramètres (aucune omission).

source: .Parameter Numbering ----
fr: .Numérotation des paramètres ----

source: LinuxCNC considers all numbered parameters in the range #1 thru #30 to be calling parameters so ngcgui provides entry boxes for any occurence of parameters in this range. It is good practice to avoid use of numbered parameters #1 through #30 anywhere else in the subroutine. Using local, named parameters is recommended for all internal variables.
fr: LinuxCNC considère tous les paramètres numérotés entre #1 est #30 comme étant des paramètres appelables, de même, ngcgui fourni des boites de saisie pour n'importe quel paramètres dans cette fourchette. Il est de bonne pratique d'éviter d'utiliser un paramètre numéroté de #1 jusqu'à #30 n'importe où ailleurs dans le sous-programme. L'utilisation de paramètres nommés locaux est recommandée pour toutes le variables internes.

source: Each defining statement may optionally include a special comment and a default value for the parameter.
fr: Chaque définition de déclaration peut optionnellement inclure un commentaire spécial et une valeur par défaut pour le paramètre.

source: .Statement Prototype ----
fr: .Prototypage de déclaration ----

source: #<vname> = #n (=default_value) or #<vname> = #n (comment_text) or #<vname> = #n (=default_value comment_text) ----
fr: #<vname> = #n (=valeur_par_défaut) ou #<vname> = #n (texte_de_commentaire) ou #<vname> = #n (=valeur_par_défaut texte_de_commentaire) ----

source: .Parameter Examples ----
fr: .Exemples de paramètres ----

source: If a default_value is provided, it will be entered in the entry box for the parameter on startup.
fr: Si une valeur_par_défaut est donnée, elle sera placée au démarrage, dans la boîte de saisie pour le paramètre.

source: If comment_text is included, it will be used to identify the input instead of the parameter name.
fr: Si un texte_de_commentaire est inclus, il sera utilisé pour identifier l'entrée à la place du nom du paramètre.

source: .Global Named Parameters Notes on global named parameters and ngcgui:
fr: .Paramètres nommés globaux Note sur les paramètres nommés globaux (#<nom_global>) avec ngcgui:

source: (global named parameters have a leading underscore in the name, like #<_someglobalname>)
fr: (paramètres nommés globaux ont un tiret bas dans leur nom, comme #<_unnomglobal>)

source: As in many programming languages, use of globals is powerful but can often lead to unexpected consequences. In LinuxCNC, existing global named parameters will be valid at subroutine execution and subroutines can modify or create global named parameters.
fr: Comme dans de nombreux langages de programmation, l'utilisation de variables globales est puissante, mais peut souvent mener à des conséquences inattendues. Dans LinuxCNC, les paramètres nommés globaux existants seront valides lors de l'exécution du sous-programme et les sous-programmes peuvent les modifier ou en créer.

source: Passing information to subroutines using global named parameters is discouraged since such usage requires the establishment and maintenance of a well-defined global context that is difficult to maintain. Using numbered parameters #1 thru #30 as subroutine inputs should be sufficient to satisfy a wide range of design requirements.
fr: L'utilisation de paramètres nommé globaux comme entrées dans un sous-programme est déconseillé parce-que de tels usages requiert l'établissement et la maintenance d'un contexte global bien défini, ce qui est problématique à maintenir. L'utilisation de paramètres numérotés en #1 et #30 devrait être suffisant pour satisfaire les besoins les plus exigeants.

source: While input global named parameters are discouraged, linuxCNC subroutines must use global named parameters for returning results. Since ngcgui-compatible subfiles are aimed at gui usage, return values are not a common requirement. However, ngcgui is useful as a testing tool for subroutines which do return global named parameters and it is common for ngcgui-compatible subfiles to call utility subroutine files that return results with global named parameters.
fr: Bien que les entrées par paramètres nommés globaux soient déconseillées, les sous-programmes LinuxCNC doivent utiliser des paramètres nommés globaux pour retourner les résultats. Puisque les sous-fichiers compatibles ngcgui sont destinés à l'usage de l'interface graphique, les valeurs de retour n'ont pas d'exigence commune. Toutefois, ngcgui est utile comme outil de test pour les sous-programmes qui ne retournent pas de paramètres nommés globaux et il est commun pour les sous-fichiers compatibles ngcgui d'appeler des fichiers de sous-programmes utilitaires qui eux retournent des résultats avec des paramètres nommés globaux.

source: To support these usages, ngcgui ignores global named parameters that include a colon (:) character in their name. Use of the colon (:) in the name prevents ngcgui from making entryboxes for these parameters.
fr: Pour supporter ces usages, ngcgui ignore les paramètres nommés globaux qui incluent le caractère (:) dans leur nom. Utilisation des deux points (:) dans un nom prévient ngcgui de créer une bîte de saisie pour ces paramètres.

source: .Global Named Parameters ----
fr: .Paramètres nommés globaux ----

source: o<examp> sub ... #<_examp:result> = #5410 (return the current tool diameter) ... o<helper> call [#<x1>] [#<x2>] (call a subroutine) #<xresult> = #<_helper:answer> (immediately localize the helper global result) #<_helper:answer> = 0.0 (nullify global named parameter used by subroutine) ... o<examp> endsub ----
fr: o<exemp> sub ... #<_exemp:result> = #5410 (retourne le diamètre de l'outil courant) ... o<helper> call [#<x1>] [#<x2>] (appel d'un sous-programme) #<xresult> = #<_helper:answer> (localise immédiatement le résultat du fichier d'aide) #<_helper:answer> = 0.0 (rend nul le paramètre nommé global utilisé par le sous-programme) ... o<exemp> endsub ----

source: In the above example, the utility subroutine will be found in a separate file named helper.ngc. The helper routine returns a result in a global named parameter named #<_helper:answer.
fr: Dans l'exemple précédent, le sous-programme utilitaire sera trouvé dans un fichier séparé nommé helper.ngc. Le sous-programme d'aide retourne un résultat dans un paramètre nommé global nommé #<_helper:answer>.

source: For good practice, the calling subfile immediately localizes the result for use elsewhere in the subfile and the global named parameter used for returning the result is nullified in an attempt to mitigate its inadvertent use elsewhere in the global context. (A nullification value of 0.0 may not always be a good choice).
fr: Pour une bonne pratique, le sous-fichier appelant localise immédiatement le résultat pour une utilisation ailleurs dans le sous-fichier et le paramètre nommé global, utilisé pour retourner le résultat est mis à zéro pour diminuer les chances qu'il soit utilisé par inadvertance ailleurs dans le contexte global. (La mise à zéro avec 0.0 n'est pas toujours le meilleur choix).

source: Ngcgui supports the creation and concatenation of multiple features for a subfile and for multiple subfiles. It is sometimes useful for subfiles to determine their order at runtime so ngcgui inserts a special global parameter that can be tested within subroutines. The parameter is named #<_feature:>. Its value begins with a value of 0 and is incremented for each added feature.
fr: Ngcgui supporte la création et la concaténation de multiples fonctions pour un sous-fichier et pour de multiples sous-fichiers. Il est parfois pratique pour les sous-fichiers de déterminer leur ordre au début de l'exécution afin que ngcgui insère un paramètre global spécial qui pourra être testé par tous les sous-programmes. Ce paramètre est nommé #<_feature:>. Sa valeur commence avec 0 et est incrémentée avec chaque fonction qui lui est ajoutée.

source: .Additional Features A special 'info' comment can be included anywhere in an ngcgui-compatible subfile. The format is:
fr: .Fonctions additionnelles Un commentaire spécial 'info' peut être inclus quelque part dans les sous-fichier compatibles ngcgui. Le format est le suivant:

source: The info_text is displayed near the top of the ngcgui tab page in axis.
fr: La chaîne 'info_text' est affichée vers le haut de la page de l'onglet ngcgui dans Axis.

source: Files not intended for use as subfiles can include a special comment so that ngcgui will reject them automatically with a relevant message.
fr: Les fichiers non destinés à servir de sous-fichiers peuvent inclure le commentaire spécial: "(not_a_subfile)" de sorte que ngcgui les rejette automatiquement avec un message explicatif.

source: An optional image file (.png,.gif,.jpg,.pgm) can accompany a subfile. The image file can help clarify the parameters used by the subfile. The image file should be in the same directory as the subfile and have the same name with an appropriate image suffix, e.g. the subfile example.ngc could be accompanied by an image file examp.png. Ngcgui attempts to resize large images by subsampling to a size with maximum width of 320 and maximum height of 240 pixels.
fr: Un fichier image optionnel (.png, .gif, .jpg, .pgm) peut accompagner un sous-fichier. Le fichier image peut aider à clarifier les paramètres utilisés par le sous-fichier. Le fichier image doit être dans le même répertoire que le sous-fichier et doit avoir le même nom avec une extension appropriée au fichier image, ex: le sous-fichier exemp.ngc doit être accompagné par l'image exemp.png. Ngcgui tente de redimensionner de grandes images par sous-échantillonnage à une largeur maximale de 320 et une hauteur maximum de 240 pixels.

source: None of the conventions required for making an ngcgui-compatible subfile preclude its use as general purpose subroutine file for LinuxCNC.
fr: Aucune des conventions nécessaires pour faire une sous-fichier compatible ngcgui n'empêche son utilisation en tant que fichier de sous-programme pour LinuxCNC.

source: The LinuxCNC distribution includes a library (ngcgui_lib directory) that includes both example ngcgui-compatible subfiles and utility files to illustrate the features of LinuxCNC subroutines and ngcgui usage. Another libary (gcmc_lib) provides examples for subroutine files for the Gcode meta compiler (gcmc)
fr: La distribution LinuxCNC inclus une librairie (répertoire ngcgui_lib) qui contient plusieurs exemples de sous-fichiers et de fichiers utilitaires compatibles ngcgui pour illustrer les fonctions des sous-programmes de LinuxCNC et l'usage de ngcgui.

source: Additional user sumitted subroutines can be found on the Forum in the Subroutines Section.
fr: Des sous-programmes additionnels soumis par les utilisateurs se trouvent sur le forum dans la section 'Subroutines'.

source: === Gcode-meta-compiler (.gcmc) file requirements Files for the Gcode-meta-compiler (gcmc) are read by ngcgui and it creates entry boxes for variables tagged in the file. When a feature for the file is finalized, ngcgui passes the file as input to the gcmc compiler and, if the compile is successful, the resulting gcode file is sent to linuxCNC for execution. The resulting file is formatted as single-file subroutine; .gcmc files and .ngc files can be intermixed by ngcgui.
fr: === Exigences du Méta compilateur de G-code (.gcmc) Les fichiers pour le méta compilateur de G-code (GCMC) sont lus par ngcgui, il crée des zones de saisie pour étiqueter les variables dans le fichier. Quand une fonction pour le fichier est finalisée, ngcgui passe le fichier comme entrée pour le compilateur de GCMC et, si la compilation réussit, le fichier G-code résultant est envoyé à LinuxCNC pour exécution. Le fichier résultant est formaté comme un seul fichier sous-programme; les fichiers .gcmc et les fichiers .ngc peuvent être mélangés par ngcgui.

source: The variables identified for inclusion in ngcgui are tagged with lines that will appear as comments to the gcmc compiler.
fr: Les variables identifiées pour inclusion dans ngcgui sont étiquetées avec des lignes qui apparaîtront comme des commentaires pour le compilateur de GCMC.

source: .Example variable tags formats ----
fr: .Exemple de formats d'étiquette de variable ----

source: .Examples: ----
fr: .Exemples: ----

source: For these examples, the entry box for varname1 will have no default, the entry box for varname2 will have a default of value2, and the entry box for varname 3 will have a default of value 3 and a label label3 (instead of varname3). The default values must be numbers.
fr: Dans ces exemples, la zone de saisie pour varname1 n'aura pas de valeur par défaut, la zone de saisie pour varname2 aura par défaut valeur2, et celle de varname3 aura par défaut valeur3 avec un label3 comme étiquette (au lieu de varname3). Les valeurs par défaut doivent être des nombres.

source: To make it easier to modify valid lines in a gcmc file, alternate tag line formats accepted. The alternate formats ignore trailing semicolons (;) and trailing comment markers (//) With this provision, it is often makes it possible to just add the //ngcgui: tag to existing lines in a .gcmc file.
fr: Pour rendre plus facile à modifier les lignes valides dans un fichier de GCMC, le formats alternatif 'tag line' est accepté. Les formats alternatifs sont le point virgule (;) et les marqueurs de commentaire (//) Avec cette disposition, il est souvent possible de simplement ajouter l'étiquette //ngcgui: aux lignes existantes dans un fichier .gcmc.

source: .Alternate variable tag formats ----
fr: .Exemple de formats d'étiquette alternatifs ----

source: An info line that will appear at the top of a tab page may be optionally included with a line tagged as:
fr: Une ligne d'information qui apparaîtra en haut d'une page d'onglets, peut être éventuellement incluse avec une ligne étiquetée comme:

source: When required, options can be passed to the gcmc compiler with a line tagged:
fr: Si nécessaire, les options peuvent être passées au compilateur de GCMC avec une ligne étiquetée:

source: .Option line tag format ----
fr: .Format de ligne étiquetée ----

source: Options for gcmc are available with the terminal command: ----
fr: Options pour que gcmc soit accessible depuis une commande du terminal: ----

source: A gcmc program by default uses metric mode. The mode can be set to inches with the option setting:
fr: Un programme gcmc utilise le mode métrique par défaut. Le mode peut être réglé en pouces avec le réglage suivant:

source: A preamble file, if used, can set a mode (g20 or g21) that conflicts with the mode used by a gcmc file. To ensure that the gcmc program mode is in effect, include the following statement in the .gcmc file:
fr: Un fichier de préambule, si utilisé, peut définir un mode (G20 ou G21) qui entre en conflit avec le mode utilisé par un fichier de GCMC. Pour s'assurer que le mode de programme de GCMC est actif, inclure la mention suivante dans le fichier .gcmc:

source: and provide a proper path for gcmc include_files in the ini file, for example:
fr: et fournir un chemin correct pour include_files dans le fichier ini, par exemple:

source: == DB25 Example
fr: == Exemple, découpe pour DB25

source: The following shows the DB25 subroutine. In the first photo you see where you fill in the blanks for each variable.
fr: L'exemple ci-dessous montre l'utilisation du sous-programme DB25. Dans la première image on voit les champs remplis pour chaque variable.

source: image::images/ngcgui-db25-1.png[]
fr: image::images/ngcgui-db25-1_fr.png[]

source: This photo shows the backplot of the DB25 subroutine.
fr: Cette image montre le parcours d'outil du sous-programme DB25.

source: image::images/ngcgui-db25-2.png[]
fr: image::images/ngcgui-db25-2_fr.png[]

source: This photo shows the use of the new button and the custom tab to create three DB25 cutouts in one program.
fr: Cette image montre l'action du bouton 'Nouveau' et de l'onglet personnalisé pour créer très facilement la découpe de trois DB25 en un seul programme.

source: image::images/ngcgui-db25-3.png[]
fr: image::images/ngcgui-db25-3_fr.png[]
