Repository: 0000duck/linuxcnc
Catalog: docs/src/gui/touchy.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = Touchy GUI
fr: = L'interface graphique Touchy

source: Touchy is a user interface for LinuxCNC meant for use on machine control panels, and therefore does not require keyboard or mouse.
fr: Touchy est une interface utilisateur pour LinuxCNC, destinée à être utilisée avec les panneaux de commande de machines. Il ne nécessite ni clavier, ni souris.

source: It is meant to be used with a touch screen, and works in combination with a wheel/MPG and a few buttons and switches.
fr: Il a été conçu pour fonctionner également sur les écrans tactiles, en combinaison avec une manivelle électronique (MPG) et des boutons et interrupteurs.

source: .Touchy
fr: .L'interface tactile Touchy

source: image::images/touchy.png[]
fr: image::images/touchy_fr.png[]

source: == Panel Configuration
fr: == Panneau de Configuration

source: === HAL connections
fr: === Connections avec HAL

source: Touchy requires that you create a file named 'touchy.hal' in your configuration directory (the directory your ini file is in) to connect its controls. Touchy executes the HAL commands in this file after it has made its own pins available for connection.
fr: Touchy requiert qu'un fichier nommé 'touchy.hal' soit créé, dans le même répertoire de configuration que le fichier ini, pour y connecter ses contrôles. Touchy exécute les commandes de HAL dans ce fichier après qu'il a créé ses propres pins, lesquelles sont disponibles pour connexion.

source: Touchy has several output pins that are meant to be connected to the motion controller to control wheel jogging:
fr: Touchy dispose de plusieurs pins de sortie destinées à être connectées au contrôleur de mouvement pour gérer les manivelles de jog:

source: - 'touchy.jog.wheel.increment', which is to be connected to the 'axis.N.jog-scale' pin of each axis N.
fr: - touchy.jog.wheel.increment, qui doit être connecté à la pin _axis.N.jog-scale_ de chacun des N axes.

source: - 'touchy.jog.wheel.N', which is to be connected to 'axis.N.jog-enable' for each axis N.
fr: - touchy.jog.wheel.N, qui doit être connecté à _axis.N.jog-enable_ pour chacun des N axes.

source: - In addition to being connected to 'touchy.wheel-counts', the wheel counts should also be connected to 'axis.N.jog-counts' for each axis N. If you use HAL component 'ilowpass' to smooth wheel jogging, be sure to smooth only 'axis.N.jog-counts' and not 'touchy.wheel-counts'.
fr: - En plus d'être connecté à 'touchy.wheel-counts', le compteur d'impulsions de la manivelle doit aussi être connecté à 'axis.N.jog-counts' pour chacun des N axes. Si le composant de HAL 'ilowpass' est utilisé pour adoucir les mouvements de jog à la manivelle, il faut l'appliquer uniquement sur 'axis.N.jog-counts' et non sur 'touchy.wheel-counts'.

source: ==== Required controls
fr: ==== Contrôles requis

source: Abort button (momentary contact) connected to the HAL pin 'touchy.abort'
fr: Un bouton 'Abandon' (contact momentané) connecté sur la HAL pin 'touchy.abort'

source: Cycle start button (momentary contact) connected to 'touchy.cycle-start'
fr: Un bouton de 'Départ cycle' (contact momentané) connecté à 'touchy.cycle-start'

source: Wheel/MPG, connected to 'touchy.wheel-counts' and motion pins as described above
fr: Volant/Manivelle/MPG, connecté à 'touchy.wheel-counts' et à la pin de mouvement comme décrit précédemment.

source: Single block (toggle switch) connected to 'touchy.single-block'
fr: Un bouton à bascule simple (contact à deux positions) connecté à 'touchy.single-block'

source: ==== Optional controls
fr: ==== Contrôles optionnels

source: - For continuous jog, one center-off bidirectional momentary toggle (or two momentary buttons) for each axis, hooked to 'touchy.jog.continuous.x.negative', 'touchy.jog.continuous.x.positive', etc. - If a quill up button is wanted (to jog Z to the top of travel at top speed), a momentary button connected to 'touchy.quill-up'.
fr: - Pour le jog continu, un interrupteur à trois positions avec retour au centre (ou deux boutons momentanés) pour chacun des axes concernés, attaché à 'touchy.jog.continuous.x.negative' et à 'touchy.jog.continuous.x.positive', etc. pour les autres axes. - Si un bouton de genouillère est nécessaire, (pour jogger Z en haut de sa course en grande vitesse), un bouton à contact momentané sera connecté à 'touchy.quill-up'.

source: ==== Optional panel lamps
fr: ==== Voyants de panneau optionnels

source: 'touchy.jog.active' shows when the panel jogging controls are live
fr: 'touchy.jog.active' indique quand les contrôles de jog du panneau sont actifs.

source: - 'touchy.status-indicator' is on when the machine is executing G-code, and flashes when the machine is executing but is in pause/feedhold.
fr: - 'touchy.status-indicator' est allumé en continu quand la machine exécute un G-code et clignote quand la machine est en marche mais en pause, ou en vitesse à zéro.

source: === Recommended for any setup
fr: === Recommandé pour toutes les configurations

source: Estop button hardwired in the estop chain
fr: Un bouton d'Arrêt d'Urgence (A/U) câblé physiquement, dans la chaîne d'arrêt d'urgence.

source: == Setup
fr: == Réglages

source: === Enabling Touchy
fr: === Activer Touchy

source: To use Touchy, in the '[DISPLAY]' section of your ini file change the display selector line to 'DISPLAY = touchy'
fr: Pour utiliser Touchy, dans la section [DISPLAY] du fichier ini de la machine, modifier la ligne de cette manière: DISPLAY = touchy

source: === Preferences
fr: === Préférences

source: When you start Touchy the first time, check the Preferences tab. If using a touchscreen, choose the option to hide the pointer for best results.
fr: Quand Touchy démarre pour la première fois, vérifier l'onglet 'Préférences'. Dans le cas d'un écran tactile, choisir de cacher le pointeur dans les options, pour obtenir les meilleurs résultats.

source: The Status Window is a fixed height, set by the size of a fixed font. This can be affected by the Gnome DPI, configured in System / Preferences / Appearance / Fonts / Details. If the bottom of the screen is cut off, reduce the DPI setting.
fr: La fenêtre d'état est fixée en haut, ajustée par la taille d'une police fixe. La résolution de Gnome peut affecter cela. Si le bas de l'écran est coupé, aller dans le gestionnaire de résolution de Gnome pour revenir au réglage d'origine, à 96 DPI.

source: All other font sizes can be changed on the Preferences tab.
fr: Toutes les autres tailles de police peuvent être changées dans l'onglet Préférences.

source: Touchy can invoke O-word macros using the MDI interface. To configure this, in the '[TOUCHY]' section of the ini file, add one or more 'MACRO' lines. Each should be of the format
fr: Touchy peut invoquer les macros avec mots O au travers de l'interface MDI. Pour configurer cette possibilité, dans la section [TOUCHY] du fichier ini, ajouter une ou plusieurs lignes avec MACRO. Chacune de ces lignes doit respecter le format suivant:

source: In this example, increment is the name of the macro, and it accepts two parameters, named xinc and yinc.
fr: Dans lequel, 'increment' est le nom de la macro, laquelle accepte deux paramètres, nommés ici 'xinc' et 'yinc'.

source: Now, place the macro in a file named 'increment.ngc', in the 'PROGRAM_PREFIX' directory or any directory in the 'SUBROUTINE_PATH'.
fr: Maintenant, placer la macro proprement dite dans un fichier nommé 'increment.ngc'. La variable PROGRAM_PREFIX du fichier ini pourra être utilisée pour identifier le répertoire contenant ce fichier. Il est également possible de le déclarer dans la variable SUBROUTINE_PATH.

source: It should look like:
fr: Elle pourrait ressembler à cela:

source: Notice the name of the sub matches the file name and macro name exactly, including case.
fr: Noter que le nom du sous-programme, le nom de la macro ainsi que le nom du fichier .ngc doivent correspondre exactement, y compris les minuscules/majuscules des noms.

source: When you invoke the macro by pressing the Macro button on the MDI tab in Touchy, you can enter values for xinc and yinc. These are passed to the macro as '#1' and '#2' respectively. Parameters you leave empty are passed as value 0.
fr: Quand la macro est invoquée en pressant le bouton 'Macro' dans l'onglet MDI de Touchy, il est possible de saisir des valeurs pour xinc et yinc, lesquelles seront passées à la macro comme étant respectivement '#1' et '#2'. Les paramètres laissées vides sont passés comme des valeur '0'.

source: If there are several different macros, press the Macro button repeatedly to cycle through them.
fr: Si il y a plusieurs macros différentes, presser le bouton 'Macro' répétitivement pour les faire défiler.

source: In this simple example, if you enter -1 for xinc and press cycle start, a rapid 'G0' move will be invoked, moving one unit to the left.
fr: Dans notre petit exemple, si -1 est entré pour xinc puis que le 'Départ cycle' est pressé, un 'G0', sera invoqué, provoquant un déplacement en vitesse rapide, vers la gauche, de une unité machine.

source: This macro capability is useful for edge/hole probing and other setup tasks, as well as perhaps hole milling or other simple operations that can be done from the panel without requiring specially-written gcode programs.
fr: Cette capacité d'utilisation des macros est très utile pour le palpage de contours ou d'orifices ainsi que pour d'autres opérations simples pré-configurées, de fraisage ou de perçage, qui pourront être réalisées depuis le panneau de Touchy sans avoir, pour cela, à écrire de programme G-code.
