Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/coordinates.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = Coordinate System
fr: = Systèmes de coordonnées et décalages

source: [[cha:coordinate-system]] (((Coordinate System)))
fr: [[cha:Systemes-de-coordonnees]] (((Systèmes de coordonnées)))

source: You have seen how handy a tool length offset can be. Having this allows the programmer to ignore the actual tool length when writing a part program. In the same way, it is really nice to be able to find a prominent part of a casting or block of material and work a program from that point rather than having to take account of the location at which the casting or block will be held during the machining.
fr: Dans ce chapitre, nous allons tenter de démystifier les systèmes de coordonnées. C'est une notion capitale pour maîtriser le fonctionnement d'une machine CNC, sa configuration et son utilisation. Nous montrerons également, qu'il est très intéressant d'utiliser un point de référence sur le brut ou la pièce et de faire travailler le programme à partir de ce point, sans avoir à tenir compte d'où est placée la pièce sur la machine pendant l'usinage.

source: This chapter introduces you to offsets as they are used by the LinuxCNC. These include;
fr: Ce chapitre va donc introduire les décalages et comment ils sont utilisés par LinuxCNC:

source: machine coordinates (G53)
fr: Les coordonnées machine.(G53)

source: nine fixture offsets (G54-G59.3)
fr: Les neuf décalages d'origine pièce.(G54 à G59.3)

source: global offsets (G92)
fr: Un jeu de décalages globaux.(G92)

source: == The Machine Position Command (G53)
fr: == Commande en coordonnées machine: G53

source: Regardless of any offsets that may be in effect, putting a G53 in a block of code tells the interpreter to go to the real or absolute axis positions commanded in the block. For example
fr: Indépendamment de tout décalage pouvant être actif, un G53 dans une ligne de code indique à l'interpréteur de se déplacer aux positions réelles des axes (positions absolues), commandées dans la ligne. Par exemple:

source: will get you to the actual position where these three axes are zero. You might use a command like this if you have a favorite position for tool changes or if your machine has an auto tool changer. You might also use this command to get the tool out of the way so that you can rotate or change a part in a vice.
fr: déplacera le mobile depuis la position actuelle vers la position où les coordonnées machine des trois axes seront à zéro. Vous pouvez utiliser cette commande si vous avez une position fixe pour le changement d'outil ou si votre machine dispose d'un changeur automatique. Vous pouvez aussi utiliser cette commande pour dégager la zone de travail et accéder à la pièce dans l'étau.

source: G53 is not a modal command. It must be used on each line where motion based upon absolute machine position is desired.
fr: G53 est une commande non modale. Elle doit être utilisée sur chaque ligne où un mouvement basé sur les coordonnées machine est souhaité.

source: == Fixture Offsets (G54-G59.3)
fr: == Décalages pièce (G54 à G59.3)

source: .Fixture Offsets[[cap:Fixture-Offsets]]
fr: .Exemple de décalages pour 8 ilots[[fig:decalages-ilots]]

source: Work or fixture offset are used to make a part home that is different from the absolute, machine coordinate system. This allows the part programmer to set up home positions for multiple parts. A typical operation that uses fixture offsets would be to mill multiple copies of parts on multiple part holders or vises.
fr: Le décalage d'origine est utilisé pour séparer le point de référence de la pièce de l'origine machine, créant ainsi un système de coordonnées (relatif), propre à chaque pièce et décalé du système de coordonnées machine (absolu). Il permet entre autre, dans le cas de pièces multiples mais semblables, de créer en décalant ses origines, le système de coordonnées de chaque pièce, le programme restant le même. Un cas typique d'utilisation de cette fonctionnalité, pour usiner huit îlots identiques sur la même pièce, est illustré sur la figure ci-dessus.

source: The values for offsets are stored in the VAR file that is requested by the INI file during the startup of an LinuxCNC. In our example below we'll use (((G55)))G55. The values for each axis for G55 are stored as variable numbers.
fr: Les valeurs des décalages sont enregistrées dans le fichier VAR qui est requis par le fichier INI durant le démarrage de LinuxCNC. Dans l'exemple ci-dessous, qui utilise (((G55)))G55, la valeur de chacun des axes de G55 est enregistrée dans une variable numérotée.

source: [width="40%",cols="^,^",options="header"] |=============== |Variable |Value |5241 |0.000000 |5242 |0.000000 |5243 |0.000000 |5244 |0.000000 |5245 |0.000000 |5246 |0.000000 |===============
fr: [width="40%",cols="^,^",options="header"] |============== |Variable|Valeur |5241 |0.000000 |5242 |0.000000 |5243 |0.000000 |5244 |0.000000 |5245 |0.000000 |5246 |0.000000 |==============

source: In the VAR file scheme, the first variable number stores the X offset, the second the Y offset and so on for all six axes. There are numbered sets like this for each of the fixture offsets.
fr: Dans le schéma d'un fichier VAR, la première variable contient la valeur du décalage de l'axe X, la seconde variable le décalage de l'axe Y et ainsi de suite pour les six axes. Il y a une série de variables de ce genre pour chacun des décalages pièce.

source: Each of the graphical interfaces has a way to set values for these offsets. You can also set these values by editing the VAR file itself and then restarting LinuxCNC so that the LinuxCNC reads the new values however this is not the recommended way. G10, G92, G28.1, etc are better ways to affect variables. For our example let's directly edit the file so that G55 takes on the following values.
fr: Chacune des interfaces graphiques offre un moyen de fixer les valeurs de ces décalages. Vous pouvez également définir ces valeurs en modifiant le fichier VAR lui-même, puis faire un [reset], pour que LinuxCNC lise les nouvelles valeurs. Pour notre exemple, nous allons éditer directement le fichier pour que G55 prenne les valeurs suivantes:

source: [width="40%",cols="^,^",options="header"] |=============== |Variable |Value |5241 |2.000000 |5242 |1.000000 |5243 |-2.000000 |5244 |0.000000 |5245 |0.000000 |5246 |0.000000 |===============
fr: [width="40%",cols="^,^",options="header"] |============== |Variable|Valeur |5241 |2.000000 |5242 |1.000000 |5243 |-2.000000 |5244 |0.000000 |5245 |0.000000 |5246 |0.000000 |==============

source: You should read this as moving the zero positions of G55 to X = 2 units, Y= 1 unit, and Z = -2 units away from the absolute zero position.
fr: Vous pouvez voir que les positions zéro de G55 sont passées en X = 2, Y = 1, et Z = -2 éloignées donc de l'origine absolue (machine).

source: Once there are values assigned, a call to G55 in a program block would shift the zero reference by the values stored. The following line would then move each axis to the new zero position. Unlike G53, G54 through G59.3 are modal commands. They will act on all blocks of code after one of them has been set. The program that might be run using fixture offsets would require only a single coordinate reference for each of the locations and all of the work to be done there. The following code is offered as an example of making a square using the G55 offsets that we set above.
fr: Une fois que les valeurs sont assignées, un appel de G55 dans une ligne de programme décalera le point de référence zéro, l'origine, vers les valeurs enregistrées. La ligne suivante décalera chacun des axes vers sa nouvelle position d'origine. Contrairement à G53, les commandes G54 à G59.3 sont modales. Elles agissent sur toutes les lignes de G-code du programme après qu'une ait été rencontrée. Voyons le programme qui pourrait être écrit à l'aide de la figure <<fig:decalages-ilots, des décalages d'ilots>>, il suffira d'un seul point de référence pour chacune des pièces pour faire tout le travail. Le code suivant est proposé comme exemple pour faire un rectangle, il utilisera les décalages G55 que nous avons expliqué précédemment.

source: But, you say, why is there a G54 in there near the end. Many programmers leave the G54 coordinate system with all zero values so that there is a modal code for the absolute machine based axis positions. This program assumes that we have done that and use the ending command as a command to machine zero. It would have been possible to use g53 and arrive at the same place but that command would not have been modal and any commands issued after it would have returned to using the G55 offsets because that coordinate system would still be in effect.
fr: Mais, dites vous, pourquoi y a-t-il un G54 vers la fin? C'est une pratique courante de quitter le système de coordonnées G54 avec l'ensemble des valeurs d'axes à zéro afin de laisser un code modal basé sur les positions machine absolues. Nous le faisons avec cette commande qui met la machine à zéro. Il aurait été possible d'utiliser G53 et d'arriver au même endroit, mais la commande n'aurait pas été modale, les commandes suivantes auraient voulu retourner dans le système de coordonnées du G55 toujours actif.

source: G54 use preset work coordinate system 1 G55 use preset work coordinate system 2 G56 use preset work coordinate system 3 G57 use preset work coordinate system 4 G58 use preset work coordinate system 5 G59 use preset work coordinate system 6 G59.1 use preset work coordinate system 7 G59.2 use preset work coordinate system 8 G59.3 use preset work coordinate system 9 ----
fr: G54 utilise les réglages du système de coordonnées 1 G55 utilise les réglages du système de coordonnées 2 G56 utilise les réglages du système de coordonnées 3 G57 utilise les réglages du système de coordonnées 4 G58 utilise les réglages du système de coordonnées 5 G59 utilise les réglages du système de coordonnées 6 G59.1 utilise les réglages du système de coordonnées 7 G59.2 utilise les réglages du système de coordonnées 8 G59.3 utilise les réglages du système de coordonnées 9 ----

source: === Default coordinate system
fr: === Système de coordonnées par défaut

source: One other variable in the VAR file becomes important when we think about offset systems. This variable is named 5220. In the default files its value is set to 1.00000. This means that when the LinuxCNC starts up it should use the first coordinate system as its default. If you set this to 9.00000 it would use the ninth offset system as its default for start up and reset. Any value other than an integer (decimal really) between 1 and 9, or a missing 5220 variable will cause the LinuxCNC to revert to the default value of 1.00000 on start up.
fr: Une autre variable dans le fichier VAR joue un rôle important dans les décalages, c'est la variable 5220. Dans les fichiers par défaut, sa valeur est fixée à 1.00000. Ce qui signifie que lorsque LinuxCNC démarre, il doit utiliser le premier système de coordonnées comme système par défaut. Si vous définissez celui-ci à 9.00000 le neuvième système décalé sera utilisé par défaut au démarrage du système et aux réinitialisations. Toute valeur autre qu'un entier compris entre 1 et 9, ou l'absence de la variable 5220, provoquera au démarrage le retour de LinuxCNC à la valeur par défaut de 1.00000.

source: === Setting coordinate (fixture) offsets from G code
fr: === Réglage des décalages pièce avec G10

source: The G10 L2x command can be used to set coordinate (fixture) offsets: (these are just quick summaries, see the G code section for full details)
fr: La commande G10 L2x peut être utilisée pour modifier les valeurs des décalages d'un système de coordonnées pièce: (Nous donnons seulement ici un bref aperçu, se reporter aux sections du G-code pour une description complète).

source: * 'G10 L2 P(fixture 1-9)' - Set offset(s) to a value. Current position irrelevant. (see <<sec:G10-L2_,G10 L2>> for details)
fr: * 'G10 L2 P(pièce 1-9)' - Ajuste les valeurs d'offset. La position courante reste inchangée. (voir la section <<sec:G10-L2, G10 L2>> pour les détails)

source: * 'G10 L20 P(fixture 1-9)' - Set offset(s) so current position becomes a value. (see <<sec:G10-L20,G10 L20>> for details)
fr: * 'G10 L20 P(pièce 1-9)' - Ajuste les valeurs d'offset de sorte que la position courante devienne la position donnée en paramètre. (Voir la section <<sec:G10-L20,G10 L20>> pour les détails)

source: == G92 Offsets[[sec:G92-Offsets]]
fr: == Décalages d'axes G92[[sec:G92-Decalages]]

source: === The G92 commands
fr: === Les commandes G92

source: This set of commands include;
fr: Ce jeu de commandes inclus;

source: * 'G92' - This command, when used with axis names, sets values to offset variables.
fr: * 'G92' - Cette commande, utilisée avec des mots d'axes, fixe les valeurs des variables de décalage.

source: 'G92.1' - This command sets zero values to the G92 variables.
fr: 'G92.1' - Cette commande met à zéro les valeurs des variables de G92.

source: * 'G92.2' - This command suspends but does not zero out the G92 variables.
fr: * 'G92.2' - Cette commande suspend, sans les mettre à zéro, les variables de G92.

source: 'G92.3' - This command applies offset values that have been suspended.
fr: 'G92.3' - Cette commande applique les valeurs de décalage qui ont été suspendues.

source: When the commands are used as described above, they will work pretty much as you would expect.
fr: Quand ces commandes sont utilisées comme décrit ci-dessus, elles fonctionnent parfaitement, comme espéré.

source: To make the current point, what ever it is, have the coordinates X0, Y0, and Z0 you would use G92 X0 Y0 Z0. G92 *does not* work from absolute machine coordinates. It works from *current location*.
fr: Pour faire en sorte que le point actuel ait les coordonnées X0, Y0 et Z0 nous utiliserons G92 X0 Y0 Z0. G92 *ne fonctionne pas* depuis le système de coordonnées machine absolues. Il fonctionne à partir de *l'emplacement actuel*.

source: G92 also works from current location as modified by any other offsets that are in effect when the G92 command is invoked. While testing for differences between work offsets and actual offsets it was found that a G54 offset could cancel out a G92 and thus give the appearance that no offsets were in effect. However, the G92 was still in effect for all coordinates and did produce expected work offsets for the other coordinate systems.
fr: G92 travaille également à partir d'un emplacement actuel déjà modifié par tout autre décalage actif au moment où la commande G92 est invoquée. Lors de tests des différences entre les décalages de travail et les décalages réels, il a été constaté qu'un décalage G54 pouvait annuler un G92 et ainsi, donner l'apparence qu'aucun décalage n'était actif. Toutefois, le G92 était toujours actif, pour toutes les coordonnées et il a produit les décalages attendus pour tous les autres systèmes de coordonnées.

source: It is a good practice to clear the G92 offsets at the end of their use with G92.1 or G92.2. When starting up LinuxCNC if any offsets are in the G92 variables they will be applied when an axis is homed.
fr: Lors du démarrage de LinuxCNC, si des offsets existent dans les variables de G92, ils seront appliqués lors de la prise d'origine des axes concernés. Il est donc de bonne pratique de mettre les offsets de G92 à zéro par G92.1 ou un G92.2 à la fin de leur utilisation.

source: === Setting G92 values
fr: === Réglage de G92

source: There are at least two ways to set G92 values.
fr: Il y a au moins deux façons d'établir les valeurs de G92.

source: * right mouse click on position displays of tkLinuxCNC will popup a window into which you can type a value. * the G92 command
fr: * Par un clic droit de la souris sur les afficheurs de position de tklinuxcnc, une fenêtre s'ouvre dans laquelle il est possible de saisir une valeur. * Par la commande G92.

source: Both of these work from the current location of the axis to which the offset is to be applied.
fr: Toutes les deux, fonctionnent depuis l'emplacement courant de l'axe auquel le déplacement doit être appliqué.

source: Issuing 'G92 X Y Z A B C U V W' does in fact set values to the G92 variables such that each axis takes on the value associated with its name. These values are assigned to the current position of the machine axis. These results satisfy paragraphs one and two of the NIST document.
fr: Programmer 'G92 X Y Z A B C U V W' fixe les valeurs des variables de G92 de sorte que chaque axe prenne la valeur associée à son nom. Ces valeurs sont assignées à la position courante des axes. Ces résultats satisfont les paragraphes un et deux du document du NIST.

source: G92 commands work from current axis location and add and subtract correctly to give the current axis position the value assigned by the G92 command. The effects work even though previous offsets are in.
fr: Les commandes G92 fonctionnent à partir de la position courante de l'axe, à laquelle elles ajoutent ou soustraient des valeurs pour donner à la position courante la valeur assignée par la commande G92. Elles prennent effet même si d'autres décalages sont déjà actifs.

source: So if the X axis is currently showing 2.0000 as its position a 'G92 X0' will set an offset of -2.0000 so that the current location of X becomes zero. A 'G92 X2' will set an offset of 0.0000 and the displayed position will not change. A 'G92 X5.0000' will set an offset of 3.0000 so that the current displayed position becomes 5.0000.
fr: Ainsi, si l'axe X est actuellement en position X=2.000, un 'G92 X0' fixera un décalage de -2.0000, de sorte que l'emplacement actuel de X devienne X=0.000. Un nouveau 'G92 X5.000' fixera un décalage de 3.000 et l'affichage indiquera une position courante X=5.000.

source: === G92 Cautions
fr: === Précautions avec G92

source: Sometimes the values of a G92 offset will remain in the VAR file. This can happen when a file is aborted during processing that has G92 offsets in effect. When this happens reset or a startup will cause them to become active again.
fr: Parfois, les valeurs de décalage d'un G92 persistent à rester dans le fichier VAR, ce qui peut arriver à la suite de l'abandon d'un programme utilisant un décalage G92. Dans ce cas, une ré-initialisation ou un redémarrage peut les rendre de nouveau actives.

source: The variables are named:
fr: Les variables sont numérotées:

source: [width="40%",cols="^,^",options="header"] |=============== |Variable |Value |5211 | 0.000000 |5212 | 0.000000 |5213 | 0.000000 |5214 | 0.000000 |5215 | 0.000000 |5216 | 0.000000 |===============
fr: [width="40%",cols="^,^",options="header"] |============== |Variable|Valeur |5211 | 0.000000 |5212 | 0.000000 |5213 | 0.000000 |5214 | 0.000000 |5215 | 0.000000 |5216 | 0.000000 |==============

source: where 5211 is the X axis offset and so on. If you are seeing unexpected positions as the result of a commanded move, as a result of storing an offset in a previous program and not clearing them at the end then issue a G92.1 in the MDI window to clear the stored offsets.
fr: où 5211 est le numéro du décalage de l'axe X et ainsi de suite. Si vous voyez des positions inattendues à la suite d'une commande de déplacement, résidu probable de l'enregistrement d'un décalage dans un programme précédent qui s'est terminé sans les effacer, une commande G92.1 dans la fenêtre MDI supprimera les décalages enregistrés.

source: If G92 values exist in the VAR file when LinuxCNC starts up, the G92 values in the var file will be applied to the values of the current location of each axis. If this is home position and home position is set as machine zero everything will be correct. Once home has been established using real machine switches, or by moving each axis to a known home position and issuing an axis home command, any G92 offsets will be applied. If you have a G92 X1 in effect when you home the X axis the DRO will read 'X: 1.000' instead of the expected 'X: 0.000' because the G92 was applied to the machine origin. If you issue a G92.1 and the DRO now reads all zeros then you had a G92 offset in effect when you last ran LinuxCNC.
fr: Si des valeurs G92 existent dans le fichier VAR quand LinuxCNC démarre, ces valeurs seront appliquées aux valeurs courantes des emplacements d'axe. Si c'est sa position d'origine et que l'origine est définie au zéro machine, tout sera correct. Une fois que l'origine machine a été établie en utilisant les contacts d'origine machine, ou en déplaçant chaque axe à une position connue, puis en envoyant la commande de prise d'origine de l'axe, tous les décalages G92 seront appliqués. Si un X1 G92 est actif lors de la prise d'origine machine de l'axe X, la visu affichera 'X: 1.000' au lieu du 'X: 0.000' attendu, c'est parce-que le G92 a été appliqué à l'origine machine. Si vous passez un G92.1 et que la visu affiche tout à zéro, alors c'est que vous avez encore l'effet de l'offset G92 de la dernière session de LinuxCNC.

source: Unless your intention is to use the same G92 offsets in the next program, the best practice is to issue a G92.1 at the end of any G Code files where you use G92 offsets.
fr: Sauf si votre intention est d'utiliser les mêmes décalages G92 dans le prochain programme, la meilleure pratique consiste à envoyer un G92.1 à la fin de tout fichier de G-code dans lequel vous utilisez les décalages G92.

source: == Sample Program Using Offsets
fr: == Exemple de programme utilisant les décalages d'axes

source: This sample engraving project mills a set of four .1 radius circles in roughly a star shape around a center circle. We can setup the individual circle pattern like this.
fr: Cet exemple de projet de gravure, usine un jeu de quatre cercles de rayon .1 pouce dans une forme grossière d'étoile au centre du cercle. Nous pouvons configurer individuellement les formes de la façon suivante:

source: G10 L2 P1 X0 Y0 Z0 (ensure that G54 is set to machine zero) G0 X-0.1 Y0 Z0 G1 F1 Z-0.25 G3 X-0.1 Y0 I0.1 J0 G0 Z0 M2 ---------------------------------------------------------------------
fr: G10 L2 P1 X0 Y0 Z0 (assure que G54 a mis la machine à zéro) G0 X-0.1 Y0 Z0 G1 F1 Z-0.25 G3 X-0.1 Y0 I0.1 J0 G0 Z0 M2 ----

source: We can issue a set of commands to create offsets for the four other circles like this.
fr: Nous pouvons émettre une série de commandes pour créer des décalages pour les quatre autres cercles comme cela.

source: G10 L2 P2 X0.5 (offsets G55 X value by 0.5 inch) G10 L2 P3 X-0.5 (offsets G56 X value by -0.5 inch) G10 L2 P4 Y0.5 (offsets G57 Y value by 0.5 inch) G10 L2 P5 Y-0.5 (offsets G58 Y value by -0.5 inch) -----------------------------------------------------------
fr: G10 L2 P2 X0.5 (décalages G55 X la valeur de 0.5 pouces) G10 L2 P3 X-0.5 (décalages G56 X valeur de -0.5 pouces) G10 L2 P4 Y0.5 (décalages G57 valeur Y de 0.5 pouces) G10 L2 P5 Y-0.5 (décalages G58 valeur Y de -0.5 pouces) ----

source: We put these together in the following program:
fr: Nous mettons ces ensembles dans le programme suivant:

source: (a program for milling five small circles in a diamond shape)
fr: (Un programme de fraisage de cinq petits cercles dans un losange)

source: G10 L2 P1 X0 Y0 Z0 (ensure that G54 is machine zero) G10 L2 P2 X0.5 (offsets G55 X value by 0.5 inch) G10 L2 P3 X-0.5 (offsets G56 X value by -0.5 inch) G10 L2 P4 Y0.5 (offsets G57 Y value by 0.5 inch) G10 L2 P5 Y-0.5 (offsets G58 Y value by -0.5 inch)
fr: G10 L2 P1 X0 Y0 Z0 (assure que G54 a mis la machine à zéro) G10 L2 P2 X0.5 (décalages G55 X la valeur de 0.5 pouces) G10 L2 P3 X-0.5 (décalages G56 X la valeur de -0.5 pouces) G10 L2 P4 Y0.5 (décalages G57 X la valeur de 0.5 pouces) G10 L2 P5 Y-0.5 (décalages G58 X la valeur de -0.5 pouces)
