Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/coordinates.*.po
Languages: fr

source: G54 G0 X-0.1 Y0 Z0 (center circle) G1 F1 Z-0.25 G3 X-0.1 Y0 I0.1 J0 G0 Z0
fr: G54 G0 X-0.1 Y0 Z0 (cercle du centre) G1 F1 Z-0.25 G3 X-0.1 Y0 I0.1 J0 G0 Z0

source: G55 G0 X-0.1 Y0 Z0 (first offset circle) G1 F1 Z-0.25 G3 X-0.1 Y0 I0.1 J0 G0 Z0
fr: G55 G0 X-0.1 Y0 Z0 (premier cercle compensé) G1 F1 Z-0.25 G3 X-0.1 Y0 I0.1 J0 G0 Z0

source: G56 G0 X-0.1 Y0 Z0 (second offset circle) G1 F1 Z-0.25 G3 X-0.1 Y0 I0.1 J0 G0 Z0
fr: G56 G0 X-0.1 Y0 Z0 (deuxième cercle compensé) G1 F1 Z-0.25 G3 X-0.1 Y0 I0.1 J0 G0 Z0

source: G57 G0 X-0.1 Y0 Z0 (third offset circle) G1 F1 Z-0.25 G3 X-0.1 Y0 I0.1 J0 G0 Z0
fr: G57 G0 X-0.1 Y0 Z0 (troisième cercle compensé) G1 F1 Z-0.25 G3 X-0.1 Y0 I0.1 J0 G0 Z0

source: G58 G0 X-0.1 Y0 Z0 (fourth offset circle) G1 F1 Z-0.25 G3 X-0.1 Y0 I0.1 J0 G54 G0 X0 Y0 Z0
fr: G58 G0 X-0.1 Y0 Z0 (quatrième cercle compensé) G1 F1 Z-0.25 G3 X-0.1 Y0 I0.1 J0 G54 G0 X0 Y0 Z0

source: Now comes the time when we might apply a set of G92 offsets to this program. You'll see that it is running in each case at Z0. If the mill were at the zero position, a G92 Z1.0000 issued at the head of the program would shift everything down an inch. You might also shift the whole pattern around in the XY plane by adding some X and Y offsets with G92. If you do this you should add a G92.1 command just before the m2 that ends the program. If you do not, other programs that you might run after this one will also use that G92 offset. Furthermore it would save the G92 values when you shut down the LinuxCNC and they will be recalled when you start up again.
fr: Maintenant c'est le moment d'appliquer une série de décalages G92 à ce programme. Vous verrez que c'est fait dans chaque cas de Z0. Si la machine était à la position zéro, un G92 Z1.0000 placé en tête de programme le décalerait d'un pouce. Vous pouvez également modifier l'ensemble du dessin dans le plan XY en ajoutant quelques décalages x et y avec G92. Si vous faites cela, vous devez ajouter une commandeG92.1 juste avant le M2 qui termine le programme. Si vous ne le faites pas, les programmes que vous pourriez lancer après celui-ci, utiliseront également les décalages G92. En outre, cela permettrait d'éviter d'écrire les valeurs de G92 lorsque vous arrêtez LinuxCNC et donc, d'éviter de les recharger quand vous démarrez à nouveau le programme.
