Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/gcode.*.po
Languages: fr

source: Program 'G38.x axes' to perform a straight probe operation. The axis words are optional, except that at least one of them must be used. The axis words together define the destination point that the probe will move towards, starting from the current location. If the probe is not tripped before the destination is reached G38.2 and G38.4 will signal an error.
fr: Programmer 'G38.x axes', pour effectuer une mesure au palpeur. Les mots d'axe sont facultatifs excepté au moins un. Les mots d'axe définissent ensemble, le point de destination, à partir de l'emplacement actuel, vers lequel la sonde se déplace. Si le palpeur n'a pas déclenché avant que la destination soit atteinte, G38.2 et G38.4 signaleront une erreur.

source: The tool in the spindle must be a probe or contact a probe switch.
fr: L'outil dans la broche doit être un palpeur ou l'actionneur d'un contact.

source: In response to this command, the machine moves the controlled point (which should be at the center of the probe ball) in a straight line at the current <<sec:F-feed-rate,feed rate>> toward the programmed point. In inverse time feed mode, the feed rate is such that the whole motion from the current point to the programmed point would take the specified time. The move stops (within machine acceleration limits) when the programmed point is reached, or when the requested change in the probe input takes place, whichever occurs first.
fr: En réponse à cette commande, la machine déplace le point contrôlé (qui est le centre de la boule du stylet du palpeur) en ligne droite, à la <<sec:F-Vitesse,vitesse travail>> courante, vers le point programmé. En mode vitesse inverse du temps, la vitesse est telle que le mouvement depuis le point courant jusqu'au point programmé, prendra le temps spécifié. Le mouvement s'arrête (dans les limites d'accélération de la machine) lorsque le point programmé est atteint ou quand l'entrée du palpeur bascule dans l'état attendu selon la première occurrence.

source: After successful probing, parameters 5061 to 5069 will be set to the coordinates of X, Y, Z, A, B, C, U, V, W of the location of the controlled point at the time the probe changed state. After unsuccessful probing, they are set to the coordinates of the programmed point. Parameter 5070 is set to 1 if the probe succeeded and 0 if the probe failed. If the probing operation failed, G38.2 and G38.4 will signal an error by posting an message on screen if the selected GUI supports that. And by halting program execution.
fr: Après une mesure réussie, <<sec:Log-des-mesures,les paramètres 5061 à 5069>> contiendront les coordonnées des axes X Y Z A B C U V W, pour l'emplacement du point contrôlé à l'instant du changement d'état du palpeur. Après une mesure manquée, ils contiendront les coordonnées du point programmé. Le paramètre 5070 est mis à 1 si la mesure est réussie et à 0 si elle est manquée. Si la mesure n'a pas réussi, G38.2 et G38.4 signaleront une erreur en affichant un message à l'écran si l'interface graphique choisie le permet.

source: A comment of the form '(PROBEOPEN filename.txt)' will open 'filename.txt' and store the 9-number coordinate consisting of XYZABCUVW of each successful straight probe in it. The file must be closed with '(PROBECLOSE)'. For more information see the <<sec:comments, Comments>> Section.
fr: Un commentaire de la forme '(PROBEOPEN filename.txt)' ouvrira le fichier 'filename.txt' et y enregistrera les 9 coordonnées de XYZABCUVW pour chaque mesure réussie. Le fichier doit être fermé avec <<sec:Log-des-mesures,le commentaire>> '(PROBECLOSE)'.

source: An example file 'smartprobe.ngc' is included (in the examples directory) to demonstrate using probe moves to log to a file the coordinates of a part. The program 'smartprobe.ngc' could be used with 'ngcgui' with minimal changes.
fr: Dans le répertoire des exemples, le fichier 'smartprobe.ngc' montre l'utilisation d'un palpeur et l'enregistrement des coordonnées de la pièce dans un fichier. Le fichier 'smartprobe.ngc' peut être utilisé par 'ngcgui' avec un minimum de modifications.

source: the current point is the same as the programmed point.
fr: Le point programmé est le même que le point courant.

source: no axis word is used
fr: Aucun mot d'axe n'est utilisé.

source: cutter compensation is enabled
fr: La compensation de d'outil est activée.

source: the feed rate is zero
fr: La vitesse travail est à zéro.

source: the probe is already in the target state
fr: Le palpeur est déjà au contact du point cible.

source: [[sec:G40]] == G40 Compensation Off (((G40 Cutter Compensation Off)))
fr: == G40 Révocation de la compensation de rayon d'outil[[sec:G40]] (((G40 Révocation de la compensation de rayon)))

source: * 'G40' - turn cutter compensation off. If tool compensation was on the next move must be a linear move and longer than the tool diameter. It is OK to turn compensation off when it is already off.
fr: * 'G40' - révoque la compensation de rayon d'outil. Le mouvement suivant, de sortie de compensation, doit être une droite au moins aussi longue que le diamètre de l'outil. Ce n'est pas une erreur de désactiver la compensation quand elle est déjà inactive.

source: .G40 Example ----
fr: .Exemple avec G40 ----

source: ; current location is X1 after finishing cutter compensated move G40 (turn compensation off) G0 X1.6 (linear move longer than current cutter diameter) M2 (end program) ----
fr: ; la position courante est X1 après la fin du mvt avec compensation G40 (révoque la compensation) G0 X1.6 (mouvement linéaire aussi long que le diamètre d'outil) M2 (fin de programme) ----

source: See <<sec:G0,G0>> & <<sec:M2-M30,M2>> sections for more information.
fr: Voir les sections <<sec:G0,G0>> et <<sec:M2-M30,M2>> pour plus d'informations.

source: A G2/G3 arc move is programmed next after a G40.
fr: Un mouvement en arc avec G2 ou G3 suit un G40.

source: The linear move after turning compensation off is less than the tool diameter.
fr: Le mouvement linéaire suivant la révocation de compensation est inférieur au diamètre de l'outil.

source: [[sec:G41-G42]] == G41, G42 Cutter Compensation (((G41 G42 Cutter Compensation)))
fr: == G41, G42 Compensation de rayon d'outil[[sec:G41-G42]] (((G41 G42 Compensation d'outil)))

source: G41 <D-> (left of programmed path) G42 <D-> (right of programmed path) ----
fr: G41 <D-> (compensation à gauche du profil) G42 <D-> (compensation à droite du profil) ----

source: 'D' - tool number
fr: 'D' - Numéro d'outil

source: The D word is optional; if there is no D word the radius of the currently loaded tool will be used (if no tool is loaded and no D word is given, a radius of 0 will be used).
fr: Le mot D est facultatif. En son absence ou si il est à zéro, le rayon de l'outil courant est utilisé. Si aucun outil n'est chargé et qu'aucun mot D n'est donné, un rayon de 0 sera utilisé.

source: If supplied, the D word is the tool number to use. This would normally be the number of the tool in the spindle (in which case the D word is redundant and need not be supplied), but it may be any valid tool number.
fr: S'il est fourni, le mot D est le numéro de l'outil à utiliser. Ce qui devrait correspondre à l'outil monté en broche, (dans ce cas le mot D est redondant et ne devrait pas être fourni) mais il peut aussi être tout numéro d'outil valide.

source: [NOTE] 'G41/G42 D0' is a little special. Its behavior is different on random tool changer machines and nonrandom tool changer machines (see the <<sec:Tool-Changers,Tool Changers>> section). On nonrandom tool changer machines, 'G41/G42 D0' applies the TLO of the tool currently in the spindle, or a TLO of 0 if no tool is in the spindle. On random tool changer machines, 'G41/G42 D0' applies the TLO of the tool T0 defined in the tool table file (or causes an error if T0 is not defined in the tool table).
fr: [NOTE] Particularité de 'G41/G42 D0'. Son comportement diffère selon que le changeur d'outil est à positions aléatoires ou à positions fixes, voir le chapitre sur les <<sec:Tool-Changers,changeurs d'outil>>. Sur les machines à changeur d'outil à positions fixes, 'G41/G42 D0' applique le TLO de l'outil couramment dans la broche, ou un TLO de 0 si aucun outil n'est dans la broche. Sur les machines à changeur d'outil à positions aléatoires, 'G41/G42 D0' applique le TLO de l'outil T0 défini dans la table d'outils (ou provoque une erreur si T0 n'est pas défini dans la table).

source: To start cutter compensation to the left of the part profile, use G41. G41 starts cutter compensation to the left of the programmed line as viewed from the positive end of the axis perpendicular to the plane.
fr: Pour activer la compensation d'outil à gauche du profil, programmer 'G41'. G41 applique la compensation d'outil à gauche de la ligne programmée vu de l'extrémité positive de l'axe perpendiculaire au plan.

source: To start cutter compensation to the right of the part profile, use G42. G42 starts cutter compensation to the right of the programmed line as viewed from the positive end of the axis perpendicular to the plane.
fr: Pour activer la compensation d'outil à droite du profil, programmer 'G42'. G42 applique la correction d'outil à droite de la ligne programmée vu de l'extrémité positive de l'axe perpendiculaire au plan.

source: The lead in move must be at least as long as the tool radius. The lead in move can be a rapid move.
fr: Le mouvement d'entrée doit être au moins aussi long que le rayon de l'outil. Le mouvement d'entrée peut être effectué en vitesse rapide.

source: Cutter compensation may be performed if the XY-plane or XZ-plane is active.
fr: La compensation d'outil ne peut être effectuée que si le plan XY ou le plan XZ est actif.

source: User M100-M199 commands are allowed when Cutter Compensation is on.
fr: Les commandes définies par l'utilisateur, M100 à M199, sont autorisées lorsque la compensation d'outil est activée.

source: The behavior of the machining center when cutter compensation is on is described in the <<sec:cutter-compensation,Cutter Compensation>> Section along with code examples.
fr: Le comportement de la machine, quand la compensation d'outil est activée, est décrit dans la section <<sec:Compensation-rayon-d-outil, sur la compensation d'outil>>.

source: The D number is not a valid tool number or 0.
fr: Le nombre D ne correspond, ni à zéro, ni à un numéro d'outil valide.

source: The YZ plane is active.
fr: Le plan YZ est le plan de travail actif.

source: Cutter compensation is commanded to turn on when it is already on.
fr: La compensation d'outil est activée alors qu'elle est déjà active.

source: [[sec:G41_1-G42_1]] == G41.1, G42.1 Dynamic Cutter Compensation (((G41.1 G42.1 Dynamic Compensation)))
fr: == G41.1, G42.1 Compensation dynamique d'outil[[sec:G41_1-G42_1]] (((G41.1 Compensation dynamique)))

source: G41.1 D- <L-> (left of programmed path) G42.1 D- <L-> (right of programmed path) ----
fr: G41.1 D- <L-> (à gauche du profil) G42.1 D- <L-> (à droite du profil) ----

source: 'D' - cutter diameter
fr: Le mot D spécifie le diamètre de l'outil.

source: 'L' - tool orientation (see <<lathe-tool-orientation,lathe tool orientation>>)
fr: Le mot L spécifie l'orientation de l'outil, est à 0 par défaut si non spécifié.

source: G41.1 & G42.1 function the same as G41 & G42 with the added scope of being able to program the tool diameter. The L word defaults to 0 if unspecified.
fr: G41.1 et G42.1 fonctionnent comme G41 et G42 avec en plus, la possibilité de programmer le diamètre d'outil. The mot L par défaut est à 0 si non spécifié.

source: The L number is not in the range from 0 to 9 inclusive.
fr: La valeur de L n'est pas comprise entre 0 et 9 inclus.

source: The L number is used when the XZ plane is not active.
fr: Le nombre L est utilisée alors que le plan XZ n'est pas le plan actif.

source: [[sec:G43]] == G43 Tool Length Offset (((G43 Tool Length Offset)))
fr: == G43 Activation de la compensation de longueur d'outil[[sec:G43]] (((G43 Activation de la compensation de longueur d'outil)))

source: 'H' - tool number (optional)
fr: 'H' - Numéro d'outil

source: G43 enables tool length compensation. G43 changes subsequent motions by offsetting the axis coordinates by the length of the offset. G43 does not cause any motion. The next time a compensated axis is moved, that axis's endpoint is the compensated location.
fr: G43 active la compensation de longueur d'outil. G43 modifie les mouvements ultérieurs en décalant les coordonnées de l'axe compensé, de la longueur de l'offset. G43 ne provoque aucun mouvement. La prochaine fois qu'un mouvement se produira sur l'axe compensé, le point final de ce mouvement sera l'emplacement compensé.

source: 'G43' without an H word uses the currently loaded tool from the last 'Tn M6'.
fr: 'G43' sans le mot H, utilise l'outil courant, chargé par le dernier 'Tn M6'.

source: 'G43 Hn' uses the offset for tool n.
fr: 'G43 Hn' utilise l'offset pour l'outil n.

source: [NOTE] 'G43 H0' is a little special. Its behavior is different on random tool changer machines and nonrandom tool changer machines (see the <<sec:Tool-Changers,Tool Changers>> section). On nonrandom tool changer machines, 'G43 H0' applies the TLO of the tool currently in the spindle, or a TLO of 0 if no tool is in the spindle. On random tool changer machines, 'G43 H0' applies the TLO of the tool T0 defined in the tool table file (or causes an error if T0 is not defined in the tool table).
fr: [NOTE] Particularité de 'G43 H0'. Son comportement diffère selon que le changeur d'outil est à positions aléatoires ou à positions fixes, voir le chapitre sur les <<sec:Tool-Changers,changeurs d'outil>>. Sur les machines à changeur d'outil à positions fixes, 'G43 H0' applique le TLO de l'outil couramment dans la broche, ou un TLO de 0 si aucun outil n'est dans la broche. Sur les machines à changeur d'outil à positions aléatoires, 'G43 H0' applique le TLO de l'outil T0 défini dans la table d'outils (ou provoque une erreur si T0 n'est pas défini dans la table).

source: .G43 H- Example Line ----
fr: .Exemple de ligne avec G43 H- ----

source: G43 H1 (set tool offsets using the values from tool 1 in the tool table) ----
fr: G43 H1 (ajuste les offsets d'outil avec les valeurs de l'outil 1 fournies par la table d'outils) ----

source: the H number is not an integer, or
fr: Le nombre H n'est pas un entier, ou

source: the H number is negative, or
fr: Le nombre H est négatif, ou

source: * the H number is not a valid tool number (though note that 0 is a valid tool number on nonrandom tool changer machines, it means "the tool currently in the spindle")
fr: * Le nombre H ne correspond pas à un numéro d'outil valide, il faut toutefois noter que 0 est un numéro d'outil valide sur les machines à changeur d'outil à emplacements fixes, il correspond à "l'outil courant en broche".

source: [[sec:G43_1]] == G43.1: Dynamic Tool Length Offset (((G43.1 Dynamic Tool Length Offset)))
fr: == G43.1 Compensation dynamique de longueur d'outil[[sec:G43_1]] (((G43.1 Compensation dynamique de longueur d'outil)))

source: * 'G43.1 axes' - change subsequent motions by offsetting the Z and/or X offsets stored in the tool table. G43.1 does not cause any motion. The next time a compensated axis is moved, that axis's endpoint is the compensated location.
fr: * 'G43.1 axes' - Modifie les mouvements ultérieurs en décalant les coordonnées de Z et/ou de X, selon les compensations stockées dans la table d'outils. G43.1 ne provoque aucun mouvement. L'effet de la compensation ne se produira qu'au cours du prochain mouvement des axes compensés de sorte que le point final de ce mouvement sera la position compensée.

source: .G43.1 Example ----
fr: .Exemple avec G43.1 ----

source: G90 (set absolute mode) T1 M6 G43 (load tool 1 and tool length offsets, Z is at machine 0 and DRO shows Z1.500) G43.1 Z0.250 (offset current tool offset by 0.250, DRO now shows Z1.250) M2 (end program) ----
fr: G90 (passe en mode absolu) T1 M6 G43 (charge l'outil N°1 et son offset de longueur, Z est à la position machine 0 et la visu affiche Z1.500) G43.1 Z0.250 (décale l'outil courant de 0.250, la visu affiche maintenant Z1.250) M2 (fin de programme) ----

source: See <<sec:G90-G91,G90>> & <<sec:T-Select-Tool,T>> & <<sec:M6-Tool-Change,M6>> sections for more information.
fr: Voir les sections <<sec:G90-G91,G90>> & <<sec:T-Choix-Outil,T>> et <<sec:M2-M30,M2>> pour plus d'informations.

source: motion is commanded on the same line as 'G43.1'
fr: Une commande de mouvement est sur la même ligne que 'G43.1'

source: [[sec:G43_2]] == G43.2: Apply additional Tool Length Offset (((G43.2 Apply additional Tool Length Offset)))
fr: == G43.2: Compensation additionnelle de longueur d'outil[[sec:G43_2]] (((G43.2 Compensation additionnelle de longueur d'outil)))

source: 'H' - tool number
fr: 'H' - numéro d'outil

source: G43.2 applies an additional simultaneous tool offset.
fr: G43.2 applique une compensation de longueur additionnelle simultanée.

source: .G43.2 Example ----
fr: .Exemple avec G43.2 ----

source: G90 (set absolute mode) T1 M6 (load tool 1) G43 (or G43 H1 - replace all tool offsets with T1's offset) G43.2 H10 (also add in T10's tool offset) M2 (end program) ----
fr: G90 (passe en mode absolu) T1 M6 (charge l'outil 1) G43 (ou G43 H1 - remplace toutes les compensations par celles de T1) G43.2 H10 (et les ajoute aussi aux compensations de l'outil T10) M2 (fin de programme) ----

source: You can sum together an arbitrary number of offsets by calling G43.2 more times. There are no built-in assumptions about which numbers are geometry offsets and which are wear offsets, or that you should have only one of each.
fr: Il est possible ainsi d'additionner un nombre arbitraire de compensations, en appelant plusieurs fois G43.2. Rien ne laissera supposer que les écarts sont des écarts de géométrie ou de décalages d'usure, ni que les deux sont utilisés.

source: Like the other G43 commands, G43.2 does not cause any motion. The next time a compensated axis is moved, that axis's endpoint is the compensated location.
fr: Comme les autre commandes G43, G43.2 ne provoque aucun mouvement. Lorsque le prochain mouvement de l'axe compensé se produira, le point final de ce mouvement sera l'emplacement compensé.

source: 'H' is unspecified, or
fr: 'H' n'est pas spécifié, ou

source: the given tool number does not exist in the tool table
fr: le numéro d'outil donné n'existe pas dans la table d'outils

source: [[sec:G49-Tool]] == G49: Cancel Tool Length Compensation (((G49 Cancel Tool Length Offset)))
fr: == G49 Révocation de la compensation de longueur d'outil[[sec:G49-Outil]] (((G49 Révocation de compensation de longueur d'outil)))

source: 'G49' - cancels tool length compensation
fr: 'G49' - Révoque la compensation de longueur d'outil.

source: It is OK to program using the same offset already in use. It is also OK to program using no tool length offset if none is currently being used.
fr: Ce n'est pas une erreur de programmer une compensation qui est déjà utilisée. Ce n'est pas non plus une erreur de révoquer une compensation de longueur d'outil alors qu'aucune n'est couramment utilisée.

source: [[sec:G53-Move-in]] == G53 Move in Machine Coordinates (((G53 Machine Coordinates)))
fr: == G53 Mouvement en coordonnées absolues[[sec:G53]] (((G53 Mouvement en coordonnées absolues)))

source: To move in the machine coordinate system, program 'G53' on the same line as a linear move. 'G53' is not modal and must be programmed on each line. 'G0' or 'G1' does not have to be programmed on the same line if one is currently active. For example 'G53 G0 X0 Y0 Z0' will move the axes to the home position even if the currently selected coordinate system has offsets in effect.
fr: Pour un déplacement exprimé en coordonnées système, programmer 'G53' sur la même ligne qu'un mouvement linéaire. 'G53' n'est pas modal, il doit donc être programmé sur chaque ligne où il doit être actif. 'G0' ou 'G1' ne doivent pas se trouver sur la même ligne si un d'eux est déjà actif. Par exemple, 'G53 G0 X0 Y0 Z0' va déplacer les axes à leur position d'origine même si le système de coordonnées actuel est décalé.

source: .G53 Example Line ----
fr: .Exemple avec G53 ----

source: G53 G0 X0 Y0 Z0 (rapid linear move to the machine origin) G53 X2 (rapid linear move to absolute coordinate X2) ----
fr: G53 G0 X0 Y0 Z0 (mouvement linéaire rapide des axes à leur positions d'origine) G53 X2 (mouvement linéaire rapide à la coordonnée absolue X=2) ----

source: See <<sec:G0,G0>> section for more information.
fr: Voir la section <<sec:G0,G0>> pour plus d'information.

source: G53 is used without G0 or G1 being active,
fr: 'G53' est utilisé sans que G0 ou G1 ne soit actif.

source: or G53 is used while cutter compensation is on.
fr: 'G53' est utilisé alors que la compensation d'outil est active.

source: [[sec:G54-G59_3]] == G54-G59.3 Select Coordinate System (((G54-G59.3 Select Coordinate System)))
fr: == G54 à G59.3 Choix du système de coordonnées[[sec:G54-a-G59_3]]

source: 'G54' - select coordinate system 1
fr: 'G54' - Système de coordonnées pièce 1

source: 'G55' - select coordinate system 2
fr: 'G55' - Système de coordonnées pièce 2

source: 'G56' - select coordinate system 3
fr: 'G56' - Système de coordonnées pièce 3

source: 'G57' - select coordinate system 4
fr: 'G57' - Système de coordonnées pièce 4

source: 'G58' - select coordinate system 5
fr: 'G58' - Système de coordonnées pièce 5

source: 'G59' - select coordinate system 6
fr: 'G59' - Système de coordonnées pièce 6

source: 'G59.1' - select coordinate system 7
fr: 'G59.1' - Système de coordonnées pièce 7

source: 'G59.2' - select coordinate system 8
fr: 'G59.2' - Système de coordonnées pièce 8

source: 'G59.3' - select coordinate system 9
fr: 'G59.3' - Système de coordonnées pièce 9

source: The coordinate systems store the axis values and the XY rotation angle around the Z axis in the parameters shown in the following table.
fr: Les systèmes de coordonnées stockent les valeurs des axes l'angle de rotation de XY autour de l'axe Z, dans les paramètres indiqués dans le tableau ci-dessous.

source: .Coordinate System Parameters[[cap:Coordinate-Systems]]
fr: .Paramètres des systèmes de coordonnées pièce[[sec:Coordonnees-Piece]]

source: [width="80%", options="header", cols="<,11*^"] |============================================================ |Select|CS|X |Y |Z |A |B |C |U |V |W |R |G54 |1 |5221|5222|5223|5224|5225|5226|5227|5228|5229|5230 |G55 |2 |5241|5242|5243|5244|5245|5246|5247|5248|5249|5250 |G56 |3 |5261|5262|5263|5264|5265|5266|5267|5268|5269|5270 |G57 |4 |5281|5282|5283|5284|5285|5286|5287|5288|5289|5290 |G58 |5 |5301|5302|5303|5304|5305|5306|5307|5308|5309|5310 |G59 |6 |5321|5322|5323|5324|5325|5326|5327|5328|5329|5330 |G59.1 |7 |5341|5342|5343|5344|5345|5346|5347|5348|5349|5350 |G59.2 |8 |5361|5362|5363|5364|5365|5366|5367|5368|5369|5370 |G59.3 |9 |5381|5382|5383|5384|5385|5386|5387|5388|5389|5390 |============================================================
fr: [width="80%", options="header", cols="<,11*^"] |============================================================ |Choix |CS|X |Y |Z |A |B |C |U |V |W |R |G54 |1 |5221|5222|5223|5224|5225|5226|5227|5228|5229|5230 |G55 |2 |5241|5242|5243|5244|5245|5246|5247|5248|5249|5250 |G56 |3 |5261|5262|5263|5264|5265|5266|5267|5268|5269|5270 |G57 |4 |5281|5282|5283|5284|5285|5286|5287|5288|5289|5290 |G58 |5 |5301|5302|5303|5304|5305|5306|5307|5308|5309|5310 |G59 |6 |5321|5322|5323|5324|5325|5326|5327|5328|5329|5330 |G59.1 |7 |5341|5342|5343|5344|5345|5346|5347|5348|5349|5350 |G59.2 |8 |5361|5362|5363|5364|5365|5366|5367|5368|5369|5370 |G59.3 |9 |5381|5382|5383|5384|5385|5386|5387|5388|5389|5390 |============================================================
