Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/gcode.*.po
Languages: fr

source: selecting a coordinate system is used while cutter compensation is on.
fr: Un de ces G-codes est utilisé alors que la compensation d'outil est active.

source: See the <<cha:coordinate-system,Coordinate System>> Section for an overview of coordinate systems.
fr: Étudier le chapitre sur les <<cha:Systemes-de-coordonnees,systèmes de coordonnées>> et de leurs décalages, pour bien maîtriser ces concepts.

source: [[sec:G61-G61_1]] == G61, G61.1 Exact Path Mode (((G61 G61.1 G64 Path Control)))(((Path Control)))(((Trajectory Control)))
fr: == G61, G61.1 Contrôle de trajectoire exacte[[sec:G61-G61_1]] (((G61 G61.1 Contrôle de trajectoire)))

source: * 'G61' - exact path mode. G61 visits the programmed point exactly, even though that means temporarily coming to a complete stop.
fr: * 'G61' - Met la machine en mode de trajectoire exacte. G61 suivra exactement la trajectoire programmée même si cela doit aboutir à un arrêt complet momentané du mobile.

source: 'G61.1' - exact stop mode. Same as G61
fr: 'G61.1' - Met la machine en mode arrêts exacts.

source: [[sec:G64]] == G64 Path Blending (((G64 Path Blending)))
fr: == G64 Contrôle de trajectoire continue avec tolérance[[sec:G64]] (((Contrôle de trajectoire continue avec tolérance)))

source: 'P' - motion blending tolerance
fr: 'P-' - Déviation maximale tolérée par rapport à la trajectoire programmée.

source: 'Q' - naive cam tolerance
fr: 'Q-' - Tolérance <<cha:Concepts-pour-utilisateur,naïve cam>>.

source: 'G64' - best possible speed.
fr: 'G64' - Recherche de la meilleure vitesse possible.

source: 'G64 P- <Q- >' blending with tolerance.
fr: 'G64 P- <Q->' - Mélange entre meilleure vitesse et tolérance de déviation.

source: * 'G64' - without P means to keep the best speed possible, no matter how far away from the programmed point you end up.
fr: * 'G64' - Sans P, signifie conserver la meilleure vitesse possible, quelle que soit la déviation de la trajectoire par rapport au point programmé.

source: * 'G64 P- Q-' - is a way to fine tune your system for best compromise between speed and accuracy. The P- tolerance means that the actual path will be no more than P- away from the programmed endpoint. The velocity will be reduced if needed to maintain the path. In addition, when you activate G64 P- Q- it turns on the 'naive cam detector'; when there are a series of linear XYZ feed moves at the same <<sec:F-feed-rate,feed rate>> that are less than Q- away from being collinear, they are collapsed into a single linear move. On G2/G3 moves in the G17 (XY) plane when the maximum deviation of an arc from a straight line is less than the G64 P- tolerance the arc is broken into two lines (from start of arc to midpoint, and from midpoint to end). those lines are then subject to the naive cam algorithm for lines. Thus, line-arc, arc-arc, and arc-line cases as well as line-line benefit from the 'naive cam detector'. This improves contouring performance by simplifying the path. It is OK to program for the mode that is already active. See also the <<sec:trajectory-control,Trajectory Control>> Section for more information on these modes. If Q is not specified then it will have the same behavior as before and use the value of P-.
fr: * 'G64 P- Q-' - Est le moyen d'affiner pour obtenir le meilleur compromis entre vitesse et précision de la trajectoire. La vitesse sera réduite si nécessaire pour maintenir la trajectoire, même si ça doit aboutir à un arrêt complet momentané. Le 'détecteur naïve cam' est activé. Quand il y a une série de mouvements linéaires XYZ en vitesse travail, avec une même vitesse de déplacement, inférieure à 'Q-', ils sont regroupés en un seul segment linéaire, ainsi la vitesse s'en trouve améliorée puisqu'il n'y a plus de décélération/arrêt/accélération aux points de jonction des segments. Sur les mouvements G2/G3 dans le plan 'G17' (XY) lorsque le maximum d'écart entre un arc et une ligne droite est inférieur à la déviation maximale 'P-', la tolérance de l'arc est divisée en deux lignes (depuis le début de l'arc jusqu'au milieu et du milieu jusqu'à la fin). Ces deux lignes sont ensuite soumises à l'algorithme 'naïve cam'. Ainsi, les cas ligne-arc, arc-arc et arc-ligne et le cas ligne-ligne, bénéficient de l'algorithme 'naïve cam', ce qui améliore les performances en simplifiant les trajectoires. Il est permis de programmer ce mode même si il est déjà actif. Si Q n'est pas spécifié, alors il aura le même comportement que précédemment et utilisera la valeur de P-.

source: .G64 P- Example Line ----
fr: .Exemple de ligne de programme avec G64 ----

source: G64 P0.015 (set path following to be within 0.015 of the actual path) ----
fr: G64 P0.015 (fixe la déviation d'usinage à 0.015 maximum de la trajectoire programmée) ----

source: It is a good idea to include a path control specification in the preamble of each G code file.
fr: Il est de bonne pratique de spécifier un type de contrôle de trajectoire dans le préambule de chaque programme G-code.

source: [[sec:G73-Drilling-Cycle]] == G73 Drilling Cycle with Chip Breaking (((G73 Drilling Cycle Chip Break)))
fr: == G73 Cycle de perçage avec brise copeaux[[sec:G73]] (((G73 Cycle de perçage avec brise copeaux)))

source: 'R' - retract position along the Z axis.
fr: 'R-' - Position du plan de retrait en Z

source: 'Q' - delta increment along the Z axis.
fr: 'Q-' - Incrément 'delta' parallèle à l'axe Z

source: 'L' - repeat
fr: 'L-' - Répétition

source: The 'G73' cycle is drilling or milling with chip breaking. This cycle takes a Q number which represents a 'delta' increment along the Z axis.
fr: Le cycle 'G73' est destiné au perçage profond ou au fraisage avec brise-copeaux. Ce cycle utilise la valeur 'Q-' qui représente un incrément 'delta' parallèle à l'axe Z. Le cycle se décompose de la manière suivante:

source: . Preliminary motion. ** If the current Z position is below the R position, The Z axis does a <<sec:G0,rapid move>> to the R position. ** Move to the X Y coordinates . Move the Z-axis only at the current <<sec:F-feed-rate,feed rate>> downward by delta or to the Z position, whichever is less deep. . Rapid up a bit. . Repeat steps 2 and 3 until the Z position is reached at step 2. . The Z axis does a rapid move to the R position.
fr: . Un mouvement préliminaire. ** Si la position courante en Z est sous la position R, l'axe Z effectuera un <<sec:G0,mouvement rapide>> vers R. ** Un mouvement aux coordonnées XY . Un mouvement de l'axe Z seul, en <<sec:F-Vitesse,vitesse travail>>, sur la position la moins profonde entre, l'incrément 'delta' ou la position de Z programmée. . Une petite remontée en vitesse rapide. . Répétition des étapes 2 et 3 jusqu'à ce que la position programmée de Z soit atteinte à l'étape 2. . Un mouvement de l'axe Z en vitesse rapide jusqu'au plan de retrait.

source: the Q number is negative or zero.
fr: La valeur de Q est négative ou égale à zéro.

source: the R number is not specified
fr: Le nombre R n'est pas spécifié.

source: [[sec:G76-Threading-Canned]] == G76 Threading Cycle
fr: == G76 Cycle de filetage multi-passe[[sec:G76-Filetage]]

source: (((G76 Threading)))
fr: (((G76 Cycle de filetage multi-passe)))

source: .G76 Threading[[fig:G76-Threading]]
fr: .Filetage multi-passe G76[[fig:G76-filetage]]

source: image::images/g76-threads.png[align="center"]
fr: image::images/g76-threads_fr.png[align="left"]

source: 'Drive Line' - A line through the initial X position parallel to the Z.
fr: 'Ligne pilote' - La ligne pilote est une ligne imaginaire, parallèle à l'axe de la broche (Z), partant du point initial en X et finissant au niveau de la fin du filetage.

source: 'P-' - The 'thread pitch' in distance per revolution.
fr: 'P-' - Le pas du filet en distance de déplacement par tour.

source: * 'Z-' - The final position of threads. At the end of the cycle the tool will be at this Z position.
fr: * 'Z-' - La position finale du filetage. A la fin du cycle, l'outil sera à cette position 'Z'.

source: [NOTE] When G7 'Lathe Diameter Mode' is in force the values for 'I', 'J' and 'K' are diameter measurements. When G8 'Lathe Radius Mode' is in force the values for 'I', 'J' and 'K' are radius measurements.
fr: [NOTE] En mode diamètre G7, les valeurs 'I', 'J' et 'K' sont des mesures de diamètre. En mode rayon G8, les valeurs 'I', 'J' et 'K' sont des mesures de rayon.

source: * 'I-' - The 'thread peak' offset from the 'drive line'. Negative 'I' values are external threads, and positive 'I' values are internal threads. Generally the material has been turned to this size before the 'G76' cycle.
fr: * 'I-' - La 'crête du filet' est une distance depuis la ligne pilote. Une valeur négative de 'I', indique un filetage externe et une valeur positive, indique un filetage interne. C'est généralement à cette taille nominale que le matériau est cylindré avant de commencer le cycle 'G76'.

source: * 'J-' - A positive value specifying the 'initial cut depth'. The first threading cut will be 'J' beyond the 'thread peak' position.
fr: * 'J-' - Une valeur positive, spécifie la 'profondeur de la passe initiale'. La première passe sera à 'J' au delà de la crête du filet 'I'.

source: * 'K-' - A positive value specifying the 'full thread depth'. The final threading cut will be 'K' beyond the 'thread peak' position.
fr: * 'K-' - Une valeur positive, spécifie la 'profondeur finale du filet'. La dernière passe du filetage sera à 'K' au delà de la crête du filet 'I'.

source: Optional settings
fr: Paramètres facultatifs:

source: * 'R-' - The 'depth degression'. 'R1.0' selects constant depth on successive threading passes. 'R2.0' selects constant area. Values between 1.0 and 2.0 select decreasing depth but increasing area. Values above 2.0 select decreasing area. Beware that unnecessarily high degression values will cause a large number of passes to be used. (degression = a descent by stages or steps.)
fr: * 'R-' - La 'profondeur de dégressivité'. 'R1.0' spécifie une profondeur de passe constante pour les passes successives du filetage. 'R2.0' spécifie une surface constante. Les valeurs comprises entre 1.0 et 2.0 spécifient une profondeur décroissante mais une surface croissante. Enfin, les valeurs supérieures à 2.0 sélectionnent une surface décroissante. Attention: Les valeurs inutilement hautes de dégressivité, produiront un nombre inutilement important de passes. (dégressivité = plongée par paliers)

source: * 'Q-' - The 'compound slide angle' is the angle (in degrees) describing to what extent successive passes should be offset along the drive line. This is used to cause one side of the tool to remove more material than the other. A positive 'Q' value causes the leading edge of the tool to cut more heavily. Typical values are 29, 29.5 or 30.
fr: * 'Q-' - L'angle de pénétration oblique. C'est l'angle (en degrés) décrivant de combien, les passes successives doivent être décalées le long de l'axe Z. C'est utilisé pour faire enlever plus de matériau d'un côté de l'outil que de l'autre. Une valeur positive de 'Q' fait couper d'avantage le bord avant de l'outil. Typiquement, les valeurs sont 29, 29.5 ou 30 degrés.

source: * 'H-' - The number of 'spring passes'. Spring passes are additional passes at full thread depth. If no additional passes are desired, program 'H0'.
fr: * 'H-' - Le nombre de passes de finition. Les passes de finition sont des passes additionnelles en fond de filet. Pour ne pas faire de passe de finition, programmer 'H0'.

source: * 'E-' - Specifies the distance along the drive line used for the taper. The angle of the taper will be so the last pass tapers to the thread crest over the distance specified with E.' E0.2' will give a taper for the first/last 0.2 length units along the thread. For a 45 degree taper program E the same as K
fr: * 'E-' - Spécifie la longueur des parties coniques le long de l'axe Z. L'angle du cône ira de la profondeur de la dernière passe à la crête du filet 'I'. 'E2.0' donnera un cône d'entrée et de sortie d'une longueur de 2.0 unités dans le sens du filetage. Pour un cône à 45 degrés, programmer 'E' identique à 'K'.

source: * 'L-' - Specifies which ends of the thread get the taper. Program 'L0' for no taper (the default), 'L1' for entry taper, 'L2' for exit taper, or 'L3' for both entry and exit tapers. Entry tapers will pause at the drive line to synchronize with the index pulse then move at the <<sec:F-feed-rate,feed rate>> in to the beginning of the taper. No entry taper and the tool will rapid to the cut depth then synchronize and begin the cut.
fr: * 'L-' - Spécifie quelles extrémités du filetage doivent être coniques. Programmer 'L0' pour aucune (par défaut), 'L1' pour une entrée conique, 'L2' pour une sortie conique, ou 'L3' pour l'entrée et la sortie coniques.

source: The tool is moved to the initial X and Z positions prior to issuing the G76. The X position is the 'drive line' and the Z position is the start of the threads.
fr: L'outil se déplace aux positions initiales X et Z avant le début du G76. La position X est 'la ligne pilote', la position Z est le début des filets.

source: The tool will pause briefly for synchronization before each threading pass, so a relief groove will be required at the entry unless the beginning of the thread is past the end of the material or an entry taper is used.
fr: L'outil fera une brève pause pour la synchronisation avant chaque passe de filetage. Une gorge de dégagement sera requise à l'entrée, à moins que le début du filetage ne soit après l'extrémité de la pièce ou qu'un cône d'entrée soit utilisé.

source: Unless using an exit taper, the exit move is not synchronized to the spindle speed and will be a <<sec:G0,rapid move>>. With a slow spindle, the exit move might take only a small fraction of a revolution. If the spindle speed is increased after several passes are complete, subsequent exit moves will require a larger portion of a revolution, resulting in a very heavy cut during the exit move. This can be avoided by providing a relief groove at the exit, or by not changing the spindle speed while threading.
fr: À moins d'utiliser un cône de sortie, le mouvement de sortie (retour rapide sur X initial) n'est pas synchronisé sur la vitesse de broche. Avec une broche lente, la sortie pourrait se faire sur une petite fraction de tour. Si la vitesse de broche est augmentée après qu'un certain nombre de passes soient déjà faites, la sortie va prendre une plus grande fraction de tour, il en résultera un usinage 'très brutal' pendant ce nouveau mouvement de sortie. Ceci peut être évité en prévoyant une gorge de sortie, ou en ne changeant pas la vitesse de broche pendant le filetage.

source: The final position of the tool will be at the end of the 'drive line'. A safe Z move will be needed with an internal thread to remove the tool from the hole.
fr: La position finale de l'outil sera à la fin de la 'ligne pilote'. Un mouvement de sécurité est nécessaire avec un filetage interne, pour ressortir l'outil de la pièce.

source: The active plane is not the ZX plane
fr: Le plan de travail actif n'est pas ZX.

source: Other axis words, such as X- or Y-, are specified
fr: D'autres mots d'axes que X ou Y, sont spécifiés.

source: The 'R-' degression value is less than 1.0.
fr: La dégressivité 'R' est inférieure à 1.0.

source: All the required words are not specified
fr: Tous les mots requis ne sont pas spécifiés.

source: 'P-', 'J-', 'K-' or 'H-' is negative
fr: 'P', 'J', 'K' ou 'H' est négatif.

source: 'E-' is greater than half the drive line length
fr: 'E-' est supérieur à la moitié de la longueur de la ligne pilote.

source: .HAL Connections The pins 'motion.spindle-at-speed' and the 'encoder.n.phase-Z' for the spindle must be connected in your HAL file before G76 will work. See the Integrators Manual for more information on spindle synchronized motion.
fr: .Connections de HAL Les pins 'motion.spindle-at-speed' et l'index 'encoder.n.phase-Z' doivent êtreconnectées dans le fichier HAL pour que G76 soit opérationnel.Voir le Manuel de configuration pour plus d'informations sur les mouvementssynchronisés avec la broche.

source: .Technical Info The G76 canned cycle is based on the G33 Spindle Synchronized Motion. For more information see the G33 <<g33-tech-info,Technical Info>>.
fr: .Informations techniques Le cycle multi-passe G76 est basé sur le mouvement avec broche synchronisée G33,voir les <<g33-tech-info, informations technique relatives à G33>>.

source: The sample program 'g76.ngc' shows the use of the G76 canned cycle, and can be previewed and executed on any machine using the 'sim/lathe.ini' configuration.
fr: Un programme de filetage, 'g76.ngc' montre l'utilisation d'un cycle de filetage G76, il peut être visualisé et exécuté sur n'importe quelle machine utilisant la configuration 'sim/lathe.ini'.

source: .G76 Example [source,{ngc}] ---------------
fr: .Exemple de G-Code avec G76 [source,{ngc}] ----

source: G0 Z-0.5 X0.2 G76 P0.05 Z-1 I-.075 J0.008 K0.045 Q29.5 L2 E0.045 ---------------
fr: G0 Z-0.5 X0.2 G76 P0.05 Z-1 I-0.075 J0.008 K0.045 Q29.5 L2 E0.045 ----

source: In the figure the tool is in the final position after the G76 cycle is completed. You can see the entry path on the right from the Q29.5 and the exit path on the left from the L2 E0.045. The white lines are the cutting moves.
fr: Sur l'image ci-dessous, l'outil est à la position finale après que le cycle G76 soit terminé. On voit que le parcours d'entrée de l'outil sur la droite, spécifié par Q29.5 et le parcours de sortie conique à gauche comme spécifié par L2 E0.045. Les lignes blanches sont les mouvements de coupe.

source: .G76 Example[[fig:G76-Threading-Example]]
fr: .Parcours d'outil de l'exemple[[fig:G76-cycle-de-filetage]]

source: image::images/g76-01.png[align="center"]
fr: image::images/g76-01.png[align="left"]

source: [[sec:G80-G89]] == Canned Cycles (((G80-G89 Canned Cycles)))
fr: == Les cycles de perçage G81 à G89[[sec:G81-a-G89]] (((G81-G89, Cycles de perçage)))

source: The canned cycles 'G81' through 'G89' and the canned cycle stop 'G80' are described in this section.
fr: Les cycles de perçage de 'G81' à 'G89' et la révocation de ces cycles 'G80', sont décrits dans cette section.

source: All canned cycles are performed with respect to the currently-selected plane. Any of the six planes may be selected. Throughout this section, most of the descriptions assume the XY-plane has been selected. The behavior is analogous if another plane is selected, and the correct words must be used. For instance, in the 'G17.1' plane, the action of the canned cycle is along W, and the locations or increments are given with U and V. In this case substitute U,V,W for X,Y,Z in the instructions below.
fr: Tous les cycles de perçage sont effectués dans le respect du plan de travail courant. N'importe lequel des six plans de travail peut être choisi. Dans cette section, la plupart des descriptions supposeront que le plan de travail XY est le plan courant. Le comportement reste analogue pour les autres plans de travail et les mots corrects doivent être utilisés. Par exemple, dans le plan G17.1, l'action de retrait s'effectue parallèlement à l'axe W et les positions ou incréments sont donnés avec U et W. Dans ce cas, substituer U, V, W avec X, Y, Z dans les instructions suivantes.

source: Rotary axis words are not allowed in canned cycles. When the active plane is one of the XYZ family, the UVW axis words are not allowed. Likewise, when the active plane is one of the UVW family, the XYZ axis words are not allowed.
fr: Les mots d'axes rotatifs ne sont pas autorisés dans les cycles de perçage. Quand le plan actif est X, Y, Z, les mots d'axes U, V, W ne sont pas autorisés. De même, si le plan actif est U, V, W, les mots d'axes X, Y, Z ne sont pas autorisés.

source: === Common Words
fr: === Mots communs

source: All canned cycles use X, Y, Z, or U, V, W groups depending on the plane selected and R words. The R (usually meaning retract) position is along the axis perpendicular to the currently selected plane (Z-axis for XY-plane, etc.) Some canned cycles use additional arguments.
fr: Tous les cycles de perçage utilisent les groupes X, Y, Z ou U, V, W selon le plan sélectionné, ainsi que le mot 'R'. La position de R- (signifiant retrait) est perpendiculaire au plan de travail courant (axe Z pour le plan XY, axe X pour le plan YZ, axe Y pour le plan XZ, etc.). Quelques cycles de perçage utilisent des arguments supplémentaires.

source: === Sticky Words[[sec:Cycle-Sticky-Words]]
fr: === Mots 'sticky'[[sec:Cycle-Sticky-Words]]

source: For canned cycles, we will call a number 'sticky' if, when the same cycle is used on several lines of code in a row, the number must be used the first time, but is optional on the rest of the lines. Sticky numbers keep their value on the rest of the lines if they are not explicitly programmed to be different. The R number is always sticky.
fr: Dans les cycles de perçage, un nombre est qualifié de 'sticky' (persistant, collant) si, quand le même cycle est répété sur plusieurs lignes de code en colonne, le nombre doit être indiqué la première fois, mais il devient facultatif pour le reste des lignes suivantes. Les nombres 'sticky' conservent leur valeur tant qu'ils ne sont pas explicitement programmés avec une nouvelle valeur. La valeur de R est toujours 'sticky'.

source: In incremental distance mode X, Y, and R numbers are treated as increments from the current position and Z as an increment from the Z-axis position before the move involving Z takes place. In absolute distance mode, the X, Y, R, and Z numbers are absolute positions in the current coordinate system.
fr: En mode de déplacements incrémentaux (G91), les valeurs X, Y, est R sont traitées comme des incréments depuis la position courante, Z est un incrément depuis la position de l'axe Z avant le mouvement impliquant l'axe Z. En mode de déplacements absolus, les valeurs de X, Y, R, et Z sont des positions absolues dans le système de coordonnées courant.

source: === Repeat Cycle
fr: === Répétition de cycle
