Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/gcode.*.po
Languages: fr

source: The coordinate system whose origin is set by a 'G10' command may be active or inactive at the time the 'G10' is executed. If it is currently active, the new coordinates take effect immediately.
fr: Le système de coordonnées dont l'origine est définie par la commande 'G10' peut être actif ou non au moment de l'exécution de 'G10'. Si il est actif à ce moment là, les nouvelles coordonnées prennent effet immédiatement.

source: The P number does not evaluate to an integer in the range 0 to 9.
fr: Le nombre P n'est pas évalué comme étant un nombre entier compris entre 0 et 9.

source: An axis is programmed that is not defined in the configuration.
fr: Un axe est programmé mais n'est pas défini dans la configuration.

source: .G10 L2 Example Line [source,{ngc}] ----
fr: .Premier exemple avec G10 L2: [source,{ngc}] ----

source: In the above example the origin of the first coordinate system (the one selected by 'G54') is set to be X=3.5 and Y=17.2. Because only X and Y are specified, the origin point is only moved in X and Y; the other coordinates are not changed.
fr: Place l'origine du premier système de coordonnées (celui sélectionné par G54) au points X3.5 et Y17.2 (en coordonnées absolues). La coordonnée Z de l'origine, ainsi que les coordonnées de tous les autres axes, restent inchangées puisque seuls X et Y étaient spécifiés.

source: G10 L2 P1 X0 Y0 Z0 (clear offsets for X,Y & Z axes in coordinate system 1) ----
fr: G10 L2 P1 X0 Y0 Z0 (révoque les décalages en X, Y et Z du système 1) ----

source: The above example sets the XYZ coordinates of the coordinate system 1 to the machine origin.
fr: L'exemple précédent fixe les origines XYZ du système de coordonnées G54, à l'origine machine.

source: The coordinate system is described in the <<cha:coordinate-system,Coordinate System>> Section.
fr: Les systèmes de coordonnées <<cha:Systemes-de-coordonnees, sont décrits en détail ici>>.

source: [[sec:G10-L10]] == G10 L10 Set Tool Table (((G10 L10 Set Tool Table)))
fr: == G10 L10 modifie les offsets d'outil dans la table d'outils[[sec:G10-L10]] (((G10 L10 modifie les offsets d'outil dans la table d'outils)))

source: G10 L10 changes the tool table entry for tool P so that if the tool offset is reloaded, with the machine in its current position and with the current G5x and G92 offsets active, the current coordinates for the given axes will become the given values. The axes that are not specified in the G10 L10 command will not be changed. This could be useful with a probe move as described in the <<sec:G38-probe,G38>> section.
fr: G10 L10 modifie les valeurs de l'outil P dans la table d'outils, de sorte que si la compensation d'outil est rechargée, avec la machine à la position courante et avec les G5x et G92 actifs, les coordonnées courantes pour l'axe spécifié deviendront les coordonnées spécifiées. Les axes non spécifiés dans la commande G10 L10 ne seront pas modifiés.

source: .G10 L10 Example ----
fr: .Exemple avec G10 L10: ----

source: T1 M6 G43 (load tool 1 and tool length offsets) G10 L10 P1 Z1.5 (set the current position for Z to be 1.5) G43 (reload the tool length offsets from the changed tool table) M2 (end program) ----
fr: T1 M6 G43 (appel l'outil 1 et active la correction de longueur d'outil) G10 L10 P1 Z1.5 (fixe la position courante en Z à 1.5 dans la table d'outils) G43 (recharge l'offset de longueur d'outil depuis la table d'outils modifiée) M2 (fin de programme) ----

source: See <<sec:T-Select-Tool,T>> & <<sec:M6-Tool-Change,M6>>, and <<sec:G43,G43>>/<<sec:G43_1,G43.1>> sections for more information.
fr: Pour d'autres détails voir les commandes <<sec:M6-Appel-Outil, M6>>, <<sec:T-Choix-Outil, Tn>> et <<sec:G43, G43>>/<<sec:G43_1,G43.1>>.

source: [[sec:G10-L11]] == G10 L11 Set Tool Table (((G10 L11 Set Tool Table)))
fr: == G10 L11 modifie les offsets d'outil dans la table d'outils[[sec:G10-L11]] (((G10 L11 modifie les offsets d'outil dans la table d'outils)))

source: G10 L11 is just like G10 L10 except that instead of setting the entry according to the current offsets, it is set so that the current coordinates would become the given value if the new tool offset is reloaded and the machine is placed in the G59.3 coordinate system without any G92 offset active.
fr: G10 L11 est identique à G10 L10 excepté qu'au lieux de fixer les valeurs par rapport aux décalages de coordonnées courants, il les fixe de sorte que les coordonnées courantes deviennent celles spécifiées par les paramètres si la nouvelle compensation d'outil est rechargée et que la machine est placée dans le système de coordonnées G59.3, système sans aucun décalage G92 actif.

source: This allows the user to set the G59.3 coordinate system according to a fixed point on the machine, and then use that fixture to measure tools without regard to other currently-active offsets.
fr: Ceci permet à l'utilisateur de fixer le système de coordonnées G59.3 à un point fixe de la machine et d'utiliser cet emplacement pour mesurer l'outil sans s'occuper des autres décalages courants actifs.

source: [[sec:G10-L20]] == G10 L20 Set Coordinate System (((G10 L20 Set Coordinate System)))
fr: == G10 L20 Établissement d'un système de coordonnées[[sec:G10-L20]] (((G10 L20 Établissement d'un système de coordonnées)))

source: G10 L20 is similar to G10 L2 except that instead of setting the offset/entry to the given value, it is set to a calculated value that makes the current coordinates become the given value.
fr: G10 L20 est similaire à G10 L2 excepté qu'au lieu d'ajuster les offsets à des valeurs données, il les place à des valeurs calculées de sorte que les coordonnées courantes deviennent les valeurs données en paramètres.

source: .G10 L20 Example Line ----
fr: .Exemple avec G10 L20: ----

source: G10 L20 P1 X1.5 (set the X axis current location in coordinate system 1 to 1.5) ----
fr: G10 L20 P1 X1.5 (fixe la position courante en X du système de coordonnées G54 à 1.5) ----

source: [[sec:G17-G18-G19]] == G17 - G19.1 Plane Selection (((G17 G18 G19 Plane Selection)))(((Plane Selection)))
fr: == G17 à G19.1 Choix du plan de travail[[sec:G17-G18-G19]] (((Choix du plan)))

source: These codes set the current plane as follows:
fr: Ces codes sélectionnent le plan de travail courant comme décrit ci-dessous:

source: 'G17' - XY (default)
fr: 'G17' - XY (par défaut)

source: The UV, WU and VW planes do not support arcs.
fr: Les plans UV, WU et VW ne supportent pas les arcs.

source: It is a good idea to include a plane selection in the preamble of each G code file.
fr: Il est de bonne pratique d'inclure la sélection du plan de travail dans le préambule du programme G-code.

source: The effects of having a plane selected are discussed in Section <<sec:G2-G3-Arc,G2 G3>> and Section <<sec:G80-G89,G81 G89>>
fr: Les effets de la sélection d'un plan de travail sont discutés dans la section <<sec:G2-G3, sur les arcs>>.

source: [[sec:G20-G21-Units]] == G20, G21 Units (((G20 Inches)))(((G21 Millimeters)))
fr: == G20, G21 Choix des unités machine[[sec:G20-G21]] (((G20 Pouce)))(((G21 Millimètre)))

source: 'G20' - to use inches for length units.
fr: 'G20' - pour utiliser le pouce comme unité de longueur.

source: 'G21' - to use millimeters for length units.
fr: 'G21' - pour utiliser le millimètre comme unité de longueur.

source: It is a good idea to include units in the preamble of each G code file.
fr: C'est toujours une bonne pratique de programmer soit 'G20', soit 'G21', dans le préambule de chaque programme.

source: [[sec:G28-G28_1]] == G28, G28.1 Go to Predefined Position (((G28)))
fr: == G28, G28.1 Aller à une position prédéfinie[[sec:G28-G28_1]] (((G28)))

source: [WARNING] Only use G28 when your machine is homed to a repeatable position and the desired G28 position has been stored with G28.1.
fr: [WARNING] Utiliser G28 seulement après la POM sur une position répétable et que la position G28 souhaitée ait été correctement enregistrée avec G28.1.

source: G28 uses the values stored in <<sub:numbered-parameters,parameters>> 5161-5166 as the X Y Z A B C U V W final point to move to. The parameter values are 'absolute' machine coordinates in the native machine 'units' as specifed in the ini file. All axes defined in the ini file will be moved when a G28 is issued.
fr: G28 utilise les valeurs enregistrées dans les <<sec:Parametres-Numerotes,paramètres>> 5161 à 5166 comme points finaux des mouvements des axes X Y Z A B C U V W. Les valeurs des paramètres sont des coordonnées machine 'absolues', en unités machine natives, telles que spécifiées dans le fichier ini. Tous les axes définis dans le fichier ini seront déplacés lors d'un G28.

source: 'G28' - makes a <<sec:G0,rapid move>> from the current position to the 'absolute' position of the values in parameters 5161-5166.
fr: 'G28' - effectue un mouvement en <<sec:G0,vitesse rapide>> de la position courante à la position 'absolue' enregistrée dans les paramètres 5161 à 5166.

source: 'G28 axes' - makes a <<sec:G0,rapid move>> to the position specified by 'axes' including any offsets, then will make a rapid move to the 'absolute' position of the values in parameters 5161-5166 for 'axes' specified. Any 'axis' not specified will not move.
fr: 'G28 axes' - effectue un déplacement en <<sec:G0,vitesse rapide>> à la position spécifiée par 'axes' y compris les décalages, puis effectuera un mouvement en vitesse rapide aux coordonnées 'absolues' contenues dans les paramètres 5161 à 5166 pour les axes spécifiés.

source: 'G28.1' - stores the current 'absolute' position into parameters 5161-5166.
fr: 'G28.1' - enregistre la position 'absolue' courante dans les paramètres 5161 à 5166.

source: .G28 Example Line ----
fr: .Exemple avec G28 ----

source: G28 Z2.5 (rapid to Z2.5 then to location specified in the G28 stored parameters) ----
fr: G28 Z2.5 (vitesse rapide vers Z2.5 puis emplacement spécifié dans les paramètres enregistrés de G28) ----

source: It is an error if :
fr: C'est une erreur si:

source: Cutter Compensation is turned on
fr: La compensation d'outil est active.

source: [[sec:G30-G30_1]] == G30, G30.1 Go to Predefined Position (((G30)))
fr: == G30, G30.1 Aller à une position prédéfinie[[sec:G30-G30_1]] (((G30)))

source: [WARNING] Only use G30 when your machine is homed to a repeatable position and the desired G30 position has been stored with G30.1.
fr: [WARNING] Utiliser G30 seulement après la POM sur une position répétable et que la position G30 souhaitée ait été correctement enregistrée avec G30.1.

source: G30 functions the same as G28 but uses the values stored in <<sub:numbered-parameters,parameters>> 5181-5186 as the X Y Z A B C U V W final point to move to. The parameter values are 'absolute' machine coordinates in the native machine 'units' as specifed in the ini file. All axes defined in the ini file will be moved when a G30 is issued.
fr: G30 fonctionne comme G28 mais utilise les valeurs enregistrées dans les <<sec:Parametres-Numerotes, paramètres numérotés>> 5181 à 5186 comme points finaux des axes X Y Z A B C U V W. Les valeurs des paramètres sont des coordonnées machine 'absolues', en unités machine natives, telles que spécifiées dans le fichier ini. Tous les axes définis dans le fichier ini seront déplacés lors d'un G30.

source: [NOTE] G30 parameters will be used to move the tool when a M6 is programmed if [TOOL_CHANGE_AT_G30]=1 is in the [EMCIO] section of the ini file.
fr: [NOTE] Les paramètres de G30 peuvent être utilisés pour déplacer l'outil quand un M6 est programmé avec la variable [TOOL_CHANGE_AT_G30]=1 dans la section [EMCIO] du fichier ini.

source: 'G30' - makes a <<sec:G0,rapid move>> from the current position to the 'absolute' position of the values in parameters 5181-5186.
fr: 'G30' - effectue un mouvement en <<sec:G0,vitesse rapide>> de la position courante à la position 'absolue' stockée dans les paramètres 5181 à 5186.

source: 'G30 axes' - makes a <<sec:G0,rapid move>> to the position specified by 'axes' including any offsets, then will make a rapid move to the 'absolute' position of the values in parameters 5181-5186 for 'axes' specified. Any 'axis' not specified will not move.
fr: 'G30 axes' - effectue un déplacement en vitesse rapide depuis la position courante jusqu'à la position spécifiée par 'axes', y compris les décalages, suivi d'un mouvement rapide à la position 'absolue' stockée dans les paramètres 5181 à 5186 pour les axes spécifiés. Les axes non spécifiés ne bougeront pas.

source: 'G30.1' - stores the current absolute position into parameters 5181-5186.
fr: 'G30.1' - enregistre la position absolue courante dans les paramètres 5181 à 5186.

source: .G30 Example Line ----
fr: .Exemple avec G30 ----

source: G30 Z2.5 (rapid to Z2.5 then to the location specified in the G30 stored parameters) ----
fr: G30 Z2.5 (mvt rapide à Z2.5 puis déplacement selon les paramètres de G30 stockés) ----

source: [[sec:G33-Spindle-Sync]] == G33 Spindle Synchronized Motion (((G33 Spindle Synchronized Motion)))
fr: == G33 Mouvement avec broche synchronisée[[sec:G33]] (((G33 Mouvement avec broche synchronisée)))

source: 'K' - distance per revolution
fr: 'K' - distance par tour

source: For spindle-synchronized motion in one direction, code 'G33 X- Y- Z- K-' where K gives the distance moved in XYZ for each revolution of the spindle. For instance, if starting at 'Z=0', 'G33 Z-1 K.0625' produces a 1 inch motion in Z over 16 revolutions of the spindle. This command might be part of a program to produce a 16TPI thread. Another example in metric, 'G33 Z-15 K1.5' produces a movement of 15mm while the spindle rotates 10 times for a thread of 1.5mm.
fr: Pour un mouvement avec broche synchronisée dans une direction, programmer 'G33 X- Y- Z- K-' où K donne la longueur du mouvement en XYZ pour chaque tour de broche. Par exemple, si il commence à 'Z=0', 'G33 Z-1 K.0625' produira un mouvement d'un pouce de long en Z en même temps que 16 tours de broche. Cette commande peut être la base d'un programme pour faire un filetage de 16 filets par pouce. Un autre exemple en métrique, 'G33 Z-15 K1.5' produira un mouvement de 15mm de long pendant que la broche fera 10 tours soit un pas de 1.5mm.

source: Spindle-synchronized motion waits for the spindle index and spindle at speed pins, so multiple passes line up. 'G33' moves end at the programmed endpoint. G33 could be used to cut tapered threads or a fusee.
fr: Les mouvements avec broche synchronisée utilisent les pins de Hal de l'index broche et de 'spindle at speed' pour le filetage multi-passes. Un mouvement avec 'G33' se termine au point final programmé.

source: All the axis words are optional, except that at least one must be used.
fr: Tous les mots d'axe sont facultatifs, excepté celui qui sera utilisé.

source: [NOTE] K follows the drive line described by 'X- Y- Z-'. K is not parallel to the Z axis if X or Y endpoints are used for example when cutting tapered threads.
fr: [NOTE] K suit la ligne d'avance décrite par 'X- Y- Z-'. K n'est pas parallèle à l'axe Z si les points d'arrivée des axes X et Y sont utilisés, par exemple pour réaliser un filetage conique.

source: .Technical Info[[g33-tech-info]] At the beginning of each G33 pass, LinuxCNC uses the spindle speed and the machine acceleration limits to calculate how long it will take Z to accelerate after the index pulse, and determines how many degrees the spindle will rotate during that time. It then adds that angle to the index position and computes the Z position using the corrected spindle angle. That means that Z will reach the correct position just as it finishes accelerating to the proper speed, and can immediately begin cutting a good thread.
fr: .Informations techniques[[g33-tech-info]] Au début de chaque passe G33, LinuxCNC utilise la vitesse de broche et les limites d'accélération de la machine pour calculer combien de temps prendra Z pour accélérer après chaque impulsion d'index et détermine de combien de degrés la broche tournera pendant ce temps là. Il ajoute alors cet angle à la position de l'index puis calcule la position de Z utilisant l'angle de broche correct. Cela signifie que Z aura atteints la position correcte juste en fin d'accélération à la bonne vitesse, il peux immédiatement usiner le bon filetage.

source: .HAL Connections The pins 'motion.spindle-at-speed' and the 'encoder.n.phase-Z' for the spindle must be connected in your HAL file before G33 will work. See the Integrators Manual for more information on spindle synchronized motion.
fr: .Connections de hAL Les pins 'motion.spindle-at-speed' et l'index 'encoder.n.phase-Z' pour la broche doivent être connectés dans le fichier HAL pour que G33 soit opérationnel. Voir le Manuel de configuration pour plus d'informations sur les mouvements synchronisés avec la broche.

source: .G33 Example ----
fr: .Exemple avec G33: [source,{ngc}] ----

source: G90 (absolute distance mode) G0 X1 Z0.1 (rapid to position) S100 M3 (start spindle turning) G33 Z-2 K0.125 (move Z axis to -2 at a rate to equal 0.125 per revolution) G0 X1.25 (rapid move tool away from work) Z0.1 (rapid move to starting Z position) M2 (end program) ----
fr: G90 (mode distance absolue) G0 X1 Z0.1 (positionnement en vitesse rapide) S100 M3 (broche en rotation à 100tr/mn) G33 Z-2 K0.125 (mouvement vers Z -2 avec une avance de 0.125 par tour) G0 X1.25 (mouvement de dégagement en vitesse rapide) Z0.1 (mouvement en vitesse rapide à Z0.1) M2 (fin de programme) ----

source: See <<sec:G90-G91,G90>> & <<sec:G0,G0>> & <<sec:M2-M30,M2>> sections for more information.
fr: Voir les sections <<sec:G90-G91,G90>>, <<sec:G0,G0>> et <<sec:M2-M30,M2>> pour plus d'informations.

source: All axis words are omitted.
fr: Tous les axes sont omis.

source: The spindle is not turning when this command is executed
fr: La broche ne tourne pas quand cette commande est exécutée.

source: * The requested linear motion exceeds machine velocity limits due to the spindle speed
fr: * Le mouvement linéaire requis excède les limites de vitesse machine en raison de la vitesse de broche.

source: [[sec:G33_1-Rigid-Tapping]] == G33.1 Rigid Tapping (((G33.1 Rigid Tapping)))
fr: == G33.1 Taraudage Rigide[[sec:G33_1]] (((G33.1 Taraudage rigide)))

source: For rigid tapping (spindle synchronized motion with return), code 'G33.1 X- Y- Z- K-' where 'K-' gives the distance moved for each revolution of the spindle. A rigid tapping move consists of the following sequence:
fr: Pour un taraudage rigide avec broche synchronisée et mouvement de retour, programmer 'G33.1 X- Y- Z- K-' où 'K-' donne la longueur du mouvement pour chaque tour de broche. Un mouvement de taraudage rigide suit cette séquence:

source: [WARNING] If the X Y coordinates specified are not the current coordinates when calling G33.1 for tapping the move will not be along the Z axis but will <<sec:G0,rapid move>> from the current location to the X Y location specified.
fr: [WARNING] Si pour un taraudage rigide, les coordonnées X et Y spécifiées ne sont pas les coordonnées courantes lors de l'appel de G33.1, le mouvement ne s'effectuera pas le long de l'axe Z mais de la position courante jusqu'aux coordonnées X et Y spécifiées.

source: . A move to the specified coordinate, synchronized with the spindle at the given ratio and starting with a spindle index pulse. . When reaching the endpoint, a command to reverse the spindle (e.g., from clockwise to counterclockwise). . Continued synchronized motion beyond the specified end coordinate until the spindle actually stops and reverses. . Continued synchronized motion back to the original coordinate. . When reaching the original coordinate, a command to reverse the spindle a second time (e.g., from counterclockwise to clockwise). . Continued synchronized motion beyond the original coordinate until the spindle actually stops and reverses. . An *unsynchronized* move back to the original coordinate.
fr: . Un mouvement aux coordonnées spécifiées, synchronisé avec la rotation de la broche, avec le ratio donné et débutant à l'impulsion d'index du codeur de broche. . Quand le point final est atteint, la commande inverse le sens de rotation de la broche (ex: de 300 tours/mn en sens horaire à 300 tours/mn en sens anti-horaire) . Le mouvement reste synchronisé en continu avec la broche, même 'au delà' de la coordonnée du point final spécifié pendant l'arrêt de la broche et son inversion. . Le mouvement synchronisé se poursuit pour revenir aux coordonnées initiales. . Quand les coordonnées initiale sont atteintes, la commande inverse la broche une seconde fois (ex: de 300tr/mn sens anti-horaire à 300tr/mn en sens horaire) . Le mouvement reste synchronisé même 'au delà' des coordonnées initiales pendant que la broche s'arrête, puis s'inverse. . Un mouvement 'non synchronisé' ramène le mobile en arrière, aux coordonnées initiales.

source: Spindle-synchronized motions wait for spindle index, so multiple passes line up. 'G33.1' moves end at the original coordinate.
fr: Tous les mouvements avec broche synchronisée ont besoin d'un index de broche, pour conserver la trajectoire prévue et que les passes se chevauchent exactement. Un mouvement avec 'G33.1' se termine aux coordonnées initiales.

source: .G33.1 Example [source,{ngc}] ----
fr: .Exemple avec G33.1 [source,{ngc}] ----

source: G90 (set absolute mode) G0 X1.000 Y1.000 Z0.100 (rapid move to starting position) G33.1 Z-0.750 K0.05 (rigid tap a 20 TPI thread 0.750 deep) M2 (end program) ----
fr: G90 (mode distance absolue) G0 X1.000 Y1.000 Z0.100 (mouvement rapide au point de départ taraudage rigide en 20 filets par pouce) G33.1 Z-0.750 K0.05 (et une profondeur de filet de 0.750) M2 (fin de programme) ----

source: * The requested linear motion exceeds machine velocity limits due to the spindle speed
fr: * Le mouvement linéaire requis excède les limites de vitesse machine en raison d'une vitesse de broche trop élevée.

source: [[sec:G38-probe]] == G38.x Straight Probe (((G38.x Probe)))
fr: == G38.x Mesure au palpeur[[sec:G38-x-Palpeur]] (((G38.x Palpeur)))

source: 'G38.2' - probe toward workpiece, stop on contact, signal error if failure
fr: 'G38.2' - palpe vers la pièce, stoppe au toucher, signale une erreur en cas de défaut.

source: 'G38.3' - probe toward workpiece, stop on contact
fr: 'G38.3' - palpe vers la pièce, stoppe au toucher.

source: 'G38.4' - probe away from workpiece, stop on loss of contact, signal error if failure
fr: 'G38.4' - palpe en quittant la pièce, stoppe en perdant le contact, signale une erreur en cas de défaut.

source: 'G38.5' - probe away from workpiece, stop on loss of contact
fr: 'G38.5' - palpe en quittant la pièce, stoppe en perdant le contact.

source: [IMPORTANT] You will not be able to use a probe move until your machine has been set up to provide a probe input signal. The probe input signal must be connected to 'motion.probe-input' in a .hal file. G38.x uses motion.probe-input to determine when the probe has made (or lost) contact. TRUE for probe contact closed (touching), FALSE for probe contact open.
fr: [IMPORTANT] Cette commande n'est pas utilisable si la machine n'a pas été configurée pour exploiter un signal de sonde entre HAL et LinuxCNC. Le signal de la sonde doit être envoyé sur une broche d'entrée puis transmis à 'motion.probe-input'. G38.x utilise la valeur de cette broche pour déterminer quand la sonde a touché ou perdu le contact. TRUE si le contact de la sonde est fermé (Touché), FALSE si il est ouvert.
