Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/gcode.*.po
Languages: fr

source: 'Y' - helix
fr: 'Y' - hélicoïde

source: 'K' - Z offset
fr: 'K' - décalage en Z

source: G2 or G3 <Y- Z- X- J- K- P-> ----
fr: G2 ou G3 <Y- Z- X- J- K- P-> ----

source: 'X' - helix
fr: 'X' - hélicoïde

source: No feed rate is set with the <<sec:F-feed-rate,F>> word.
fr: Aucune vitesse d'avance travail n'est fixée avec <<sec:F-Vitesse,le mot F>>.

source: No offsets are programmed.
fr: Aucun décalage n'est programmé.

source: When the arc is projected on the selected plane, the distance from the current point to the center differs from the distance from the end point to the center by more than (.05 inch/.5 mm) OR ((.0005 inch/.005mm) AND .1% of radius).
fr: Quand l'arc est projeté dans le plan courant, la distance depuis le point courant et le centre diffère de la distance entre le point final et le centre, de plus de (.05 pouce/.5 mm) OU ((.0005 pouce/.005mm) ET .1% du rayon).

source: Deciphering the Error message 'Radius to end of arc differs from radius to start:'
fr: Déchiffrer le message d'erreur 'Le rayon à la fin de l'arc diffère de celui du début:'

source: 'start' - the current position
fr: 'début' - position courante

source: 'center' - the center position as calculated using the i, j, or k words
fr: 'centre' - la position du centre telle que calculée avec les paramètres I,J ou K

source: 'end' - the programmed end point
fr: 'fin' - le point final programmé

source: 'r1' - radius from the start position to the center
fr: 'r1' - le rayon entre le point de départ et le centre

source: 'r2' - radius from the end position to the center
fr: 'r2' - le rayon entre le point final et le centre

source: === Center Format Examples
fr: === Exemples d'arcs au format centre

source: Calculating arcs by hand can be difficult at times. One option is to draw the arc with a cad program to get the coordinates and offsets. Keep in mind the tolerance mentioned above, you may have to change the precision of your cad program to get the desired results. Another option is to calculate the coordinates and offset using formulas. As you can see in the following figures a triangle can be formed from the current position the end position and the arc center.
fr: Calculer des arcs à la main peut être difficile. Il est possible de dessiner l'arc à l'aide d'un programme de DAO pour obtenir les coordonnées et les décalages. Garder à l'esprit les tolérances, il pourrait être nécessaire de modifier la précision de la DAO pour obtenir les résultats souhaités. Une autre option consiste à calculer les coordonnées et les décalages en utilisant des formules. Comme vous pouvez le voir sur la figure suivante un triangle peut être formé à partir de la position courante, de la position de fin et du centre de l'arc.

source: In the following figure you can see the start position is X0 Y0, the end position is X1 Y1. The arc center position is at X1 Y0. This gives us an offset from the start position of 1 in the X axis and 0 in the Y axis. In this case only an I offset is needed.
fr: Sur la figure suivante, vous voyez que la position de départ est X0 Y0, la position finale est X1 Y1. La position du centre de l'arc est X1 Y0. Ceci donne un décalage de 1 depuis la position de départ sur l'axe X et 0 sur l'axe Y. Dans ce cas seul le décalage I est nécessaire.

source: .G2 Example Line [source,{ngc}] ----
fr: .Le G-code de cet exemple serait: [source,{ngc}] ----

source: G0 X0 Y0 G2 X1 Y1 I1 F10 (clockwise arc in the XY plane) ----
fr: G0 X0 Y0 G2 X1 Y1 I1 F10 (arc en sens horaire dans le plan XY) ----

source: .G2 Example[[fig:G2-Example]]
fr: .Exemple avec G2[[fig:G2-Exemple]]

source: image::images/g2.png[align="center"]
fr: image::images/g2_fr.png[align="left"]

source: In the next example we see the difference between the offsets for Y if we are doing a G2 or a G3 move. For the G2 move the start position is X0 Y0, for the G3 move it is X0 Y1. The arc center is at X1 Y0.5 for both moves. The G2 move the J offset is 0.5 and the G3 move the J offset is -0.5.
fr: Dans cet autre exemple, nous pouvons voir les différences de décalages pour Y selon que nous faisons un mouvement G2 ou un mouvement G3. Pour le mouvement G2 la position de départ est en X0 Y0, alors que pour le mouvement G3 elle est en X0 Y1. Le centre de l'arc est en X1 Y0.5 pour les deux. Le décalage J du mouvement G2 est 0.5 alors que celui du mouvement G3 est -0.5.

source: .G2-G3 Example Line [source,{ngc}] ----
fr: .Le G-code de cet exemple serait: [source,{ngc}] ----

source: G0 X0 Y0 G2 X0 Y1 I1 J0.5 F25 (clockwise arc in the XY plane) G3 X0 Y0 I1 J-0.5 F25 (counterclockwise arc in the XY plane) ----
fr: G0 X0 Y0 G2 X0 Y1 I1 J0.5 F25 (arc en sens horaire dans le plan XY) G3 X0 Y0 I1 J-0.5 F25 (arc en sens anti-horaire dans le plan XY) ----

source: .G2-G3 Example[[fig:G2-G3-Example]]
fr: .Exemple avec G2-G3[[fig:G2-G3-Exemple]]

source: image::images/g2-3.png[align="center"]
fr: image::images/g2-3_fr.png[align="left"]

source: In the next example we show how the arc can make a helix in the Z axis by adding the Z word.
fr: L'exemple suivant montre comment faire une arc faisant une hélicoïde en Z par l'ajout d'un mot Z.

source: .G2 Example Helix [source,{ngc}] ----
fr: .Exemple au format centre pour usiner une hélice: [source,{ngc}] ----

source: G0 X0 Y0 Z0 G17 G2 X10 Y16 I3 J4 Z-1 (helix arc with Z added) ----
fr: G0 X0 Y0 Z0 G17 G2 X10 Y16 I3 J4 Z-1 (Arc hélicoïdal avec ajout de Z) ----

source: In the next example we show how to make more than one turn using the P word.
fr: L'exemple suivant montre comment faire plus d'un tour en utilisant le mot P.

source: .P word Example ----
fr: .exemple avec mot P ----

source: In the center format, the radius of the arc is not specified, but it may be found easily as the distance from the center of the circle to either the current point or the end point of the arc.
fr: Dans le format centre, le rayon de l'arc n'est pas spécifié, mais il peut facilement être trouvé puisque c'est la distance entre le point courant et le centre du cercle, ou le point final de l'arc et le centre.

source: === Radius Format Arcs
fr: === Arcs au format rayon (format non recommandé)

source: G2 or G3 axes R- ----
fr: G2 ou G3 axes R- ----

source: 'R' - radius from current position
fr: R - rayon depuis la position courante

source: It is not good practice to program radius format arcs that are nearly full circles or nearly semicircles because a small change in the location of the end point will produce a much larger change in the location of the center of the circle (and, hence, the middle of the arc). The magnification effect is large enough that rounding error in a number can produce out-of-tolerance cuts. For instance, a 1% displacement of the endpoint of a 180 degree arc produced a 7% displacement of the point 90 degrees along the arc. Nearly full circles are even worse. Other size arcs (in the range tiny to 165 degrees or 195 to 345 degrees) are OK.
fr: Ce n'est pas une bonne pratique de programmer au format rayon des arcs qui sont presque des cercles entiers ou des demi-cercles, car un changement minime dans l'emplacement du point d'arrivée va produire un changement beaucoup plus grand dans l'emplacement du centre du cercle (et donc, du milieu de l'arc). L'effet de grossissement est tellement important, qu'une erreur d'arrondi peut facilement produire un usinage hors tolérance. Par exemple, 1% de déplacement de l'extrémité d'un arc de 180 degrés produit 7% de déplacement du point situé à 90 degrés le long de l'arc. Les cercles presque complets sont encore pires. Autrement, l'usinage d'arcs, inférieurs à 165 degrés ou compris entre 195 et 345 degrés sera possible.

source: In the radius format, the coordinates of the end point of the arc in the selected plane are specified along with the radius of the arc. Program 'G2' 'axes' 'R-' (or use 'G3' instead of 'G2' ). R is the radius. The axis words are all optional except that at least one of the two words for the axes in the selected plane must be used. The R number is the radius. A positive radius indicates that the arc turns through less than 180 degrees, while a negative radius indicates a turn of more than 180 degrees. If the arc is helical, the value of the end point of the arc on the coordinate axis parallel to the axis of the helix is also specified.
fr: Dans le format rayon, les coordonnées du point final de l'arc, dans le plan choisi, sont spécifiées en même temps que le rayon de l'arc. Programmer 'G2' 'axes' 'R-' (ou utiliser 'G3' au lieu de 'G2' ). R est le rayon. Les mots d'axes sont facultatifs sauf au moins un des deux du plan choisi, qui doit être utilisé. Un rayon positif indique que l'arc fait moins de 180 degrés, alors qu'un rayon négatif indique un arc supérieur à 180 degrés. Si l'arc est hélicoïdal, la valeur du point d'arrivée de l'arc dans les coordonnées de l'axe perpendiculaire au plan choisi sera également spécifiée.

source: both of the axis words for the axes of the selected plane are omitted
fr: Les deux mots d'axes pour le plan choisi sont omis.

source: the end point of the arc is the same as the current point.
fr: Le point d'arrivée de l'arc est identique au point courant.

source: G17 G2 X10 Y15 R20 Z5 (radius format with arc) ----
fr: G17 G2 X10 Y15 R20 Z5 (arc au format rayon) ----

source: The above example makes a clockwise (as viewed from the positive Z-axis) circular or helical arc whose axis is parallel to the Z-axis, ending where X=10, Y=15, and Z=5, with a radius of 20. If the starting value of Z is 5, this is an arc of a circle parallel to the XY-plane; otherwise it is a helical arc.
fr: Cet exemple signifie, faire un mouvement en arc ou hélicoïdal en sens horaire (vu du côté positif de l'axe Z), se terminant en X=10, Y=15 et Z=5, avec un rayon de 20. Si la valeur de départ de Z est 5, ce sera un arc de cercle parallèle au plan XY sinon, ce sera un arc hélicoïdal.

source: [[sec:G4-Dwell]] == G4 Dwell (((G4 Dwell)))
fr: == G4 Tempo[[sec:G4-Tempo]] (((G4 Temporisation)))

source: 'P' - seconds to dwell (floating point)
fr: 'P' - durée de la temporisation en secondes (un flottant)

source: The P number is the time in seconds that all axes will remain unmoving. The P number is a floating point number so fractions of a second may be used. G4 does not affect spindle, coolant and any I/O.
fr: Les axes s'immobiliseront pour une durée de P secondes. Le nombre P est un nombre à virgule flottante, ainsi les fractions de seconde peuvent être utilisées. Cette commande n'affecte pas la broche, les arrosages ni les entrées/sorties.

source: .G4 Example Line ----
fr: .Exemple de ligne avec G4 ----

source: G4 P0.5 (wait for 0.5 seconds before proceeding) ----
fr: G4 P0.5 (attends 0.5 seconde avant de continuer) ----

source: the P number is negative or not specified.
fr: Le nombre P est négatif ou n'est pas spécifié.

source: [[sec:G5-Cubic-Spline]] == G5 Cubic spline (((G5 Cubic spline)))
fr: == G5 Spline cubique[[sec:G5-Cubic-Spline]] (((G5 Cubic spline)))

source: 'I' - X incremental offset from start point to first control point
fr: 'I' - offset incrémental en X, du point de départ au premier point de contrôle

source: 'J' - Y incremental offset from start point to first control point
fr: 'J' - offset incrémental en Y, du point de départ au premier point de contrôle

source: 'P' - X incremental offset from end point to second control point
fr: 'P' - offset incrémental en X, du point de départ au second point de contrôle

source: 'Q' - Y incremental offset from end point to second control point
fr: 'Q' - offset incrémental en Y, du point de départ au second point de contrôle

source: G5 creates a cubic B-spline in the XY plane with the X and Y axes only. P and Q must both be specified for every G5 command.
fr: G5 crée une B-spline cubique dans le plan XY avec les axes X et Y seuls. P et Q doivent être tous les deux spécifiés pour chaque commande G5.

source: For the first G5 command in a series of G5 commands, I and J must both be specified. For subsequent G5 commands, either both I and J must be specified, or neither. If I and J are unspecified, the starting direction of this cubic will automatically match the ending direction of the previous cubic (as if I and J are the negation of the previous P and Q).
fr: Pour la première d'une série de commandes G5, I et J doivent être tous les deux spécifiés. Pour les commandes G5 suivantes de la série, soit I et J sont spécifiés tous les deux, soit aucun ne l'est. Si aucun n'est spécifié, la direction de départ de ce cube rejoindra automatiquement la direction de fin du cube précédent (comme si I et J étaient les négatifs des P et Q précédents).

source: For example, to program a curvy N shape:
fr: Par exemple, pour programmer une courbe en forme de N:

source: .G5 Sample initial cubic spline ----
fr: .G5 Simple spline cubique initiale ----

source: A second curvy N that attaches smoothly to this one can now be made without specifying I and J:
fr: Une seconde courbe en N qui s'attache doucement à celle-ci peux maintenant être faite sans spécifier I et J:

source: .G5 Sample subsequent cubic spline ----
fr: .G5 Simple spline cubique subséquente ----

source: P and Q are not both specified
fr: P et Q ne sont pas spécifiés tous les deux

source: Just one of I or J are specified
fr: Un seul, de I ou J est spécifié

source: I or J are unspecified in the first of a series of G5 commands
fr: Aucun de I ou J n'est spécifié à la première série de commandes G5

source: An axis other than X or Y is specified
fr: Un axe autre que X ou Y est spécifié

source: The active plane is not G17
fr: Le plan courant n'est pas G17

source: [[sec:G5_1-Quadratic-Spline]] == G5.1 Quadratic spline (((G5.1 Quadratic spline)))
fr: == G5.1 Spline quadratique[[sec:G5_1-Quadratic-Spline]] (((G5.1 Quadratic spline)))

source: 'I' - X incremental offset from start point to control point
fr: 'I' - Offset incrémental en X, du point de départ au point contrôlé

source: 'J' - Y incremental offset from start point to control point
fr: 'J' - Offset incrémental en Y, du point de départ au point contrôlé

source: G5.1 creates a quadratic B-spline in the XY plane with the X and Y axis only. Not specifying I or J gives zero offset for the unspecified axis, so one or both must be given.
fr: G5.1 crée une B-spline quadratique dans le plan XY avec les seuls axes X et Y. Ne pas spécifier I ou J donne un offset nul pour l'axe non spécifié, un ou les deux doivent donc être donnés.

source: For example, to program a parabola, through the origin, from X-2 Y4 to X2 Y4:
fr: Par exemple, pour programmer une parabole, entre l'origine X-2 Y4 et X2 Y4:

source: .G5.1 Sample quadratic spline ----
fr: .Simple spline quadratique avec G5.1 ----

source: both I and J offset are unspecified or zero
fr: Les offsets I et J ne sont pas spécifiés ou sont à zéro

source: [[sec:G5_2-G5_3-NURBS]] == G5.2 G5.3 NURBS Block (((G5.2 G5.3 NURBS Block)))
fr: == G5.2 G5.3 Block NURBS[[sec:G5_2-G5_3-NURBS]] (((G5.2 G5.3 NURBS Block)))

source: Warning: G5.2, G5.3 is experimental and not fully tested.
fr: WARNING: G5.2, G5.3 sont expérimentaux, il n'ont pas encore été testés totalement.

source: G5.2 is for opening the data block defining a NURBS and G5.3 for closing the data block. In the lines between these two codes the curve control points are defined with both their related 'weights' (P) and the parameter (L) which determines the order of the curve.
fr: G5.2 est pour ouvrir un bloc de données définissant un NURBS et G5.3 pour fermer le bloc de données. Dans les lignes entre ces deux codes, les points de contrôle de la courbe sont définis avec deux éléments, leur 'poids' relatif (P) et le paramètre (L) qui détermine l'ordre de la courbe.

source: The current coordinate, before the first G5.2 command, is always taken as the first NURBS control point. To set the weight for this first control point, first program G5.2 P- without giving any X Y.
fr: Les coordonnées courantes, avant la première commande G5.2, est toujours prise comme premier point de contrôle du NURBS. Pour définir le poids pour le premier point de contrôle, premièrement programmer G5.2 P- sans donner X ni Y.

source: The default weight if P is unspecified is 1. The default order if L is unspecified is 3.
fr: Le poids par défaut si P n'est pas spécifié est 1. L'ordre par défaut si L n'est pas spécifié est 3.

source: .G5.2 Example [source,{ngc}] ----
fr: .Exemple avec G5.2 [source,{ngc}] ----

source: G0 X0 Y0 (rapid move) F10 (set feed rate) G5.2 P1 L3 X0 Y1 P1 X2 Y2 P1 X2 Y0 P1 X0 Y0 P2 G5.3 ; The rapid moves show the same path without the NURBS Block G0 X0 Y1 X2 Y2 X2 Y0 X0 Y0 M2 ----
fr: G0 X0 Y0 (mouvement en vitesse rapide) F10 (fixe la vitesse d'avance travail) G5.2 P1 L3 X0 Y1 P1 X2 Y2 P1 X2 Y0 P1 X0 Y0 P2 G5.3 ; Les mouvements en vitesse rapide montrent le même parcours sans le bloc NURBS G0 X0 Y1 X2 Y2 X2 Y0 X0 Y0 M2 ----

source: .Sample NURBS Output
fr: .Simple sortie NURBS

source: image:images/nurbs01.png[align="center"]
fr: image:images/nurbs01.png[align="left"]

source: More information on NURBS can be found here:
fr: D'autres informations sur NURBS sont disponibles ici:

source: [[sec:G7-Diameter-Mode]] == G7 Lathe Diameter Mode (((G7 Lathe Diameter Mode)))
fr: == G7 Mode diamètre sur les tours[[sec:G7-Mode-diametre]] (((G7 Mode diamètre sur les tours)))

source: Program G7 to enter the diameter mode for axis X on a lathe. When in the diameter mode the X axis moves on a lathe will be 1/2 the distance to the center of the lathe. For example X1 would move the cutter to 0.500" from the center of the lathe thus giving a 1" diameter part.
fr: Sur un tour, programmer G7 pour passer l'axe X en mode diamètre. En mode diamètre, les mouvements de l'axe X font la moitié de la cote programmée. Par exemple, X10 placera l'outil à 5 unités du centre, ce qui produira bien une pièce d'un diamètre de 10 unités.

source: [[sec:G8-Radius-Mode]] == G8 Lathe Radius Mode (((G8 Lathe Radius Mode)))
fr: == G8 Mode rayon sur les tours[[sec:G8-Mode-rayon]] (((G8 Mode rayon sur les tours)))

source: Program G8 to enter the radius mode for axis X on a lathe. When in Radius mode the X axis moves on a lathe will be the distance from the center. Thus a cut at X1 would result in a part that is 2" in diameter. G8 is default at power up.
fr: Sur un tour, programmer G8 pour passer l'axe X en mode rayon. En mode rayon, les mouvements de l'axe X sont égaux à la cote programmée. Ce qui signifie que X10 placera l'outil à 10 unités du centre et aura pour résultat une pièce d'un diamètre de 20 unités. G8 est le mode par défaut à la mise sous tension.

source: [[sec:G10-L1_]] == G10 L1 Set Tool Table (((G10 L1 Tool Table)))
fr: == G10 L1 Ajustements dans la table d'outils[[sec:G10-L1]] (((G10 L1 Ajustements dans la table d'outils)))

source: 'P' - tool number
fr: 'P' - numéro d'outil

source: 'R' - radius of tool
fr: 'R' - rayon de bec

source: 'I' - front angle (lathe)
fr: 'I' - angle frontal (tour)

source: 'J' - back angle (lathe)
fr: 'J' - angle arrière (tour)

source: 'Q' - orientation (lathe)
fr: 'Q' - orientation (tour)

source: G10 L1 sets the tool table for the 'P' tool number to the values of the words.
fr: G10 L1 ajuste les valeurs de la table d'outils pour l'outil P aux valeurs passées dans les paramètres.

source: A valid G10 L1 rewrites and reloads the tool table.
fr: Un G10 L1 valide, réécrit et recharge la table d'outils.

source: .G10 L1 Example Line ----
fr: .Exemples avec G10 L1: ----

source: G10 L1 P1 Z1.5 (set tool 1 Z offset from the machine origin to 1.5) G10 L1 P2 R0.015 Q3 (lathe example setting tool 2 radius to 0.015 and orientation to 3) ----
fr: G10 L1 P1 Z1.5 (fixe le décalage en Z de l'outil 1 à 1.5 de l'origine machine) G10 L1 P2 R0.15 Q3 (fixe le rayon de bec de l'outil 2 à 0.15 avec une orientation 3) ----

source: Cutter Compensation is on
fr: La compensation d'outil est active

source: The P number is unspecified
fr: Le mot P n'est pas spécifié

source: The P number is not a valid tool number from the tool table
fr: Le mot P ne correspond pas à un numéro d'outil valide de la table d'outils.

source: The P number is 0
fr: Le mot P est 0

source: For more information on cutter orientation used by the 'Q' word, see the <<lathe-tool-orientation,Lathe Tool Orientation>> diagram.
fr: D'autres informations sur l'orientation <<sec:Orientations-des-outils-de-tour, des outils de tour sont disponibles ici>>.

source: [[sec:G10-L2_]] == G10 L2 Set Coordinate System (((G10 L2 Coordinate System)))
fr: == G10 L2 Établissement d'un système de coordonnées[[sec:G10-L2]] (((G10 L2 Établissement d'un système de coordonnées)))

source: 'P' - coordinate system (0-9)
fr: 'P' - système de coordonnées (0 à 9)

source: 'R' - rotation about the Z axis
fr: 'R' - rotation autour de l'axe Z

source: G10 L2 offsets the origin of the axes in the coordinate system specified to the value of the axis word. The offset is from the machine origin established during homing. The offset value will replace any current offsets in effect for the coordinate system specified. Axis words not used will not be changed.
fr: G10 L2 décale l'origine des axes dans le système de coordonnées spécifié par la valeur du mot d'axe. Le décalage s'effectue à partir de l'origine machine établie par la prise d'origine machine. Les valeurs de ce décalage vont remplacer toutes celles en effet sur le système de coordonnées spécifié. Les mots d'axe inutilisés resteront inchangés.

source: Program P0 to P9 to specify which coordinate system to change.
fr: Programmer P0 à P9 pour spécifier le système de coordonnées à décaler.

source: .Coordinate System[[cap:Set-Coordinate-System]]
fr: .Systèmes de coordonnées[[sec:Systeme-Coordonnees]]

source: [width="50%", options="header", cols="^,^,^"] |======================================== |P Value |Coordinate System |G code |0 |Active |n/a |1 |1 |G54 |2 |2 |G55 |3 |3 |G56 |4 |4 |G57 |5 |5 |G58 |6 |6 |G59 |7 |7 |G59.1 |8 |8 |G59.2 |9 |9 |G59.3 |========================================
fr: [width="50%", options="header", cols="^,^,^",align="left"] |========================================= |Valeur P| Système de coordonnées | G-code | 0| Actif courant | n/a | 1| 1 | G54 | 2| 2 | G55 | 3| 3 | G56 | 4| 4 | G57 | 5| 5 | G58 | 6| 6 | G59 | 7| 7 | G59.1 | 8| 8 | G59.2 | 9| 9 | G59.3 |==========================================

source: Optionally program R to indicate the rotation of the XY axis around the Z axis. The direction of rotation is CCW as viewed from the positive end of the Z axis.
fr: Facultativement, programmer 'R' pour indiquer la rotation des axes 'XY' autour de l'axe 'Z'. La direction de rotation est anti-horaire comme vue depuis le côté positif de l'axe Z.

source: All axis words are optional.
fr: Tous les mots d'axe sont facultatifs.

source: Being in incremental distance mode (<<sec:G90-G91,'G91'>>) has no effect on 'G10 L2'.
fr: Être en mode relatif ('G91') est sans effet sur 'G10 L2'.

source: Important Concepts:
fr: Concepts importants:

source: G10 L2 Pn does not change from the current coordinate system to the one specified by P, you have to use G54-59.3 to select a coordinate system.
fr: G10 L2 Pn ne change pas l'actuel système de coordonnées par celui spécifié par P, il est nécessaire d'utiliser G54 à 59.3 pour sélectionner le système de coordonnées.

source: When a rotation is in effect jogging an axis will only move that axis in a positive or negative direction and not along the rotated axis.
fr: Quand un mouvement de rotation est en cours, jogger un axe, déplacera celui-ci seulement dans le sens négatif ou positif et non pas le long de l'axe de rotation.

source: If a 'G92' origin offset was in effect before 'G10 L2', it will continue to be in effect afterwards.
fr: Si un décalage d'origine créé avec 'G92' est actif avant la commande 'G10 L2', il reste actif après.
