Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/gcode.*.po
Languages: fr

source: The motion of a G82 canned cycle looks just like G81 with the addition of a dwell at the bottom of the Z move. The length of the dwell is specified by a 'P-' word in the G82 block.
fr: Les mouvements du cycle G82 ressemblent à ceux de G81 avec une temporisation supplémentaire en fin de mouvement Z. La longueur de cette temporisation, exprimée en secondes, est spécifiée par un mot P- sur la ligne du G82.

source: [[sec:G83-Drilling-Peck]] == G83 Peck Drilling Cycle (((G83 Peck Drilling)))
fr: == G83 Cycle de perçage avec débourrage[[sec:G83-Cycle-percage]] (((G83 Cycle de perçage avec débourrage)))

source: The 'G83' cycle (often called peck drilling) is intended for deep drilling or milling with chip breaking. The retracts in this cycle clear the hole of chips and cut off any long stringers (which are common when drilling in aluminum). This cycle takes a Q number which represents a 'delta' increment along the Z-axis. The retract before final depth will always be to the 'retract' plane even if G98 is in effect. The final retract will honor the G98/99 in effect. G83 functions the same as G81 with the addition of retracts during the drilling operation.
fr: Le cycle 'G83' est destiné au perçage profond ou au fraisage avec brise-copeaux. Les retraits, au cours de ce cycle, dégagent les copeaux du trou et fragmentent les copeaux longs (qui sont fréquents lors du perçage dans l'aluminium). Ce cycle utilise la valeur 'Q' qui représente un incrément 'delta' le long de l'axe Z. Le retrait avant la profondeur finale, sera toujours au plan de retrait même si G98 est actif. Le retrait final respectera l'effet de G98/99. La fonction G83 est la même que G81 mais avec des retraits pendant l'opération de perçage.

source: . Preliminary motion, as described in the <<section:preliminary-motion,Preliminary and In-Between Motion>> section. . Move the Z-axis at the current <<sec:F-feed-rate,feed rate>> downward by delta or to the Z position, whichever is less deep. . Rapid move back out to the retract plane specified by the R word. . Rapid move back down to the current hole bottom, backed off a bit. . Repeat steps 2, 3, and 4 until the Z position is reached at step 2. . The Z-axis does a <<sec:G0,rapid move>> to clear Z.
fr: . Un mouvement préliminaire, comme décrit <<sec:Mouvement-Preliminaire, sur cette page>>. . Un mouvement de l'axe Z seul, en vitesse travail, sur la position la moins profonde entre, un incrément delta, ou la position de Z programmée. . Un mouvement en vitesse rapide au plan de retrait. . Une plongée en vitesse rapide dans le même trou, presque jusqu'au fond. . Répétition des étapes 2, 3 et 4 jusqu'à ce que la position programmée de Z soit atteinte à l'étape 2. . Un mouvement de l'axe Z en vitesse rapide vers le plan de retrait.

source: [[sec:G84-Right-Hand-Tapping]] == G84 Right-Hand Tapping Cycle (((G84 Right-Hand Tapping)))
fr: == G84 Cycle de taraudage à droite[[sec:G84]] (((G84 Cycle de taraudage)))

source: This code is currently unimplemented in LinuxCNC. It is accepted, but the behavior is undefined. See section <<sec:G33_1-Rigid-Tapping,G33.1>>
fr: Ce code n'est pas encore implémenté dans LinuxCNC. Il est accepté mais son comportement n'est pas défini. Voir le <<sec:G33_1, taraudage rigide>>.

source: [[sec:G85-Boring-Feed-Out]] == G85 Boring Cycle, Feed Out (((G85 Boring, Feed Out)))
fr: == G85 Cycle d'alésage sans tempo[[sec:G85-Cycle-alesage]] (((G85 Cycle d'alésage)))

source: The 'G85' cycle is intended for boring or reaming, but could be used for drilling or milling.
fr: Le cycle 'G85' est destiné à l'alésage, mais peut être utilisé pour le perçage ou le fraisage.

source: . Preliminary motion, as described in the <<section:preliminary-motion,Preliminary and In-Between Motion>> section. . Move the Z-axis only at the current <<sec:F-feed-rate,feed rate>> to the Z position. . Retract the Z-axis at the current feed rate to the R plane if it is lower than the initial Z. . Retract at the traverse rate to clear Z.
fr: . Un mouvement préliminaire, comme décrit <<sec:Mouvement-Preliminaire, sur cette page>>. . Un déplacement de l'axe Z seul en vitesse travail, vers la position Z programmée. . Retrait de l'axe Z en vitesse travail vers le plan de retrait R, si il est plus bas que le Z initial. . Retrait en vitesse rapide de l'axe Z.

source: [[sec:G86-Boring-Rapid-Out]] == G86 Boring Cycle, Spindle Stop, Rapid Move Out (((G86 Boring, Spindle Stop, Rapid Move Out)))
fr: == G86 Cycle d'alésage avec arrêt broche[[sec:G86-Cycle-alesage]] (((G86 Cycle d'alésage)))

source: The 'G86' cycle is intended for boring. This cycle uses a P number for the number of seconds to dwell.
fr: Le cycle 'G86' est destiné à l'alésage. Ce cycle utilise la valeur P pour une temporisation en secondes.

source: . Preliminary motion, as described in the <<section:preliminary-motion,Preliminary and In-Between Motion>> section. . Move the Z-axis only at the current <<sec:F-feed-rate,feed rate>> to the Z position. . Dwell for the P number of seconds. . Stop the spindle turning. . The Z-axis does a <<sec:G0,rapid move>> to clear Z. . Restart the spindle in the direction it was going.
fr: . Un mouvement préliminaire, comme décrit sur <<sec:Mouvement-Preliminaire, cette page>>. . Un déplacement de l'axe Z seul en vitesse travail, vers la position Z programmée. . Une temporisation de P secondes. . L'arrêt de rotation de la broche. . Retrait de l'axe Z en vitesse rapide vers le plan de retrait. . Reprise de la rotation de la broche dans la même direction que précédemment.

source: the spindle is not turning before this cycle is executed.
fr: La broche doit tourner avant le lancement de ce cycle. C'est une erreur si:

source: [[sec:G87-Back-Boring]] == G87 Back Boring Cycle (((G87 Back Boring)))
fr: == G87 Alésage inverse[[sec:G87-Back-Boring]] (((G87 Alésage inverse)))

source: This code is currently unimplemented in LinuxCNC. It is accepted, but the behavior is undefined.
fr: Ce code n'est pas encore implémenté dans LinuxCNC. Il est accepté mais son comportement n'est pas défini.

source: [[sec:G88-Boring-Manual-Out]] == G88 Boring Cycle, Spindle Stop, Manual Out (((G88 Boring Cycle, Spindle Stop, Manual Out)))
fr: == G88 Alésage, arrêt broche, retrait manuel[[sec:G88-Alesage-Retrait-Manuel-Out]] (((G88 Cycle d'alésage)))

source: [[sec:G89-Boring-Dwell,]] == G89 Boring Cycle, Dwell, Feed Out (((G89 Boring, Dwell, Feed Out)))
fr: == G89 Cycle d'alésage avec tempo[[sec:G89-Cycle-alesage]] (((G89 Cycle d'alésage avec tempo)))

source: The 'G89' cycle is intended for boring. This cycle uses a P number, where P specifies the number of seconds to dwell.
fr: Le cycle 'G89' est destiné à l'alésage. Il utilise la valeur de P pour une temporisation en secondes.

source: . Preliminary motion, as described in the <<section:preliminary-motion,Preliminary and In-Between Motion>> section. . Move the Z-axis only at the current <<sec:F-feed-rate,feed rate>> to the Z position. . Dwell for the P number of seconds. . Retract the Z-axis at the current feed rate to clear Z.
fr: . Un mouvement préliminaire, comme décrit <<sec:Mouvement-Preliminaire, sur cette page>>. . Un déplacement de l'axe Z seul en vitesse travail, vers la position Z programmée. . Temporisation de P secondes. . Retrait de l'axe Z en vitesse travail vers le plan de retrait.

source: [[sec:G90-G91]] == G90, G91 Distance Mode (((G90, G91 Distance Mode)))
fr: == G90, G91: Modes de déplacement[[sec:G90-G91]] (((G90 G91 Modes de déplacement)))

source: 'G90' - absolute distance mode In absolute distance mode, axis numbers (X, Y, Z, A, B, C, U, V, W) usually represent positions in terms of the currently active coordinate system. Any exceptions to that rule are described explicitly in the <<sec:G80-G89,G80 G89>> Section.
fr: 'G90' - C'est le mode de déplacement absolu, les valeurs d'axes (X, Y, Z, A, B, C, U, V, W) représentent les positions dans le système de coordonnées courant. Les exceptions à cette règle sont décrites dans la section <<sec:G81-a-G89, sur les cycles de perçage>>.

source: 'G91' - incremental distance mode In incremental distance mode, axis numbers usually represent increments from the current coordinate.
fr: 'G91' - C'est le mode de déplacement relatif (incrémental), en mode relatif, les valeurs d'axes représentent un incrément depuis la position courante.

source: .G90 Example ----
fr: .Exemple avec G90 ----

source: G90 (set absolute distance mode) G0 X2.5 (rapid move to coordinate X2.5 including any offsets in effect) ----
fr: G91 (passe en mode de déplacement relatif) G0 X2.5 (déplacement linéaire en vitesse rapide, à +2.5 en X de la position courante) ----

source: .G91 Example ----
fr: .Exemple avec G91 ----

source: G91 (set incremental distance mode) G0 X2.5 (rapid move 2.5 from current position along the X axis) ----
fr: G91 (passe en mode de déplacement relatif) G0 X2.5 (déplacement linéaire en vitesse rapide, à +2.5 en X de la position courante) ----

source: [[sec:G90_1-G91_1]] == G90.1, G91.1 Arc Distance Mode (((Arc Distance Mode)))
fr: == G90.1, G91.1: Mode de déplacement en arc (I, J et K)[[sec:G90_1-G91_1]]

source: 'G90.1' - absolute distance mode for I, J & K offsets. When G90.1 is in effect I and J both must be specified with G2/3 for the XY plane or J and K for the XZ plane or it is an error.
fr: 'G90.1' - Mode de déplacement absolu pour les offsets I, J et K. Quand G90.1 est actif, I et J doivent être tous les deux spécifiés avec G2/G3 pour le plan XY ou J et K pour le plan XZ, sinon c'est une erreur.

source: 'G91.1' - incremental distance mode for I, J & K offsets. G91.1 Returns I, J & K to their default behavior.
fr: 'G91.1' - Mode de déplacement relatif pour les offsets I, J et K. G91.1 replace I, J et K à leur fonctionnement normal.

source: [[sec:G92]] == G92 Coordinate System Offset (((G92 Coordinate System Offset)))
fr: == G92 Décalage d'origine des systèmes de coordonnées[[sec:G92]] (((G92 Décalages d'origine des systèmes de coordonnées)))

source: G92 makes the current point have the coordinates you want (without motion), where the axis words contain the axis numbers you want. All axis words are optional, except that at least one must be used. If an axis word is not used for a given axis, the coordinate on that axis of the current point is not changed.
fr: G92 fixera de nouvelles valeurs de coordonnées au point actuel (sans faire de mouvement). Les mots d'axes contiennent les valeurs souhaitées. Au moins un mot d'axe est obligatoire, les autres sont facultatifs. Si il n'y a pas de mot d'axe pour un axe donné, les coordonnées de cet axe resteront inchangées.

source: When 'G92' is executed, the origins of all coordinate systems move. They move such that the value of the current controlled point, in the currently active coordinate system, becomes the specified value. All coordinate system's origins are offset this same distance.
fr: Quand 'G92' est exécuté, les origines de tous les systèmes de coordonnées sont déplacées. Elles seront déplacées de sorte que les valeurs du point contrôlé courant, dans le système de coordonnées courant, deviendront celles spécifiées dans la ligne du G92. Les origines de tous les systèmes de coordonnées sont décalées de la même distance.

source: For example, suppose the current point is at X=4 and there is currently no 'G92' offset active. Then 'G92 x7' is programmed. This moves all origins -3 in X, which causes the current point to become X=7. This -3 is saved in parameter 5211.
fr: Par exemple, supposons que le point courant soit à X=4 et qu'aucun décalage G92 ne soit actif. La ligne 'G92 X7' est programmée, toutes les origines seront décalées de -3 en X, ce qui fera que le point courant deviendra X=7. Ce -3 est enregistré dans le paramètre 5211.

source: Being in incremental distance mode has no effect on the action of 'G92'.
fr: Être en mode de déplacement relatif est sans effet sur l'action de 'G92'.

source: 'G92' offsets may be already be in effect when the 'G92' is called. If this is the case, the offset is replaced with a new offset that makes the current point become the specified value.
fr: Des décalages G92 peuvent déjà être actifs quand 'G92' est appelé. Si c'est le cas, ils seront remplacés par le nouveau décalage, de sorte que le point courant devienne la valeur spécifiée.

source: all axis words are omitted.
fr: Tous les mots d'axes sont omis.

source: LinuxCNC stores the G92 offsets and reuses them on the next run of a program. To prevent this, one can program a G92.1 (to erase them), or program a G92.2 (to remove them - they are still stored).
fr: LinuxCNC conserve les décalages G92 et les réutilisera au prochain démarrage du logiciel. Pour éviter cela, programmer un 'G92.1' qui les effacera, ou un G92.2 qui supprimera les valeurs enregistrées.

source: See the <<sec:G92-Offsets,Offsets>> Section for more information.
fr: Voir la section sur les <<sec:G92-Decalages,décalages G92>>.

source: See the <<sec:parameters,Parameters>> Section for more information.
fr: Voir la section sur les <<sec:parametres,paramètres>>.

source: [[sec:G92_1-G92_2]] == G92.1, G92.2 Reset Coordinate System Offsets
fr: == G92.1, G92.2 Remise à zéro décalages[[sec:G92_1-G92_2]]

source: 'G92.1' - reset axis offsets to zero and set <<sub:numbered-parameters,parameters>> 5211 - 5219 to zero.
fr: 'G92.1' - Positionne les décalages d'axes à 0 et passe les paramètres 5211 à 5219 à zéro.

source: 'G92.2' - reset axis offsets to zero.
fr: 'G92.2' - Positionne les décalages d'axes à 0, laisse les valeurs des paramètres inchangées, elles ne seront pas utilisées.

source: [[sec:G92_3]] == G92.3 Restore Axis Offsets
fr: == G92.3 Restauration des décalages d'axe[[sec:G92_3]]

source: 'G92.3' - set the axis offset to the values saved in parameters 5211 to 5219
fr: * 'G92.3' - Positionne les décalages d'axes aux valeurs enregistrées dans les paramètres 5211 à 5219.

source: You can set axis offsets in one program and use the same offsets in another program. Program 'G92' in the first program. This will set parameters 5211 to 5219. Do not use 'G92.1' in the remainder of the first program. The parameter values will be saved when the first program exits and restored when the second one starts up. Use 'G92.3' near the beginning of the second program. That will restore the offsets saved in the first program.
fr: Il est possible de positionner les décalages d'axes dans un programme puis de ré-utiliser les mêmes dans un autre programme. Pour cela, programmer 'G92' dans le premier programme, ce qui positionnera les paramètres 5211 à 5219. Ne pas utiliser G92.1 dans la suite du premier programme. Les valeurs des paramètres seront enregistrées lors de la sortie du premier programme et rétablies au chargement du second programme. Utiliser 'G92.3' vers le début du deuxième programme, ce qui restaurera les décalages d'axes enregistrés par le premier.

source: [[sec:G93-G94-G95-Mode]] == G93, G94, G95: Feed Rate Mode (((G93, G94, G95: Feed Rate Mode)))
fr: == G93, G94, G95: Choix des modes de vitesse[[sec:G93-G94-G95-Modes]] (((G93, G94, G95: Choix des modes de vitesse)))

source: * 'G93' - is Inverse Time Mode. In inverse time feed rate mode, an F word means the move should be completed in [one divided by the F number] minutes. For example, if the F number is 2.0, the move should be completed in half a minute. + When the inverse time feed rate mode is active, an F word must appear on every line which has a G1, G2, or G3 motion, and an F word on a line that does not have G1, G2, or G3 is ignored. Being in inverse time feed rate mode does not affect G0 (<<sec:G0,rapid move>>) motions.
fr: * 'G93' - Passe en mode inverse du temps. Dans le mode vitesse inverse du temps, le mot 'F' signifie que le mouvement doit être terminé en '[1/F]' minutes. Par exemple, si la valeur de 'F' est '2.0', les mouvements doivent être terminés en '1/2' minute.

source: * 'G94' - is Units per Minute Mode. In units per minute feed mode, an F word is interpreted to mean the controlled point should move at a certain number of inches per minute, millimeters per minute, or degrees per minute, depending upon what length units are being used and which axis or axes are moving.
fr: * 'G94' - Passe en mode unités par minute. Dans le mode vitesse en unités par minute, le mot 'F' indique le déplacement du point contrôlé en millimètres par minute, en pouces par minute, ou en degrés par minute, selon l'unité utilisée.

source: * 'G95' - is Units per Revolution Mode In units per revolution mode, an F word is interpreted to mean the controlled point should move a certain number of inches per revolution of the spindle, depending on what length units are being used and which axis or axes are moving. G95 is not suitable for threading, for threading use G33 or G76. G95 requires that motion.spindle-speed-in to be connected.
fr: * 'G95' - Passe en mode unités par tour. Dans le mode vitesse en unités par tour, le mot 'F' donne le déplacement du point contrôlé à effectuer sur l'axe Z, en millimètres par tour de broche ou en pouces, selon l'unité utilisée. G95 n'est pas adapté pour le filetage, ni G33 ni G76. G95 requiert que la pin de Hal motion.spindle-speed-in soit connectée.

source: * Inverse time feed mode is active and a line with G1, G2, or G3 (explicitly or implicitly) does not have an F word. * A new feed rate is not specified after switching to G94 or G95
fr: * Le mode vitesse inverse du temps est actif et qu'une ligne avec G1, G2, ou G3 (explicitement ou implicitement) n'a pas de mot F. * Une nouvelle vitesse n'a pas été spécifiée après un passage en G94 ou G95.

source: [[sec:G96-G97-Spindle]] == G96, G97 Spindle Control Mode (((G96, G97 Spindle Control Mode)))
fr: == G96, G97: Modes de contrôle de la broche[[sec:G96-G97-Broche]] (((G96, G97: Vitesse de coupe constante, Vitesse de coupe en tr/mn)))

source: G96 <D-> S- (Constant Surface Speed) G97 (RPM Mode) ----
fr: G96 <D-> S- (vitesse de coupe constante) G97 (mode tr/mn) ----

source: 'D' - maximum spindle RPM
fr: 'D-' - Vitesse de broche maximale en tours par minute.

source: 'S' - surface speed
fr: 'S-' - Vitesse de coupe constante.

source: * 'G96 D- S-' - selects constant surface speed of 'S' feet per minute (if G20 is in effect) or meters per minute (if G21 is in effect). D- is optional. + When using G96, ensure that X0 in the current coordinate system (including offsets and tool lengths) is the center of rotation or LinuxCNC will not give the desired spindle speed. G96 is not affected by radius or diameter mode.
fr: * 'G96 D- S-' - Passe à une vitesse de coupe constante de 'S' pieds par minute, si G20 est actif, ou 'S' mètres par minute, si G21 est actif. D- est facultatif. + Lorsque 'G96' est utilisé, s'assurer que 'X0' dans le système de coordonnées en cours (y compris les compensations d'outils) est bien le centre de rotation, sinon LinuxCNC ne donnera pas la vitesse de broche désirée. 'G96' n'est pas affecté par les mode rayon ou diamètre.

source: 'G97' selects RPM mode.
fr: 'G97' - Vitesse de coupe en tr/mn.

source: .G96 Example Line ----
fr: .Exemple avec G96 ----

source: G96 D2500 S250 (set CSS with a max rpm of 2500 and a surface speed of 250) ----
fr: G96 D2500 S250 (passe à une vitesse de coupe constante de 250 m/mn maximum pour une vitesse de broche maximale de 2500tr/mn). ----

source: S is not specified with G96
fr: S n'est pas spécifié avec G96.

source: A feed move is specified in G96 mode while the spindle is not turning
fr: Une vitesse est spécifiée en mode G96 et la broche ne tourne pas.

source: [[sec:G98-G99-Set]] == G98, G99 Canned Cycle Return Level (((G98, G99 Canned Cycle Return)))
fr: == G98, G99: Options du plan de retrait[[sec:G98-G99-Set]] (((G98, G99 Retrait)))

source: * 'G98' - retract to the position that axis was in just before this series of one or more contiguous canned cycles was started.
fr: * 'G98' - Retrait perpendiculaire au plan de travail courant jusqu'à la position qui était celle de cet axe juste avant le début du cycle de perçage.

source: 'G99' - retract to the position specified by the R word of the canned cycle.
fr: 'G99' - Retrait à la position spécifiée par le mot R du cycle de perçage.

source: Program a 'G98' and the canned cycle will use the Z position prior to the canned cycle as the Z return position if it is higher than the R value specified in the cycle. If it is lower, the R value will be used. The R word has different meanings in absolute distance mode and incremental distance mode.
fr: Programmer un 'G98' et le cycle de perçage utilisera la position en Z, qui était celle de Z juste avant le début du cycle, comme position de retrait. Si elle est en dessous, la valeur de R sera utilisée. Le mot R a différentes signification selon le mode incrémental ou absolu.

source: .G98 Retract to Origin ----
fr: .Retrait à l'origine avec G98 ----

source: The 'initial' (G98) plane is reset any time cycle motion mode is abandoned, whether explicitly (G80) or implicitly (any motion code that is not a cycle). Switching among cycle modes (say G81 to G83) does NOT reset the 'initial' plane. It is possible to switch between G98 and G99 during a series of cycles.
fr: Le plan de retrait initial (G98) est annulé chaque fois que le mode de mouvement est abandonné, que ce soit explicitement avec G80 ou implicitement (tout code de mouvement qui n'est pas un cycle). Basculer d'un mode de cycle à un autre, par exemple entre G81 et G83 n'annule pas le plan de retrait initial. Il est permis de basculer entre G98 et G99 durant une série de cycles de perçage.
