Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/gcode.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = G Codes
fr: = Tout le G-code de LinuxCNC

source: [[cha:g-codes]] (((G Codes)))
fr: [[cha:Le-G-code]] (((Le G-code)))

source: Conventions used in this section
fr: Conventions utilisées dans cette section

source: In the G code prototypes the hyphen ('-') stands for a real value and ('<>') denotes an optional item.
fr: Dans une commande type, le tiret ('-') signifie une valeur réelle et les signes ('<>') indiquent un élément facultatif.

source: If 'L-' is written in a prototype the '-' will often be referred to as the 'L number', and so on for any other letter.
fr: Si 'L-' est écrit dans une commande, le signe '-' fera référence à 'Lnombre'. De la même manière, le signe '-' dans 'H-' peut être appelé le 'Hnombre' et ainsi de suite pour les autres lettres. Une valeur facultative sera écrite '<L->'.

source: In the G code prototypes the word 'axes' stands for any axis as defined in your configuration.
fr: Dans les blocs de G-code, le mot 'axes' signifie n'importe quel axe défini dans la configuration.

source: An optional value will be written like this '<L->'.
fr: Une valeur optionnelle sera écrite '<L->'.

source: A real value may be:
fr: Une valeur réelle peut être:

source: An explicit number, '4'
fr: un nombre explicite, '4'

source: An expression, '[2+2]'
fr: une expression, '[2+2]'

source: A parameter value, '#88'
fr: une valeur de paramètre, '#88'

source: A unary function value, 'acos[0]'
fr: la fonction unaire d'une valeur, 'acos[0]'

source: In most cases, if 'axis' words are given (any or all of 'X Y Z A B C U V W'), they specify a destination point.
fr: Dans la plupart des cas, si des mots d'axes sont donnés (parmi 'X Y Z A B C U V W'), ils spécifient le point de destination.

source: Axis numbers are in the currently active coordinate system, unless explicitly described as being in the absolute coordinate system.
fr: Les valeurs d'axe sont données dans le système de coordonnées courant, à moins qu'explicitement décrit comme étant dans le système de coordonnées absolues (machine).

source: Where axis words are optional, any omitted axes will retain their original value.
fr: Les mots d'axes sont facultatifs, tout axe omis gardera sa valeur originelle.

source: Any items in the G code prototypes not explicitly described as optional are required.
fr: Tout item dans un bloc de G-code, non explicitement décrit comme facultatif, sera requis. Une erreur sera signalée si un élément requis est omis.

source: The values following letters are often given as explicit numbers. Unless stated otherwise, the explicit numbers can be real values. For example, 'G10 L2' could equally well be written 'G[2*5] L[1+1]'. If the value of parameter 100 were 2, 'G10 L#100' would also mean the same.
fr: Les valeurs qui suivent les lettres sont souvent données comme des nombres explicites. Sauf indication contraire, les nombres explicites peuvent être des valeurs réelles. Par exemple, 'G10 L2' pourrait aussi bien être écrite 'G[2*5] L[1+1]'. Si la valeur du paramètre '100' étaient '2', 'G10 L#100' signifierait également la même chose.

source: == G Code Quick Reference Table[[quick-reference-table]]
fr: == Table d'index du G-code[[sec:Table-des-index-du-G-code]]

source: (((G Code Table)))
fr: (((Table des index du G Code)))

source: [width="75%", options="header", cols="2^,5<"] |==================================================================== |Code |Description |<<sec:G0,G0>> |Coordinated Straight Motion Rapid Rate |<<sec:G1,G1>> |Coordinated Straight Motion Feed Rate |<<sec:G2-G3-Arc,G2 G3>> |Coordinated Helical Motion Feed Rate |<<sec:G4-Dwell,G4>> |Dwell |<<sec:G5-Cubic-Spline,G5>> |Cubic Spline |<<sec:G5_1-Quadratic-Spline,G5.1>> |Quadratic B-Spline |<<sec:G5_2-G5_3-NURBS,G5.2>> |NURBS, add control point |<<sec:G5_2-G5_3-NURBS,G5.3>> |NURBS, execute |<<sec:G7-Diameter-Mode,G7>> |Diameter Mode (lathe) |<<sec:G8-Radius-Mode,G8>> |Radius Mode (lathe) |<<sec:G10-L1_,G10 L1>> |Set Tool Table Entry |<<sec:G10-L10,G10 L10>> |Set Tool Table, Calculated, Workpiece |<<sec:G10-L11,G10 L11>> |Set Tool Table, Calculated, Fixture |<<sec:G10-L2_,G10 L2>> |Coordinate System Origin Setting |<<sec:G10-L20,G10 L20>> |Coordinate System Origin Setting Calculated |<<sec:G17-G18-G19,G17 - G19.1>> |Plane Select |<<sec:G20-G21-Units,G20 G21>> |Units of Measure |<<sec:G28-G28_1,G28 - G28.1>> |Go to Predefined Position |<<sec:G30-G30_1,G30 - G30.1>> |Go to Predefined Position |<<sec:G33-Spindle-Sync,G33>> |Spindle Synchronized Motion |<<sec:G33_1-Rigid-Tapping,G33.1>> |Rigid Tapping |<<sec:G38-probe,G38.2 - G38.5>> |Probing |<<sec:G40,G40>> |Cancel Cutter Compensation |<<sec:G41-G42,G41 G42>> |Cutter Compensation |<<sec:G41_1-G42_1,G41.1 G42.1>> |Dynamic Cutter Compensation |<<sec:G43,G43>> |Use Tool Length Offset from Tool Table |<<sec:G43_1,G43.1>> |Dynamic Tool Length Offset |<<sec:G43_2,G43.2>> |Apply additional Tool Length Offset |<<sec:G49-Tool,G49>> |Cancel Tool Length Offset |<<sec:G53-Move-in,G53>> |Motion in Machine Coordinate System |<<sec:G54-G59_3,G54-G59>> |Select Coordinate System (1 - 6) |<<sec:G54-G59_3,G59.1-G59.3>> |Select Coordinate System (7 - 9) |<<sec:G61-G61_1,G61 G61.1>> |Path Control Mode |<<sec:G64,G64>> |Path Control Mode with Optional Tolerance |<<sec:G73-Drilling-Cycle,G73>> |Drilling Cycle with Chip Breaking |<<sec:G76-Threading-Canned,G76>> |Multi-pass Threading Cycle (Lathe) |<<sec:G80-Cancel-Modal,G80>> |Cancel Motion Modes |<<sec:G81-Drilling-Cycle,G81>> |Drilling Cycle |<<sec:G82-Drilling-Dwell,G82>> |Drilling Cycle with Dwell |<<sec:G83-Drilling-Peck,G83>> |Drilling Cycle with Peck |<<sec:G85-Boring-Feed-Out,G85>> |Boring Cycle, No Dwell, Feed Out |<<sec:G86-Boring-Rapid-Out,G86>> |Boring Cycle, Stop, Rapid Out |<<sec:G89-Boring-Dwell,G89>> |Boring Cycle, Dwell, Feed Out |<<sec:G90-G91,G90 G91>> |Distance Mode |<<sec:G90_1-G91_1,G90.1 G91.1>> |Arc Distance Mode |<<sec:G92,G92>> |Coordinate System Offset |<<sec:G92_1-G92_2,G92.1 G92.2>> |Cancel Coordinate System Offsets |<<sec:G92_3,G92.3>> |Restore Axis Offsets |<<sec:G93-G94-G95-Mode,G93 G94 G95>> |Feed Modes |<<sec:G96-G97-Spindle,G96>> |Constant Surface Speed |<<sec:G96-G97-Spindle,G97>> |RPM Mode |<<sec:G98-G99-Set,G98 G99>> |Canned Cycle Z Retract Mode |====================================================================
fr: [width="75%", options="header", cols="2^,5<"] |===================================================================== |Sections | Descriptions |<<sec:G0,G0>> | Interpolation linéaire en vitesse rapide |<<sec:G1,G1>> | Interpolation linéaire en vitesse travail |<<sec:G2-G3,G2/G3>> | Interpolation circulaire sens horaire/anti-horaire |<<sec:G4-Tempo,G4>> | Temporisation |<<sec:G5-Cubic-Spline,G5>> | Spline cubique |<<sec:G5_1-Quadratic-Spline,G5.1>> | B-Spline quadratique |<<sec:G5_2-G5_3-NURBS,G5.2>> | NURBS, ajout point de contrôle |<<sec:G5_2-G5_3-NURBS,G5.3>> | NURBS, exécute |<<sec:G7-Mode-diametre,G7>> | Mode diamètre (sur les tours) |<<sec:G8-Mode-rayon,G8>> | Mode rayon (sur les tours) |<<sec:G10-L1,G10 L1>> | Ajuste les valeurs de l'outil en table d'outils |<<sec:G10-L10,G10 L10>> | Modifie les valeurs de l'outil dans la table d'outils |<<sec:G10-L11,G10 L11>> | Fixe les valeurs de l'outil dans la table d'outils |<<sec:G10-L2,G10 L2>> | Fixe l'origine d'un système de coordonnées |<<sec:G10-L20,G10 L20>> | Fixe l'origine du système de coord. aux valeurs calculées |<<sec:G17-G18-G19,G18 G19>> | Choix du plan de travail |<<sec:G20-G21,G20 G21>> | Unités machine |<<sec:G28-G28_1,G28 G28.1>> | Aller à une position prédéfinie |<<sec:G30-G30_1,G30 G30.1>> | Aller à une position prédéfinie |<<sec:G33,G33>> | Mouvement avec broche synchronisée |<<sec:G33_1,G33.1>> | Taraudage rigide |<<sec:G38-x-Palpeur,G38>> | Mesures au palpeur |<<sec:G40,G40>> | Révocation de la compensation de rayon d'outil |<<sec:G41-G42,G41 G42>> | Compensation de rayon d'outil |<<sec:G41_1-G42_1,G41.1 G42.1>> | Comp. dynamique de rayon d'outil à gauche/à droite |<<sec:G43,G43>> | Compensation de longueur d'outil depuis la table d'outils |<<sec:G43_1,G43.1>> | Compensation dynamique de longueur d'outil |<<sec:G43_2,G43.2>> | Applique compensation de longueur additionnelle |<<sec:G49-Outil,G49>> | Révocation de la compensation de longueur d'outil |<<sec:G53,G53>> | Déplacements en coordonnées machine (Absolues) |<<sec:G54-a-G59_3,G54 à G59.3>> | Choix du système de coordonnées (1 à 9) |<<sec:G61-G61_1,G61 G61.1>> | Mode trajectoire exacte/mode arrêts exacts |<<sec:G64,G64>> | Mode trajectoire continue avec tolérance |<<sec:G73,G73>> | Cycle de perçage avec brise copeau |<<sec:G76-Filetage,G76>> | Cycle de filetage multi-passes (tour) |<<sec:G80-Revocation,G80>> | Révocation des codes modaux |<<sec:G81-Cycle-percage,G81>> | Cycle de perçage |<<sec:G82-Cycle-percage,G82>> | Cycles de perçage avec tempo |<<sec:G83-Cycle-percage,G83>> | Cycle de perçage avec débourrage |<<sec:G85-Cycle-alesage,G85>> | Cycle d'alésage, retrait en vitesse travail |<<sec:G86-Cycle-alesage,G86>> | Cycle d'alésage, retrait en vitesse rapide |<<sec:G89-Cycle-alesage,G89>> | Cycle d'alésage, tempo, retrait vitesse travail |<<sec:G90-G91,G90>> | Types de déplacement |<<sec:G90_1-G91_1,G90.1 G91.1>> | Arc I,J,K, centre absolu ou relatif |<<sec:G92,G92>> | Décalages d'origines avec mise à jour des paramètres |<<sec:G92_1-G92_2,G92.1 G92.2>> | Révocation des décalages d'origine |<<sec:G92_3,G92.3>> | Applique contenu des paramètres aux déc. d'origine |<<sec:G93-G94-G95-Modes,G93>> | Modes de vitesse |<<sec:G96-G97-Broche,G96>> | Vitesse de coupe constante (IPM ou m/mn) |<<sec:G96-G97-Broche,G97>> | Vitesse en tours par minute |<<sec:G98-G99-Set,G98>> | Options de retrait des cycles d'usinage |====================================================================

source: [[sec:G0]] == G0 Rapid Move (((G0 Rapid Move)))(((Rapid Move)))
fr: == G0 Interpolation linéaire en vitesse rapide[[sec:G0]] (((G0 vitesse rapide)))

source: For rapid linear (straight line) motion, program 'G0 'axes'', where all the axis words are optional. The 'G0' is optional if the current motion mode is 'G0'. This will produce coordinated linear motion to the destination point at the maximum rapid rate (or slower). It is expected that cutting will not take place when a 'G0' command is executing.
fr: Pour un mouvement linéaire en vitesse rapide, programmer 'G0 axes', tous les mots d'axe sont facultatifs. Le 'G0' est facultatif si le mode mouvement courant est déjà 'G0'. Cela produit un mouvement linéaire vers le point de destination à la vitesse rapide maximale (ou moins vite si la machine n'atteint pas cette vitesse). Il n'est pas prévu d'usiner la matière quand une commande G0 est exécutée. Un G0 seul peut être utilisé pour passer le mode de mouvement courant en G0.

source: [[sub:rapid-velocity]] === Rapid Velocity Rate
fr: === Vitesse rapide[[sub:rapid-velocity]]

source: The MAX_VELOCITY setting in the ini file [TRAJ] section defines the maximum rapid traverse rate. The maximum rapid traverse rate can be higher than the individual axes MAX_VELOCITY setting during a coordinated move. The maximum rapid traverse rate can be slower than the MAX_VELOCITY setting in the [TRAJ] section if an axis MAX_VELOCITY or trajectory constraints limit it.
fr: L'élément MAX_VELOCITY défini dans la section [TRAJ] du fichier ini, fixe le maximum de la vitesse rapide. Pendant un mouvement coordonné, la vitesse rapide maximale des axes peut, individuellement, dépasser celle fixée par MAX_VELOCITY. La vitesse rapide maximale peut être plus basse que celle donnée par MAX_VELOCITY réglée dans la section [TRAJ] si le MAX_VELOCITY d'un axe ou des contraintes de trajectoire y obligent.

source: .G0 Example ----
fr: .Exemple avec G0: ----

source: G90 (set absolute distance mode) G0 X1 Y-2.3 (Rapid linear move from current location to X1 Y-2.3) M2 (end program) ----
fr: G90 (Fixe les déplacements en mode absolu) G0 X1 Y-2.3 (mouvement linéaire en vitesse rapide du point courant à X1 Y-2.3) M2 (fin de programme) ----

source: See <<sec:G90-G91,G90>> & <<sec:M2-M30,M2>> sections for more information.
fr: Voir les sections <<sec:G90-G91,G90>> et <<sec:M2-M30,M2>> pour plus d'informations.

source: If cutter compensation is active, the motion will differ from the above; see the <<sec:cutter-compensation,Cutter Compensation>> Section.
fr: Si la compensation d'outil est active, le mouvement sera différent de celui décrit ci-dessus, voir la section sur la <<sec:Compensation-rayon-d-outil, compensation d'outil>>.

source: If 'G53' is programmed on the same line, the motion will also differ; see the <<sec:G53-Move-in,G53>> Section for more information.
fr: Si 'G53' est programmé sur la même ligne, le mouvement sera également différent, voir la section sur les mouvements en <<sec:G53, coordonnées absolues>>.

source: The path of a G0 rapid motion can be rounded at direction changes and depends on the <<sec:trajectory-control,trajectory control>> settings and maximum acceleration of the axes.
fr: Le chemin d'outil d'un mouvement en vitesse rapide G0 peut ne pas être totalement rectiligne, selon les changements de trajectoire et les accélérations des axes, comme expliqué dans le <<sec:trajectory-control,contrôle de trajectoire>>.

source: It is an error if:
fr: C'est une erreur si:

source: An axis letter is without a real value.
fr: Un mot d'axe est indiqué sans valeur réelle.

source: An axis letter is used that is not configured
fr: Un mot d'axe est indiqué qui n'est pas configuré.

source: [[sec:G1]] == G1 Linear Move (((G1 Linear Move)))(((Linear Move)))
fr: == G1 Interpolation linéaire en vitesse travail[[sec:G1]] (((G1 vitesse travail)))

source: For linear (straight line) motion at programed <<sec:F-feed-rate,feed rate>> (for cutting or not), program 'G1 'axes'', where all the axis words are optional. The 'G1' is optional if the current motion mode is 'G1'. This will produce coordinated linear motion to the destination point at the current feed rate (or slower if the machine will not go that fast).
fr: Pour un mouvement linéaire en vitesse <<sec:F-Vitesse, travail>> (pour usiner ou non), programmer 'G1 axes', tous les mots d'axe sont facultatifs. Le 'G1' est facultatif si le mode de mouvement courant est déjà 'G1'. Cela produira un mouvement linéaire vers le point de destination à la vitesse de travail courante (ou moins vite si la machine n'atteint pas cette vitesse).

source: .G1 Example ----
fr: .Exemple avec G1: ----

source: G90 (set absolute distance mode) G1 X1.2 Y-3 F10 (linear move at a feed rate of 10 from current position to X1.2 Y-3) Z-2.3 (linear move at same feed rate from current position to Z-2.3) Z1 F25 (linear move at a feed rate of 25 from current position to Z1) M2 (end program) ----
fr: G90 (Fixe les déplacements en mode absolu) G1 X1.2 Y-3 F10 (mouvement linéaire à 10 unités/mn du point courant à X1.2 Y-3) Z-2.3 (mouvement linéaire à 10 unités/mn du point courant à Z-2.3) Z1 F25 (mouvement linéaire de l'axe Z à 25 unités/mn vers Z1) M2 (Fin de programme) ----

source: * See <<sec:G90-G91,G90>> & <<sec:F-feed-rate,F>> & <<sec:M2-M30,M2>> sections for more information.
fr: * Voir les sections <<sec:G90-G91,G90>>, <<sec:F-Vitesse, vitesse travail>> et <<sec:M2-M30,M2>> pour plus de détails.

source: No feed rate has been set.
fr: Aucune vitesse d'avance travail n'est fixée.

source: [[sec:G2-G3-Arc]] == G2, G3 Arc Move (((G2, G3 Arc Move)))(((Arc Move)))
fr: == G2, G3 Interpolation circulaire en vitesse travail[[sec:G2-G3]] (((G2, G3 Interpolation circulaire)))

source: G2 or G3 axes offsets (center format) G2 or G3 axes R- (radius format) G2 or G3 offsets <P-> (full circles) ----
fr: G2 ou G3 axes décalages (format centre) G2 ou G3 axes R- (format rayon) G2 ou G3 décalages <P-> (cercles complet) ----

source: A circular or helical arc is specified using either 'G2' (clockwise arc) or 'G3' (counterclockwise arc) at the current <<sec:F-feed-rate,feed rate>>. The direction (CW, CCW) is as viewed from the positive end of the axis about which the circular motion occurs.
fr: Un mouvement circulaire ou hélicoïdal est spécifié en sens horaire avec 'G2' ou en sens anti-horaire avec 'G3' à la <<sec:F-Vitesse, vitesse>> courante. La direction est vue depuis le côté positif de l'axe autour duquel le mouvement se produit.

source: The axis of the circle or helix must be parallel to the X, Y, or Z axis of the machine coordinate system. The axis (or, equivalently, the plane perpendicular to the axis) is selected with 'G17' (Z-axis, XY-plane), 'G18' (Y-axis, XZ-plane), or 'G19' (X-axis, YZ-plane). Planes '17.1', '18.1', and '19.1' are not currently supported. If the arc is circular, it lies in a plane parallel to the selected plane.
fr: L'axe des cercles ou des hélicoïdes, doit être parallèle a l'axes X, Y ou Z du système de coordonnées machine. Les axes (ou, leurs équivalents, les plans, perpendiculaires aux axes) sont sélectionnés avec 'G17' (axe Z, plan XY), 'G18' (axe Y, plan XZ), ou 'G19' (axe X, plan YZ). Les plans '17,1', '18,1' et '19,1' ne sont pas actuellement pris en charge. Si l'arc est circulaire, il se trouve dans un plan parallèle au plan sélectionné.

source: To program a helix, include the axis word perpendicular to the arc plane: for example, if in the 'G17' plane, include a 'Z' word. This will cause the 'Z' axis to move to the programmed value during the circular 'XY' motion.
fr: Pour programmer un hélicoïde, inclure le mot d'axe perpendiculaire au plan de l'arc. Par exemple, si nous sommes dans le plan 'G17', inclure un mot 'Z', ceci provoquera un mouvement de l'axe 'Z' vers la valeur programmée durant tout le mouvement circulaire 'XY'.

source: To program an arc that gives more than one full turn, use the 'P' word specifying the number of full turns plus the programmed arc. The 'P' word must be an integer. If 'P' is unspecified, the behavior is as if 'P1' was given: that is, only one full or partial turn will result. For example, if a 180 degree arc is programmed with a P2, the resulting motion will be 1 1/2 rotations. For each P increment above 1 an extra full circle is added to the programmed arc. Multi turn helical arcs are supported and give motion useful for milling holes or threads.
fr: Pour programmer un arc supérieur à un tour complet, utiliser un mot 'P' spécifiant alors le nombre de tours complets en plus de l'arc. Si 'P' n'est pas spécifié, le comportement sera comme si 'P1' avait été donné: ceci étant, un seul tour complet ou partiel sera effectué, donnant un arc plus petit ou égal à un tour complet. Par exemple, si un arc de 180° est programmé avec P2, le mouvement résultant sera d'un tour et demi. Pour chaque incrément de P au delà de 1, un tour complet sera ajouté à l'arc programmé. Les arcs hélicoïdaux multi-tours sont supportés ce qui donne des mouvements très intéressants pour usiner des alésages ou des filetages.

source: If a line of code makes an arc and includes rotary axis motion, the rotary axes turn at a constant rate so that the rotary motion starts and finishes when the XYZ motion starts and finishes. Lines of this sort are hardly ever programmed.
fr: Si une ligne de G-code crée un arc et inclus le mouvement d'un axe rotatif, l'axe rotatif tournera à vitesse constante de sorte que le mouvement de l'axe rotatif commence et se termine en même temps que les autres axes XYZ. De telles lignes sont très rarement programmées.

source: The arc center is absolute or relative as set by <<sec:G90_1-G91_1,G90.1 or G91.1>> respectively.
fr: Le centre de l'arc est absolu ou relatif, tel que fixé par <<sec:G90_1-G91_1,G90.1 ou G91.1>>, respectivement.

source: Two formats are allowed for specifying an arc: Center Format and Radius Format.
fr: Deux formats sont possibles pour spécifier un arc: Le format centre et le format rayon.

source: The P word is not an integer.
fr: Le mot P n'est pas un entier.

source: === Center Format Arcs
fr: === Arc au format centre (format recommandé)

source: Center format arcs are more accurate than radius format arcs and are the preferred format to use.
fr: Les arcs au format centre sont plus précis que les arcs au format rayon, c'est le format à privilégier.

source: The end point of the arc along with the offset to the center of the arc from the current location are used to program arcs that are less than a full circle. It is OK if the end point of the arc is the same as the current location.
fr: La distance entre la position courante et le centre de l'arc et, facultativement, le nombre de tours, sont utilisés pour programmer des arcs inférieurs au cercle complet. Il est permis d'avoir le point final de l'arc égal à la position courante.

source: The offset to the center of the arc from the current location and optionally the number of turns are used to program full circles.
fr: Le décalage entre le centre de l'arc et la position courante ainsi que facultativement, le nombre de tours, sont utilisés pour programmer des cercles complets.

source: When programming arcs an error due to rounding can result from using a precision of less than 4 decimal places (0.0000) for inch and less than 3 decimal places (0.000) for millimeters.
fr: Une erreur d'arrondi peut se produire quand un arc est programmé avec une précision inférieure à 4 décimales (0.0000) pour les pouces et à moins de 3 décimales (0.000) pour les millimètres.

source: .Incremental Arc Distance Mode Arc center offsets are a relative distance from the start location of the arc. Incremental Arc Distance Mode is default.
fr: .Arc en mode distance relative Les décalages par rapport au centre de l'arc sont des distances relatives aupoint de départ de l'arc. Le mode distance relative de l'arc est lemode par défaut.

source: One or more axis words and one or more offsets must be programmed for an arc that is less than 360 degrees.
fr: Un ou plusieurs mots d'axe et un ou plusieurs décalages doivent être programmés pour un arc qui fait moins de 360 degrés.

source: No axis words and one or more offsets must be programmed for full circles. The 'P' word defaults to 1 and is optional.
fr: Aucun mot d'axe mais un ou plusieurs décalages doivent être programmés pour un cercle complet. Le mot 'P', par défaut à 1, est facultatif.

source: For more information on 'Incremental Arc Distance Mode see the <<sec:G90_1-G91_1,G91.1>> section.
fr: Pour d'avantage d'information sur les arcs en mode relatif, voir la <<sec:G90_1-G91_1,section G91.1>>.

source: .Absolute Arc Distance Mode Arc center offsets are the absolute distance from the current 0 position of the axis.
fr: .Arc en mode distance absolue Les décalages par rapport au centre de l'arc sont des distances absolues depuisla position 0 courante des axes.

source: One or more axis words and 'both' offsets must be programmed for arcs less than 360 degrees.
fr: Un ou plusieurs mots d'axe et 'tous' les décalages doivent être programmés pour des arcs de moins de 360 degrés.

source: No axis words and both offsets must be programmed for full circles. The 'P' word defaults to 1 and is optional.
fr: Aucun mots d'axe mais tous les décalages doivent être programmés pour un cercle complet. Le mot 'P', par défaut à 1, est facultatif.

source: For more information on 'Absolute Arc Distance Mode see the <<sec:G90_1-G91_1,G90.1>> section.
fr: Pour d'avantage d'information sur les arcs en mode absolu, voir la <<sec:G90_1-G91_1,section G90.1>>.

source: .XY-plane (G17) ----
fr: .Plan XY (G17) ----

source: G2 or G3 <X- Y- Z- I- J- P-> ----
fr: G2 ou G3 <X- Y- Z- I- J- P-> ----

source: 'Z' - helix
fr: 'Z' - hélicoïde

source: 'I' - X offset
fr: 'I' - décalage en X

source: 'J' - Y offset
fr: 'J' - décalage en Y

source: 'P' - number of turns
fr: 'P' - nombre de tours

source: .XZ-plane (G18) ----
fr: .Plan XZ (G18) ----

source: G2 or G3 <X- Z- Y- I- K- P-> ----
fr: G2 ou G3 <X- Z- Y- I- K- P-> ----
