Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/gcode.*.po
Languages: fr

source: The L number is optional and represents the number of repeats. L=0 is not allowed. If the repeat feature is used, it is normally used in incremental distance mode, so that the same sequence of motions is repeated in several equally spaced places along a straight line. When L- is greater than 1 in incremental mode with the XY-plane selected, the X and Y positions are determined by adding the given X and Y numbers either to the current X and Y positions (on the first go-around) or to the X and Y positions at the end of the previous go-around (on the repetitions). Thus, if you program 'L10' , you will get 10 cycles. The first cycle will be distance X,Y from the original location. The R and Z positions do not change during the repeats. The L number is not sticky. In absolute distance mode, L>1 means 'do the same cycle in the same place several times', Omitting the L word is equivalent to specifying L=1.
fr: Le mot L est facultatif et représente le nombre de répétitions. L=0 n'est pas permis. Si les fonctionnalités de répétition sont utilisées, elles le sont normalement en mode relatif, de sorte que la même séquence de mouvements se répète à plusieurs emplacements régulièrement espacés le long d'une ligne droite. Quand L>1 en mode relatif et XY comme plan courant, les positions X et Y sont déterminées en ajoutant les valeurs X et Y de la commande à celles de la position courante, pour le premier trajet ou ensuite, à celles de la position finale du précédent trajet, pour les répétitions. Ainsi, si vous programmez `L10`, vous obtiendrez 10 cycles. Le premier cycle sera la distance X, Y depuis la position d'origine. Les positions de R- et Z- ne changent pas durant toutes les répétitions. En mode absolu, L>1 signifie `faire le même cycle à la même place plusieurs fois`, omis, le mot L est équivalent à L=1. La valeur de L n'est pas 'sticky'.

source: === Retract Mode[[sec:Retract-Mode]]
fr: === Mode de retrait[[sec:Retract-Mode]]

source: The height of the retract move at the end of each repeat (called 'clear Z' in the descriptions below) is determined by the setting of the retract mode: either to the original Z position (if that is above the R position and the retract mode is 'G98', OLD_Z), or otherwise to the R position. See the <<sec:G98-G99-Set,G98 G99>> Section.
fr: La hauteur du mouvement de retrait à la fin de chaque répétition (appelée 'plan de retrait' dans les descriptions suivantes) est déterminée par le mode de retrait: retrait sur la position initiale de Z, si elle est au dessus de la valeur de R et que le mode de retrait est 'G98', OLD_Z, sinon, à la position de R. Voir la section <<sec:G98-G99-Set, sur les options du plan de retrait>>.

source: === Canned Cycle Errors[[sec:Canned-Cycle-Errors]]
fr: === Erreurs des cycles de perçage[[sec:Canned-Cycle-Errors]]

source: axis words are all missing during a canned cycle,
fr: Tous les mots d'axes sont manquants durant un cycle de perçage.

source: axis words from different groups (XYZ) (UVW) are used together,
fr: Des mots d'axes de différents groupes (XYZ) (UVW) sont utilisés.

source: a P number is required and a negative P number is used,
fr: Un nombre P est requis mais un nombre P négatif est utilisé.

source: an L number is used that does not evaluate to a positive integer,
fr: Un nombre L est utilisé mais n'est pas un entier positif.

source: rotary axis motion is used during a canned cycle,
fr: Un mouvement d'axe rotatif est utilisé durant un cycle de perçage.

source: inverse time feed rate is active during a canned cycle,
fr: Une vitesse inverse du temps est activée durant un cycle de perçage.

source: or cutter compensation is active during a canned cycle.
fr: La compensation d'outil est activée durant un cycle de perçage.

source: If the XY plane is active, the Z number is sticky, and it is an error if:
fr: Quand le plan XY est actif, la valeur de Z est 'sticky', et c'est une erreur si:

source: * the Z number is missing and the same canned cycle was not already active, * or the R number is less than the Z number.
fr: * La valeur de Z est manquante alors qu'un même cycle de perçage n'a pas encore été activé. * La valeur de R est inférieure à celle de Z.

source: If other planes are active, the error conditions are analogous to the XY conditions above.
fr: Si un autre plan est actif, les conditions d'erreur sont analogues à celles du plan XY décrites ci-dessus.

source: [[section:preliminary-motion]] === Preliminary and In-Between Motion
fr: === Mouvement préliminaire et Intermédiaire[[sec:Mouvement-Preliminaire]]

source: Preliminary motion is a set of motions that is common to all of the milling canned cycles. If the current Z position is below the R position, the Z axis does a <<sec:G0,rapid move>> to the R position. This happens only once, regardless of the value of L.
fr: Le mouvement préliminaire est un ensemble de mouvements commun à tous les cycles de perçage. Si la position courante de Z est en dessous de la position de retrait R, l'axe Z va, <<sec:G0,en vitesse rapide>> à la position R. Ceci n'arrive qu'une fois, sans tenir compte de la valeur de L.

source: In addition, at the beginning of the first cycle and each repeat, the following one or two moves are made
fr: En plus, au début du premier cycle et à chaque répétition, un ou deux des mouvements suivants sont faits:

source: . A <<sec:G0,rapid move>> parallel to the XY-plane to the given XY-position, . The Z-axis make a rapid move to the R position, if it is not already at the R position.
fr: . Un déplacement <<sec:G0,en vitesse rapide>>, parallèle au plan XY, vers le position programmée. . Un déplacement en vitesse rapide de l'axe Z vers la position de retrait R, si il n'est pas déjà à cette position R.

source: If another plane is active, the preliminary and in-between motions are analogous.
fr: Si un autre plan est actif, le mouvement préliminaire et intermédiaire est analogue.

source: === Why use a canned cycle?
fr: === Pourquoi utiliser les cycles de perçage ?

source: There are at least two reasons for using canned cycles. The first is the economy of code. A single bore would take several lines of code to execute.
fr: Il y a au moins deux raisons, la première est l'économie de code. Un simple trou demande plusieurs lignes de code pour être exécuté.

source: The G81 <<G81-example-1,Example 1>> demonstrates how a canned cycle could be used to produce 8 holes with ten lines of G code within the canned cycle mode. The program below will produce the same set of 8 holes using five lines for the canned cycle. It does not follow exactly the same path nor does it drill in the same order as the earlier example. But the program writing economy of a good canned cycle should be obvious.
fr: L'<<sec:G81-exemple1,exemple 1>> démontre comment un cycle de perçage peut être utilisé pour produire 8 perçages avec 10 lignes de G-code dans un cycle fixe. Le programme suivant produira le même ensemble de 8 perçages mais, utilisera 8 lignes de code en mode cycle de perçage. Ils ne suivront pas exactement les même chemins et ne perceront pas dans le même ordre. Mais l'économie d'écriture du programme est évidente.

source: .Eight Holes ----
fr: .Perçage de huit trous, réécrit. [source,{ngc}] ----

source: G90 G0 X0 Y0 Z0 (move coordinate home) G1 F10 X0 G4 P0.1 G91 G81 X1 Y0 Z-1 R1 L4(canned drill cycle) G90 G0 X0 Y1 Z0 G91 G81 X1 Y0 Z-0.5 R1 L4(canned drill cycle) G80 (turn off canned cycle) M2 (program end) ----
fr: G90 G0 X0 Y0 Z0 (coordonnées d'origine) G1 F10 X0 G4 P0.1 G91 G81 X1 Y0 Z-1 R1 L4 (cycle de perçage) G90 G0 X0 Y1 Z0 G91 G81 X1 Y0 Z-.5 R1 L4 (cycle de perçage) G80 (révocation du cycle G81) M2 (fin de programme) ----

source: image::images/eight.png[align="center"]
fr: image::images/eight.png[align="left"]

source: .Twelve Holes in a Square
fr: .Douze trous en carré

source: This example demonstrates the use of the L word to repeat a set of incremental drill cycles for successive blocks of code within the same G81 motion mode. Here we produce 12 holes using five lines of code in the canned motion mode.
fr: Cet exemple montre l'utilisation du mot L pour répéter une série incrémentale de cycles de perçage pour des blocs de code successifs dans le même mode mouvements G81. Ici, nous produisons 12 trous au moyen de 5 lignes de code pour les cycles de perçage.

source: G90 G0 X0 Y0 Z0 (move coordinate home) G1 F50 X0 G4 P0.1 G91 G81 X1 Y0 Z-0.5 R1 L4 (canned drill cycle) X0 Y1 R0 L3 (repeat) X-1 Y0 L3 (repeat) X0 Y-1 L2 (repeat) G80 (turn off canned cycle) G90 G0 X0 (rapid move home) Y0 Z0 M2 (program end) ----
fr: G90 G0 X0 Y0 Z0 (coordonnées d'origine) G1 F50 X0 G4 P0.1 G91 G81 X1 Y0 Z-0.5 R1 L4 (cycle de perçage) X0 Y1 R0 L3 (répétition) X-1 Y0 L3 (répétition) X0 Y-1 L2 (répétition) G80 (révocation du cycle G81) G90 G0 X0 (retour vers l'origine en vitesse rapide) Y0 Z0 M2 (fin de programme) ----

source: image::images/twelve.png[align="center"]
fr: image::images/twelve.png[align="left"]

source: The second reason to use a canned cycle is that they all produce preliminary moves and returns that you can anticipate and control regardless of the start point of the canned cycle.
fr: La deuxième raison d'utiliser les cycles de perçages, c'est qu'il produisent un mouvement préliminaire et retournent à une position prévisible et contrôlable, quel que soit le point de départ du cycle.

source: [[sec:G80-Cancel-Modal]] == G80 Cancel Canned Cycle (((G80 Cancel Modal Motion)))
fr: == G80 Révocation des codes modaux[[sec:G80-Revocation]] (((G80 Révocation des codes modaux)))

source: * 'G80' - cancel canned cycle modal motion. 'G80' is part of modal group 1, so programming any other G code from modal group 1 will also cancel the canned cycle.
fr: * 'G80' - Révoque tous les cycles de mouvements modaux. 'G80' appartient au groupe 1, programmer n'importe quel G-code modal du groupe 1 le révoquera.

source: Axis words are programmed when G80 is active.
fr: Des mots d'axes sont programmés quand G80 est actif.

source: .G80 Example ----
fr: .Exemple 1 avec G80: [source,{ngc}] ----

source: G90 G81 X1 Y1 Z1.5 R2.8 (absolute distance canned cycle) G80 (turn off canned cycle motion) G0 X0 Y0 Z0 (rapid move to coordinate home) ----
fr: G90 G81 X1 Y1 Z1.5 R2.8 (cycle de perçage en mode de déplacement absolu) G80 (révoque G81) G0 X0 Y0 Z0 (active les mouvements en vitesse rapide et se déplace en X0, Y0 et Z0) ----

source: The following code produces the same final position and machine state as the previous code.
fr: L'exemple suivant, produit les mêmes déplacements et le même état final de la machine que l'exemple précédent.

source: G90 G81 X1 Y1 Z1.5 R2.8 (absolute distance canned cycle) G0 X0 Y0 Z0 (rapid move to coordinate home) ----
fr: G90 G81 X1 Y1 Z1.5 R2.8 (cycle de perçage en mode de déplacement absolu) G0 X0 Y0 Z0 (active les mouvements en vitesse rapide et se déplace en X0, Y0 et Z0) ----

source: The advantage of the first set is that, the G80 line clearly turns off the G81 canned cycle. With the first set of blocks, the programmer must turn motion back on with G0, as is done in the next line, or any other motion mode G word.
fr: L'avantage du premier exemple est que la ligne du G80 révoque clairement le cycle G81. Avec ce premier programme, le programmeur doit revenir en mode mouvement avec G0, comme c'est fait sur la ligne suivante, ou tout autre mot G de mouvement.

source: If a canned cycle is not turned off with G80 or another motion word, the canned cycle will attempt to repeat itself using the next block of code that contains an X, Y, or Z word. The following file drills (G81) a set of eight holes as shown in the following caption.
fr: Si un cycle de perçage n'est pas révoqué avec G80 ou un autre mot G de mouvement, le cycle de perçage attend de se répéter en utilisant la prochaine ligne de code contenant un ou plusieurs mots d'axe. Le fichier suivant perce (G81) un ensemble de huit trous, tel que montré sur l'image qui suit.

source: .G80 Example 1 ----
fr: .Exemple 2 avec G80: ----

source: N100 G90 G0 X0 Y0 Z0 (coordinate home) N110 G1 X0 G4 P0.1 N120 G81 X1 Y0 Z0 R1 (canned drill cycle) N130 X2 N140 X3 N150 X4 N160 Y1 Z0.5 N170 X3 N180 X2 N190 X1 N200 G80 (turn off canned cycle) N210 G0 X0 (rapid move home) N220 Y0 N230 Z0 N240 M2 (program end) ----
fr: N100 G90 G0 X0 Y0 Z0 (coordonnées d'origine) N110 G1 X0 G4 P0.1 N120 G81 X1 Y0 Z0 R1 (cycle de perçage) N130 X2 N140 X3 N150 X4 N160 Y1 Z0.5 N170 X3 N180 X2 N190 X1 N200 G80 (révocation du cycle G81) N210 G0 X0 (mouvement en vitesse rapide) N220 Y0 N230 Z0 N240 M2 (fin du programme) ----

source: [NOTE] Notice the z position change after the first four holes. Also, this is one of the few places where line numbers have some value, being able to point a reader to a specific line of code.
fr: [NOTE] Noter que la position de Z change après les quatre premiers trous. C'est également un des rares cas dans lesquels les numéros de lignes sont présents, permettant d'envoyer le lecteur sur une ligne de code spécifique.

source: .G80 Cycle[[cap:G80-Cycle]]
fr: .Cycle G80[[cap:G80-Cycle]]

source: image::images/G81mult.png[align="center"]
fr: image::images/G81mult.png[align="left"]

source: The use of G80 in line N200 is optional because the G0 on the next line will turn off the G81 cycle. But using the G80 as shown in Example 1, will provide for easier to read canned cycle. Without it, it is not so obvious that all of the blocks between N120 and N200 belong to the canned cycle.
fr: L'utilisation du G80 de la ligne N200 est facultative puisqu'il y a un G0 sur la ligne suivante qui révoque le cycle G81. Mais utiliser G80, comme l'exemple 2 le montre, donne une meilleure lisibilité au programme. Sans ce G80, il ne serait pas aussi évident que tous les blocs compris entre N120 et N200 appartiennent au cycle de perçage.

source: [[sec:G81-Drilling-Cycle]] == G81 Drilling Cycle
fr: == G81 Cycle de perçage[[sec:G81-Cycle-percage]]

source: (((G81 Drilling Cycle)))
fr: (((G81 Cycle de perçage)))

source: G81 (X- Y- Z-) or (U- V- W-) R- L- ----
fr: G81 (X- Y- Z- ) ou (U- V- W- ) R- L- ----

source: The 'G81' cycle is intended for drilling.
fr: Le cycle 'G81' est destiné au perçage.

source: The cycle functions as follows:
fr: Il fonctionne de la manière suivante:

source: . Preliminary motion, as described in the <<section:preliminary-motion,Preliminary and In-Between Motion>> section.
fr: . Un mouvement préliminaire, comme décrit sur cette <<sec:Mouvement-Preliminaire,page>>.

source: . Move the Z-axis at the current <<sec:F-feed-rate,feed rate>> to the Z position.
fr: . Un déplacement de l'axe Z seul en <<sec:F-Vitesse,vitesse travail>>, vers la position Z programmée.

source: . The Z-axis does a <<sec:G0,rapid move>> to clear Z.
fr: . Retrait de l'axe Z en <<sec:G0,vitesse rapide>>.

source: .Example 1 - Absolute Position G81[[G81-example-1]]
fr: .Exemple 1: G81 en position absolue[[sec:G81-exemple1]]

source: Suppose the current position is (X1, Y2, Z3) and the following line of NC code is interpreted.
fr: Supposons que la position courante soit, X1, Y2, Z3 dans le plan XY, la ligne de code suivante est interprétée.

source: G90 G98 G81 X4 Y5 Z1.5 R2.8 ----
fr: G90 G81 G98 X4 Y5 Z1.5 R2.8 ----

source: This calls for absolute distance mode (G90) and OLD_Z retract mode (G98) and calls for the G81 drilling cycle to be performed once.
fr: Le mode de déplacements absolus est appelé '(G90)', le plan de retrait est positionné sur OLD_Z '(G98)' et l'appel du cycle de perçage 'G81' va lancer ce cycle une fois.

source: The X value and X position are 4.
fr: La position X deviendra celle demandée, X4.

source: The Y value and Y position are 5.
fr: La position de Y deviendra celle demandée, Y5.

source: The Z value and Z position are 1.5.
fr: La position de Z deviendra celle demandée, Z1.5.

source: The R value and clear Z are 2.8. OLD_Z is 3.
fr: La valeur de R fixe le plan de retrait de Z à 2.8. La valeur de OLD_Z est 3.

source: The following moves take place:
fr: Les mouvements suivants vont se produire:

source: . a <<sec:G0,rapid move>> parallel to the XY plane to (X4, Y5)
fr: . Un mouvement en <<sec:G0,vitesse rapide>>, parallèle au plan XY vers (X4, Y5)

source: . a rapid move move parallel to the Z-axis to (Z2.8).
fr: . Un mouvement en vitesse rapide, parallèle à l'axe Z vers (Z2.8)

source: . move parallel to the Z-axis at the <<sec:F-feed-rate,feed rate>> to (Z1.5)
fr: . Un mouvement en <<sec:F-Vitesse,vitesse travail>>, parallèle à l'axe Z vers (Z1.5)

source: . a rapid move parallel to the Z-axis to (Z3)
fr: . Un mouvement en vitesse rapide, parallèle à l'axe Z vers (Z3)

source: image::images/G81ex1.png[align="center"]
fr: image::images/G81ex1.png[align="left"]

source: .Example 2 - Relative Position G81
fr: .Exemple 2: G81 en position relative

source: This calls for incremental distance mode (G91) and OLD_Z retract mode (G98). It also calls for the G81 drilling cycle to be repeated three times. The X value is 4, the Y value is 5, the Z value is -0.6 and the R value is 1.8. The initial X position is 5 (=1+4), the initial Y position is 7 (=2+5), the clear Z position is 4.8 (=1.8+3), and the Z position is 4.2 (=4.8-0.6). OLD_Z is 3.
fr: Le mode de déplacements incrémentaux est appelé '(G91)', le plan de retrait est positionné sur OLD_Z '(G98)', l'appel du cycle de perçage 'G81' demande 3 répétitions du cycle. La valeur demandée de X est 4, la valeur demandée de Y est 5, la valeur demandée de Z est -0.6 et le plan de retrait R est à 1.8. La position initiale de X est à 5 (1+4), la position initiale de Y est à 7 (2+5), le plan de retrait en Z est positionné sur 4.8 (1.8+3) et Z est positionné sur 4.2 (4.8-0.6). OLD_Z est à 3.

source: The first preliminary move is a maximum rapid move along the Z axis to (X1,Y2,Z4.8), since OLD_Z < clear Z.
fr: Le premier mouvement en vitesse rapide le long de l'axe Z vers (X1, Y2, Z4.8), puisque OLD_Z est inférieur au retrait en Z.

source: The first repeat consists of 3 moves.
fr: La première répétition produira 3 mouvements.

source: . a <<sec:G0,rapid move>> parallel to the XY-plane to (X5, Y7)
fr: . Un déplacement en vitesse rapide, parallèle au plan XY vers (X5, Y7)

source: . move parallel to the Z-axis at the <<sec:F-feed-rate,feed rate>> to (Z4.2)
fr: . Un déplacement en vitesse travail, parallèle à l'axe Z vers (Z4.2)

source: . a rapid move parallel to the Z-axis to (X5, Y7, Z4.8)
fr: . Un déplacement en vitesse rapide, parallèle à l'axe Z vers (X5, Y7, Z4.8)

source: The second repeat consists of 3 moves. The X position is reset to 9 (=5+4) and the Y position to 12 (=7+5).
fr: La deuxième répétition produira 3 mouvements. La position de X est augmentée de 4 et passe à 9, la position de Y est augmentée de 5 et passe à 12.

source: . a <<sec:G0,rapid move>> parallel to the XY-plane to (X9, Y12, Z4.8)
fr: . Un déplacement en vitesse rapide, parallèle au plan XY vers (X9, Y12, Z4.8)

source: . move parallel to the Z-axis at the feed rate to (X9, Y12, Z4.2)
fr: . Un déplacement en vitesse travail, parallèle à l'axe Z vers (X9, Y12, Z4.2)

source: . a rapid move parallel to the Z-axis to (X9, Y12, Z4.8)
fr: . Un déplacement en vitesse rapide, parallèle à l'axe Z vers (X9, Y12, Z4.8)

source: The third repeat consists of 3 moves. The X position is reset to 13 (=9+4) and the Y position to 17 (=12+5).
fr: La troisième répétition produira 3 mouvements. La position de X est augmentée de 4 et passe à 13, la position de Y est augmentée de 5 et passe à 17.

source: . a <<sec:G0,rapid move>> parallel to the XY-plane to (X13, Y17, Z4.8)
fr: . Un déplacement en vitesse rapide, parallèle au plan XY vers (X13, Y17, Z4.8)

source: . move parallel to the Z-axis at the feed rate to (X13, Y17, Z4.2)
fr: . Un déplacement en vitesse travail, parallèle à l'axe Z vers (X13, Y17, Z4.2)

source: . a rapid move parallel to the Z-axis to (X13, Y17, Z4.8)
fr: . Un déplacement en vitesse rapide, parallèle à l'axe Z vers (X13, Y17, Z4.8)

source: image::images/G81ex2.png[align="center"]
fr: image::images/G81ex2.png[align="left"]

source: .Example 3 - Relative Position G81
fr: .Exemple 3: G81 en position relative

source: Now suppose that you execute the first G81 block of code but from (X0, Y0, Z0) rather than from (X1, Y2, Z3).
fr: Supposons maintenant que le premier G81 du code soit exécuté, mais depuis (X0, Y0, Z0) plutôt que de (X1, Y2, Z3).

source: Since OLD_Z is below the R value, it adds nothing for the motion but since the initial value of Z is less than the value specified in R, there will be an initial Z move during the preliminary moves.
fr: Puisque OLD_Z est inférieur à la valeur de R, il n'ajoute rien au mouvement, mais puisque la valeur initiale de Z est inférieure à la valeur spécifiée dans R, un premier mouvement de Z sera effectué durant les mouvements préliminaires.

source: image::images/G81.png[align="center"]
fr: image::images/G81.png[align="left"]

source: .Example 4 - Absolute G81 R > Z
fr: .Exemple 4: G81 en absolu avec R > Z

source: This is a plot of the path of motion for the second g81 block of code.
fr: Il s'agit de la trajectoire pour le second bloc de code de G81.

source: Since this plot starts with (X0, Y0, Z0), the interpreter adds the initial Z0 and R1.8 and rapid moves to that location. After that initial Z move, the repeat feature works the same as it did in example 3 with the final Z depth being 0.6 below the R value.
fr: Cette trajectoire commence en (X0, Y0, Z0), l'interpréteur ajoute les valeurs initiales Z0 et R1.8 et déplace le mobile en vitesse rapide vers cet emplacement. Après ce déplacement initial de Z, la répétition fonctionne de manière identique à celle de l'exemple 3 avec le mouvement final de Z à 0.6 en dessous de la valeur de R.

source: image::images/G81a.png[align="center"]
fr: image::images/G81a.png[align="left"]

source: .Example 5 - Relative position R > Z
fr: .Exemple 5: G81 en relatif avec R > Z

source: Since this plot starts with (X0, Y0, Z0), the interpreter adds the initial Z0 and R1.8 and rapid moves to that location as in 'Example 4'. After that initial Z move, the <<sec:G0,rapid move>> to X4 Y5 is done. Then the final Z depth being 0.6 below the R value. The repeat function would make the Z move in the same location again.
fr: Puisque ce tracé commence en (X0, Y0, Z0), l'interpréteur ajoute R1.8 au Z0 initial et déplace le mobile en vitesse rapide à cet emplacement, comme dans 'l'exemple 4'. Après ce mouvement initial à une hauteur Z0.6, le mouvement en vitesse rapide se termine en X4 Y5. Alors la hauteur Z sera à 0.6 en dessous de la valeur de R. La fonction de répétition fera encore déplacer Z au même emplacement.

source: [[sec:G82-Drilling-Dwell]] == G82 Drilling Cycle, Dwell (((G82 Drilling Cycle Dwell)))
fr: == G82 Cycle de perçage avec tempo[[sec:G82-Cycle-percage]]

source: G82 (X- Y- Z-) or (U- V- W-) R- L- P- ----
fr: G82 (X- Y- Z- ) ou (U- V- W- ) R- L- P- ----

source: The 'G82' cycle is intended for drilling with a dwell at the bottom of the hole.
fr: Le cycle 'G82' est destiné au perçage avec tempo en fond de perçage.

source: . Preliminary motion, as described in the <<section:preliminary-motion,Preliminary and In-Between Motion>> section. . Move the Z-axis at the current <<sec:F-feed-rate,feed rate>> to the Z position. . Dwell for the P number of seconds. . The Z-axis does a <<sec:G0,rapid move>> to clear Z.
fr: . Un mouvement préliminaire. Comme décrit <<sec:Mouvement-Preliminaire,sur cette page>>. . Un déplacement de l'axe Z seul en vitesse programmée, vers la position Z programmée. . Une temporisation de 'P' secondes. . Retrait de l'axe Z en vitesse rapide jusqu'au plan de retrait 'R'.
