Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/m-code.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = M Codes
fr: = Les M-codes

source: [[cha:m-codes]] (((M Codes)))
fr: [[cha:M-codes]] (((Les M-codes)))

source: == M Code Quick Reference Table [[m-code-quick-reference]] [width="60%", options="header", cols="2^,5<"] |======================================== |Code | Description |<<sec:M0-M1,M0 M1>> | Program Pause |<<sec:M2-M30,M2 M30>> | Program End |<<sec:M60, M60>> | Pallet Change Pause |<<sec:M3-M4-M5,M3 M4 M5>> | Spindle Control |<<sec:M6-Tool-Change,M6>> | Tool Change |<<sec:M7-M8-M9,M7 M8 M9>> | Coolant Control |<<sec:M19,M19>> | Orient Spindle |<<sec:M48-M49-Override,M48 M49>> | Feed & Spindle Overrides Enable/Disable |<<sec:M50-Feed-Override,M50>> | Feed Override Control |<<sec:M51-Spindle-Override,M51>> | Spindle Override Control |<<sec:M52-Adaptive-Feed-Control,M52>> | Adaptive Feed Control |<<sec:M53-Feed-Stop-Control,M53>> | Feed Stop Control |<<sec:M61-Set-Current-Tool-Number,M61>> | Set Current Tool Number |<<sec:M62-M65,M62-M65>> | Output Control |<<sec:M66-Input-Control,M66>> | Input Control |<<sec:M67-Analog-Output,M67>> | Analog Output Control |<<sec:M68-Analog-Output,M68>> | Analog Output Control |<<sec:M70-Save-Modal-State,M70>> | Save Modal State |<<sec:M71-Invalidate-Stored-Modal-State,M71>> | Invalidate Stored Modal State |<<sec:M72-Restore-Modal-State,M72>> | Restore Modal State |<<sec:M73-Save-Autorestore-Modal-State,M73>> | Save Autorestore Modal State |<<sec:M100-to-M199,M100-M199>> | User Defined M-Codes |========================================
fr: == Table des M-codes [[m-code-quick-reference]] [width="60%", options="header", cols="2^,5<",align="left"] |===================================================== | Code | Description |<<sec:M0-M1,M0 M1>> | Pause dans le programme |<<sec:M2-M30,M2 M30>> | Fin de programme |<<sec:M60,M60>> | Pause pour déchargement pièce |<<sec:M3-M4-M5,M3 M4 M5>> | Contrôle de la broche |<<sec:M6-Appel-Outil,M6>> | Appel d'outil |<<sec:M7-M8-M9,M7 M8 M9>> | Contrôle des lubrifiants |<<sec:M19,M19>> | Orientation de la broche |<<sec:M48-M49,M48 M49>> | Contrôle des correcteurs de vitesse |<<sec:M50,M50>> | Contrôle du correcteur de vitesse travail |<<sec:M51,M51>> | Contrôle du correcteur de vitesse de broche |<<sec:M52,M52>> | Correcteur dynamique de vitesse d'avance |<<sec:M53,M53>> | Contrôle de la coupure de vitesse |<<sec:M61,M61>> | Correction du numéro de l'outil courant |<<sec:M62-a-M65,M62 à M65>> | Contrôle de sortie numérique |<<sec:M66,M66>> | Contrôle d'entrée numérique et analogique |<<sec:M67,M67>> | Contrôle sortie analogique synchronisée |<<sec:M68,M68>> | Contrôle sortie analogique directe |<<sec:M70,M70>> | Enregistre l'état modal |<<sec:M71,M71>> | Invalide l'état modal enregistré |<<sec:M72,M72>> | Restaure l'état modal |<<sec:M73,M73>> | Enregistrement/auto-restauration de l'état modal |<<sec:M100-a-M199, M100 à M199 >> | M-codes définis par l'utilisateur |=====================================================

source: [[sec:M0-M1]] == M0, M1 Program Pause (((M0 Program Pause)))(((M1 Program Optional Pause)))
fr: == M0, M1, pause dans le programme[[sec:M0-M1]] (((M0 M1 Pause)))

source: * 'M0' - pause a running program temporarily. LinuxCNC remains in the Auto Mode so MDI and other manual actions are not enabled. Pressing the cycle start button will restart the program at the following line.
fr: * 'M0' - Effectue une pause temporaire du programme en cours. LinuxCNC reste en mode automatique afin que le MDI ou d'autres actions manuelles ne puissent pas être activés. Presser le départ cycle relance le programme à la ligne suivante.

source: * 'M1' - pause a running program temporarily if the optional stop switch is on. LinuxCNC remains in the Auto Mode so MDI and other manual actions are not enabled. Pressing the cycle start button will restart the program at the following line.
fr: * 'M1' - Effectue une pause temporaire du programme en cours, si le commutateur facultatif Stop est activé. LinuxCNC reste en mode automatique afin que le MDI ou d'autres actions manuelles ne puissent pas être activés. Presser le départ cycle relance le programme à la ligne suivante.

source: [NOTE] It is OK to program 'M0' and 'M1' in MDI mode, but the effect will probably not be noticeable, because normal behavior in MDI mode is to stop after each line of input anyway.
fr: [NOTE] Il est permis de programmer 'M0' et 'M1' en mode données manuelles (MDI), mais l'effet ne sera probablement pas perceptible, puisque le comportement normal en mode MDI est de s'arrêter, de toute façon, à la fin de chaque ligne.

source: [[sec:M2-M30]] == M2, M30 Program End (((M2 Program End)))(((M30 Program End)))
fr: == M2, M30, fin de programme[[sec:M2-M30]] (((M2 M30 Fin de programme)))

source: * 'M2' - end the program. Pressing cycle start will start the program at the beginning of the file.
fr: * 'M2' - Termine le programme. Presser le départ cycle après cette commande relance le programme au début du fichier.

source: * 'M30' - exchange pallet shuttles and end the program. Pressing cycle start will start the program at the beginning of the file.
fr: * 'M30' - Décharge le porte-pièce du chargeur et termine le programme. Presser le départ cycle après cette commande relance le programme au début du fichier.

source: Both of these commands have the following effects:
fr: Les deux commandes précédentes produisent les effets suivants:

source: . Change from Auto mode to MDI mode. . Origin offsets are set to the default (like 'G54'). . Selected plane is set to XY plane (like 'G17'). . Distance mode is set to absolute mode (like 'G90'). . Feed rate mode is set to units per minute (like 'G94'). . Feed and speed overrides are set to ON (like 'M48'). . Cutter compensation is turned off (like 'G40'). . The spindle is stopped (like 'M5'). . The current motion mode is set to feed (like 'G1'). . Coolant is turned off (like 'M9').
fr: . Changement du mode automatique au mode MDI. . Les décalages d'axes sont mis aux valeurs par défaut (comme avec 'G54'). . Le plan de travail actif devient XY (comme avec 'G17'). . Le mode de déplacement devient absolu (comme avec 'G90'). . La vitesse travail passe en unités par minute (comme avec 'G94'). . Les correcteurs de vitesse sont activés (comme avec 'M48'). . Les compensations d'outil sont désactivées (comme avec 'G40'). . La broche est arrêtée (comme avec 'M5'). . Le mode mouvement courant devient 'G1' (comme avec 'G1'). . Le lubrifiant est coupé (comme avec 'M9').

source: [NOTE] Lines of code after M2/M30 will not be executed. Pressing cycle start will start the program at the beginning of the file.
fr: [NOTE] Les lignes de code placées après un 'M2' ou un 'M30' ne sont pas exécutées.

source: [[sec:M60]] == M60 Pallet Change Pause (((M60 Pallet Change Pause)))
fr: == M60, pause pour déchargement pièce[[sec:M60]] (((M60 Pause pour déchargement pièce)))

source: * 'M60' - exchange pallet shuttles and then pause a running program temporarily (regardless of the setting of the optional stop switch). Pressing the cycle start button will restart the program at the following line.
fr: * 'M60' - Procède au changement de porte-pièce avec le chargeur de pièces et effectue une pause dans le programme en cours (quel que soit le réglage du bouton d'arrêt facultatif). Presser ensuite le bouton de départ cycle relance le programme à la ligne suivante.

source: [[sec:M3-M4-M5]] == M3, M4, M5 Spindle Control (((M3 Spindle CW)))(((M4 Spindle CCW)))(((M5 Spindle Stop)))
fr: == M3, M4, M5 Contrôle de la vitesse de broche[[sec:M3-M4-M5]] (((M3 M4 M5 Ctrl Broche)))

source: 'M3' - start the spindle clockwise at the 'S' speed.
fr: 'M3' - Démarre la broche en sens horaire à la vitesse 'S'.

source: 'M4' - start the spindle counterclockwise at the 'S' speed.
fr: 'M4' - Démarre la broche en sens anti-horaire à la vitesse 'S'.

source: 'M5' - stop the spindle.
fr: 'M5' - Stoppe la rotation de la broche.

source: It is OK to use 'M3' or 'M4' if the <<sec:S-spindle-speed,S>> spindle speed is set to zero. If this is done (or if the speed override switch is enabled and set to zero), the spindle will not start turning. If, later, the spindle speed is set above zero (or the override switch is turned up), the spindle will start turning. It is OK to use 'M3' or 'M4' when the spindle is already turning or to use 'M5' when the spindle is already stopped.
fr: Il est permis d'utiliser 'M3' ou 'M4' si la vitesse de broche est à zéro. Si cela est fait (ou si le bouton du correcteur de vitesse est activé mais mis à zéro), la broche ne tournera pas. Si, plus tard la vitesse de broche est augmentée (ou que le correcteur de vitesse est augmenté), la broche va se mettre en rotation. Il est permis d'utiliser 'M3' ou 'M4' quand la broche est déjà en rotation ou d'utiliser 'M5' quand la broche est déjà arrêtée.

source: [[sec:M6-Tool-Change]] == M6 Tool Change (((M6-Tool-Change)))
fr: == M6 Appel d'outil[[sec:M6-Appel-Outil]] (((M6 Appel d'outil)))

source: === Manual Tool Change
fr: === Changement d'outil manuel

source: If the HAL component hal_manualtoolchange is loaded, M6 will stop the spindle and prompt the user to change the tool based on the last 'T-' number programmed. For more information on hal_manualtoolchange see the (<<sec:Manual-Tool-Change,Manual Tool Change>>) Section.
fr: Si le composant de HAL, hal_manualtoolchange est chargé, 'M6' va arrêter la broche et inviter l'utilisateur à changer l'outil appelé par le dernier mot 'T' programmé. Pour plus d'informations sur hal_manualtoolchange voir la section sur le <<sec:Changement-D-Outil-Manuel,changement manuel d'outil>>.

source: === Tool Changer
fr: === Changement d'outil

source: To change a tool in the spindle from the tool currently in the spindle to the tool most recently selected (using a T word - see Section <<sec:T-Select-Tool,Select Tool>>), program 'M6'. When the tool change is complete:
fr: Pour changer l'outil, actuellement dans la broche, par un autre, nouvellement sélectionné en utilisant le mot T, voir la section <<sec:T-Choix-Outil, sur le choix de l'outil>>, programmer 'M6'. Un changement d'outil complet donnera:

source: The spindle will be stopped.
fr: La rotation de la broche est arrêtée.

source: * The tool that was selected (by a T word on the same line or on any line after the previous tool change) will be in the spindle. * If the selected tool was not in the spindle before the tool change, the tool that was in the spindle (if there was one) will be placed back into the tool changer magazine. * If configured in the .ini file some axis positions may move when a M6 is issued. See the EMCIO section of the Integrator's Manual for more information on tool change options. * No other changes will be made. For example, coolant will continue to flow during the tool change unless it has been turned off by an 'M9'.
fr: * L'outil qui a été sélectionné (par le mot T sur la même ligne ou sur n'importe quelle ligne après le changement d'outil précédent), sera placé dans la broche. Le mot T est un nombre entier indiquant le numéro de poche d'outil dans le carrousel (non son index). * Si l'outil sélectionné n'est pas déjà dans la broche avant le changement d'outil, l'outil qui était dans la broche, s'il y en avait un, va être replacé dans le magasin du changeur. * Si configurés dans le fichier ini, certains axes peuvent être déplacés quand un M6 est émis. Voir la section EMCIO du manuel de configuration pour d'autres informations sur le changement d'outil. * Aucune autre modification ne sera apportée. Par exemple, le lubrifiant continue de couler durant le changement d'outil à moins qu'il ne soit arrêté par 'M9'.

source: [WARNING] The tool length offset is not changed by 'M6', use 'G43' after the 'M6' to change the tool length offset.
fr: [WARNING] La longueur d'outil n'est pas modifié par 'M6', utilisez un 'G43' après le 'M6' pour corriger la longueur d'outil.

source: The tool change may include axis motion. It is OK (but not useful) to program a change to the tool already in the spindle. It is OK if there is no tool in the selected slot; in that case, the spindle will be empty after the tool change. If slot zero was last selected, there will definitely be no tool in the spindle after a tool change. The tool changer will have to be setup to perform the tool change in hal and possibly classicladder.
fr: Le changement d'outil peut inclure des mouvements d'axes pendant son exécution. Il est permis (mais inutile) de programmer un changement d'outil avec le même outil que celui qui est déjà dans la broche. Il est permis également, si il n'y a pas d'outil dans le slot sélectionné, dans ce cas, la broche sera vide après le changement d'outil. Si le slot zéro a été le dernier sélectionné, il n'y aura pas d'outil dans la broche après le changement. Le changeur d'outil devra être configuré dans hal et éventuellement classicladder pour effectuer le changement d'outil.

source: [[sec:M7-M8-M9]] == M7, M8, M9 Coolant Control (((M7 Mist Coolant)))(((M8 Flood Coolant)))(((M9 Coolant Off)))
fr: == M7, M8, M9 Contrôle des lubrifiants[[sec:M7-M8-M9]] (((M7 M8 M9 Lubrifiants)))

source: 'M7' - turn mist coolant on.
fr: 'M7' - Active la lubrification par gouttelettes.

source: 'M8' - turn flood coolant on.
fr: 'M8' - Active la lubrification fluide.

source: 'M9' - turn all coolant off.
fr: 'M9' - Coupe tous les lubrifiants.

source: It is OK to use any of these commands, regardless of the current coolant state.
fr: Il est toujours permis d'utiliser une de ces commandes, que les lubrifiants soient coupés ou non.

source: [[sec:M19]] == M19 Orient Spindle (((M19 Orient Spindle)))
fr: == M19 Orientation de la broche[[sec:M19]] (((M19 Orientation de la broche)))

source: 'R' Position to rotate to from 0, valid range is 0-360 degrees
fr: 'R' - Position à atteindre à partir de 0, cette valeur doit être comprise entre 0 et 360 degrés.

source: * 'Q' Number of seconds to wait until orient completes. If motion.spindle.is_oriented does not become true within Q timeout an error occurs.
fr: * 'Q' - Durée d'attente en secondes pour compléter l'orientation. Si 'motion.spindle.is_oriented' n'est pas devenue vraie dans le temps imparti par Q, une erreur de timeout se produira.

source: * 'P' Direction to rotate to position. ** '0' rotate for smallest angular movement (default) ** '1' always rotate clockwise (same as M3 direction) ** '2' always rotate counterclockwise (same as M4 direction)
fr: * 'P' - Direction de rotation vers la position cible. ** '0' - rotation pour petit mouvement angulaire (défaut) ** '1' - rotation toujours en sens horaire (même direction qu'avec M3) ** '2' - rotation toujours en sens anti-horaire (même direction qu'avec M4)

source: M19 is cleared by any of M3,M4,M5.
fr: M19 est révoqué par M3, M4 ou M5.

source: Spindle orientation requires a differential encoder with an index to sense the spindle shaft position and direction of rotation.
fr: L'orientation de la broche nécessite un codeur de position avec index, indiquant la position de la broche ainsi que sa direction de rotation.

source: INI Settings in the [RS274NGC] section.
fr: Paramètres de réglage de la section [RS274NGC] du fichier ini.

source: ORIENT_OFFSET = 0-360 (fixed offset in degrees added to M19 R word)
fr: ORIENT_OFFSET = 0 à 360 (offset fixe en degrés, ajouté au mot R de M19)

source: HAL Pins
fr: Pins de HAL

source: * 'motion.spindle-orient-angle' (out float) Desired spindle orientation for M19. Value of the M19 R word parameter plus the value of the [RS274NGC]ORIENT_OFFSET ini parameter.
fr: * 'motion.spindle-orient-angle' (sortie float) Orientation souhaitée pour M19. Valeur du mot R de M19, plus la valeur du paramètre d'ini [RS274NGC]ORIENT_OFFSET.

source: * 'motion.spindle-orient-mode' (out s32) Desired spindle rotation mode. Reflects M19 P parameter word, Default = 0
fr: * 'motion.spindle-orient-mode' (sortie s32) Mode de rotation de la broche souhaité. Reflète le mot P de M19, Défaut = 0

source: * 'motion.spindle-orient' (out bit) Indicates start of spindle orient cycle. Set by M19. Cleared by any of M3,M4,M5. If spindle-orient-fault is not zero during spindle-orient true, the M19 command fails with an error message.
fr: * 'motion.spindle-orient' (sortie bit) Indique le début du cycle d'orientation de la broche. Positionné par M19. Remis à zéro par M3,M4 ou M5. Si 'spindle-orient-fault' n'est pas à zéro alors que 'spindle-orient' est vraie la commande M19 échoue avec un message d'erreur.

source: * 'motion.spindle-is-oriented' (in bit) Acknowledge pin for spindle-orient. Completes orient cycle. If spindle-orient was true when spindle-is-oriented was asserted, the spindle-orient pin is cleared and the spindle-locked pin is asserted. Also, the spindle-brake pin is asserted.
fr: * 'motion.spindle-is-oriented' (entrée bit) Pin de confirmation de l'orientation de la broche. Termine le cycle d'orientation. Si 'spindle-orient' est vraie quand 'spindle-is-oriented' est activée, la pin 'spindle-orient' est mise à zéro et la pin 'spindle-locked' est activée. La pin 'spindle-brake' est également activée.

source: * 'motion.spindle-orient-fault' (in s32) Fault code input for orient cycle. Any value other than zero will cause the orient cycle to abort.
fr: * 'motion.spindle-orient-fault' (entrée s32) Entrée de code d'erreur pour le cycle d'orientation. Toute valeur, autre que zéro, provoquera l'abandon du cycle d'orientation.

source: * 'motion.spindle-locked' (out bit) Spindle orient complete pin. Cleared by any of M3,M4,M5.
fr: * 'motion.spindle-locked' (sortie bit) Pin indiquant que le cycle de rotation est terminé. Désactivée par M3, M4 ou M5.

source: [[sec:M48-M49-Override]] == M48, M49 Speed and Feed Override Control (((M48, M49 Override Control)))
fr: == M48, M49 Correcteurs de vitesse[[sec:M48-M49]] (((M48, M49 Autoriser/Inhiber correcteurs)))

source: 'M48' - enable the spindle speed and feed rate override controls.
fr: 'M48' - Autorise les curseurs de correction de vitesse de broche et celui de vitesse d'avance travail.

source: 'M49' - disable both controls.
fr: 'M49' - Inhibe les deux curseurs.

source: It is OK to enable or disable the controls when they are already enabled or disabled. See the <<sub:feed-rate,Feed Rate>> Section for more details.
fr: Il est permis d'autoriser ou d'inhiber ces curseurs quand ils sont déjà autorisés ou inhibés. Voir la section sur la <<sec:F-Vitesse, vitesse d'avance travail>>.

source: [[sec:M50-Feed-Override]] == M50 Feed Override Control (((M50 Feed Override Control)))
fr: == M50 Contrôle du correcteur de vitesse travail[[sec:M50]] (((M50 Contrôle du correcteur de vitesse travail)))

source: * 'M50 <P1>' - enable the feed rate override control. The P1 is optional. * 'M50 P0' - disable the feed rate control.
fr: * 'M50 <P1>' - Autorise le curseur de correction de vitesse d'avance travail. Le paramètre 'P1' est optionnel. * 'M50 P0' - Inhibe le curseur de correction d'avance travail.

source: While disabled the feed override will have no influence, and the motion will be executed at programmed feed rate. (unless there is an adaptive feed rate override active).
fr: Quand il est inhibé, le curseur de correction de vitesse n'a plus aucune influence et les mouvements seront exécutés à la vitesse d'avance travail programmée. (à moins que ne soit actif un correcteur de vitesse adaptative).

source: [[sec:M51-Spindle-Override]] == M51 Spindle Speed Override Control (((M51 Spindle Speed Override)))
fr: == M51 Contrôle du correcteur de vitesse de broche[[sec:M51]] (((M51 Contrôle du correcteur de vitesse broche)))

source: * 'M51 <P1>' - enable the spindle speed override control. The P1 is optional. * 'M51 P0' - disable the spindle speed override control program. While disabled the spindle speed override will have no influence, and the spindle speed will have the exact program specified value of the S-word (described in <<sec:S-spindle-speed,Spindle Speed>> Section).
fr: * 'M51 <P1>' - Autorise le curseur de correction de vitesse de la broche. Le paramètre 'P1' est facultatif. * 'M51 P0' - Inhibe le curseur de correction de vitesse de broche. Quand il est inhibé, le curseur de correction de vitesse de broche n'a plus aucune influence, et la broche tournera à la vitesse programmée, en utilisant le mot 'S' comme décrit dans la section <<sec:S-Broche, sur le réglage de la vitesse de broche>>.

source: [[sec:M52-Adaptive-Feed-Control]] == M52 Adaptive Feed Control (((M52 Adaptive Feed Control)))
fr: == M52 Contrôle de vitesse adaptative[[sec:M52]] (((M52 Contrôle vitesse adaptative)))

source: 'M52 <P1>' - use an adaptive feed. The P1 is optional.
fr: 'M52 P1' - Utilise une vitesse adaptative. Le paramètre 'P1' est optionnel.

source: 'M52 P0' - stop using adaptive feed.
fr: 'M52 P0' - Cesse l'utilisation d'une vitesse adaptative.

source: When adaptive feed is enabled, some external input value is used together with the user interface feed override value and the commanded feed rate to set the actual feed rate. In LinuxCNC, the HAL pin 'motion.adaptive-feed' is used for this purpose. Values on 'motion.adaptive-feed' should range from 0 (feed hold) to 1 (full speed).
fr: Quand la vitesse adaptative est utilisée, certaines valeurs externes sont utilisées avec les correcteurs de vitesse de l'interface utilisateur et les vitesses programmées pour obtenir la vitesse travail. Dans LinuxCNC, la pin de HAL 'motion.adaptive-feed' est utilisée dans ce but. Les valeurs de 'motion.adaptive-feed' doivent être comprises entre 0 (vitesse nulle) et 1 (pleine vitesse).

source: [[sec:M53-Feed-Stop-Control]] == M53 Feed Stop Control (((M53 Feed Stop Control)))
fr: == M53 Contrôle de la coupure de vitesse[[sec:M53]] (((M53 Contrôle coupure vitesse)))

source: * 'M53 <P1>' - enable the feed stop switch. The P1 is optional. Enabling the feed stop switch will allow motion to be interrupted by means of the feed stop control. In LinuxCNC, the HAL pin 'motion.feed-hold' is used for this purpose. A 'true' value will cause the motion to stop when 'M53' is active.
fr: * 'M53 P1' - Autorise le bouton de coupure de vitesse. Le paramètre 'P1' est optionnel. Autoriser la coupure de vitesse permet d'interrompre les mouvements par le biais d'une coupure de vitesse. Dans LinuxCNC, la HAL pin 'motion.feed-hold' est utilisée pour cette fonctionnalité. Une valeur de 1 provoque un arrêt des mouvements quand 'M53' est actif.

source: * 'M53 P0' - disable the feed stop switch. The state of 'motion.feed-hold' will have no effect on feed when M53 is not active.
fr: * 'M53 P0' - Inhibe le bouton de coupure de vitesse. L'état de 'motion.feed-hold' est sans effet sur la vitesse quand 'M53' est inhibé.

source: [[sec:M61-Set-Current-Tool-Number]] == M61 Set Current Tool Number (((M61 Set Current Tool Number)))
fr: == M61 Correction du numéro de l'outil courant[[sec:M61]] (((M61 Correction du numéro de l'outil courant)))

source: * 'M61 Q-' - change the current tool number while in MDI or Manual mode. One use is when you power up LinuxCNC with a tool currently in the spindle you can set that tool number without doing a tool change.
fr: * 'M61 Q ' - Corrige le numéro de l'outil courant, en mode MDI ou après un changement manuel d'outil dans la fenêtre de données manuelles. Au démarrage de LinuxCNC avec un outil dans la broche, il est possible ainsi d'ajuster le numéro de l'outil courant sans faire de changement d'outil.

source: It is an error if:
fr: C'est une erreur si:

source: Q- is not 0 or greater
fr: Q n'est pas égal où supérieur à 0

source: [[sec:M62-M65]] == M62 to M65 Output Control (((M62 to M65 Output Control)))
fr: == M62 à M65 Bits de sortie numérique[[sec:M62-a-M65]] (((M62 Contrôle un bit de sortie numérique)))
