Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/m-code.*.po
Languages: fr

source: [WARNING] Do not use a word processor to create or edit the files. A word processor will leave unseen codes that will cause problems and may prevent a bash or python file from working. Use a text editor like Gedit in Ubuntu or Notepad++ in other operating systems to create or edit the files.
fr: [WARNING] Ne pas utiliser un traitement de texte pour créer ou éditer ces fichiers. Un traitement de texte ajoute des caractères invisibles qui causent des problèmes et empêchent les scripts bash ou Python de fonctionner. Pour ces raisons, utiliser un éditeur de texte tel que Gedit dans Ubuntu ou le Notepad++ dans un autre OS.

source: The error 'Unknown M code used' denotes one of the following
fr: Le message d'erreur 'M-code inconnu' signifie que

source: The specified User Defined Command does not exist
fr: La commande utilisateur spécifiée n'existe pas.

source: The file is not an executable file
fr: Le fichier n'a pas été rendu exécutable.

source: The file name has an extension
fr: Le nom du fichier comporte une extension.

source: The file name does not follow this format M1nn where nn = 00 through 99
fr: Le nom du fichier ne suis pas le format suivant: M1nn où nn = 00 à 99.

source: The file name used a lower case M
fr: Le nom de fichier utilise un 'm' minuscule.

source: For example to open and close a collet closer that is controlled by a parallel port pin using a bash script file using M101 and M102. Create two files named M101 and M102. Set them as executable files (typically right click/properties/permissions) before running LinuxCNC. Make sure the parallel port pin is not connected to anything in a HAL file.
fr: Exemple d'utilisation, dans un programme G-code, on doit ouvrir et fermer un mandrin automatique via une broche du port parallèle, on appellera respectivement M101 pour ouvrir le mandrin et M102 pour le fermer. Les deux scripts bash correspondants, appelés M101 et M102 seront créés avant le lancement de LinuxCNC puis rendus exécutables, par exemple par un clic droit puis 'propriétés → permissions → Exécution'. S'assurer que cette broche du port parallèle n'est pas déjà utilisée dans un fichier de HAL.

source: .M101 Example File ----
fr: .Exemple de fichier pour M101 ----

source: #!/bin/bash # file to turn on parport pin 14 to open the collet closer halcmd setp parport.0.pin-14-out True exit 0 ----
fr: #!/bin/bash # ce fichier met la broche 14 du port à 1 pour ouvrir le mandrin automatique halcmd setp parport.0.pin-14-out True exit 0----

source: .M102 Example File ----
fr: .Exemple de fichier pour M102 ----

source: #!/bin/bash # file to turn off parport pin 14 to open the collet closer halcmd setp parport.0.pin-14-out False exit 0 ----
fr: #!/bin/bash # ce fichier met la broche 14 du port à 0 pour fermer le mandrin automatique halcmd setp parport.0.pin-14-out False exit 0----

source: To pass a variable to a M1nn file you use the P and Q option like this:
fr: Pour passer des variables à un fichier M1nn, utiliser les mots facultatifs P et Q de cette façon:

source: .M100 Example file ----
fr: .Exemple pour M100 ----

source: #!/bin/bash voltage=$1 feedrate=$2 halcmd setp thc.voltage $voltage halcmd setp thc.feedrate $feedrate exit 0 ----
fr: #!/bin/bash tension=$1 vitesse=$2 halcmd setp thc.voltage $tension halcmd setp thc.feedrate $vitesse exit 0 ----

source: To display a graphic message and stop until the message window is closed use a graphic display program like Eye of Gnome to display the graphic file. When you close it the program will resume.
fr: Pour ouvrir un message graphique et passer en pause jusqu'à ce que la fenêtre du message soit fermée, utiliser un programme comme 'Eye of Gnome' pour afficher le fichier graphique. Quand la fenêtre sera fermée, le programme reprendra.

source: .M110 Example file ----
fr: .Exemple pour M110, affichage d'un graphique avec passage en pause ----

source: #!/bin/bash eog /home/john/linuxcnc/nc_files/message.png exit 0 ----
fr: #!/bin/bash eog /home/robert/linuxcnc/nc_files/message.png exit 0 ----

source: To display a graphic message and continue processing the G code file suffix an ampersand to the command.
fr: Pour afficher un message graphique en continuant le traitement du fichier G-code, ajouter un caractère esperluette à la commande.

source: .M110 Example display and keep going ----
fr: .Exemple pour M110, affichage d'un graphique sans passer en pause ----

source: #!/bin/bash eog /home/john/linuxcnc/nc_files/message.png & exit 0 ----
fr: #!/bin/bash eog /home/robert/linuxcnc/nc_files/message.png & exit 0 ----
