Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/m-code.*.po
Languages: fr

source: * 'M62 P-' - turn on digital output synchronized with motion. The P- word specifies the digital output number.
fr: * 'M62 P' - Active un bit de sortie numérique en synchronisme avec un mouvement. Le mot P- spécifie le numéro du bit de sortie.

source: * 'M63 P-' - turn off digital output synchronized with motion. The P- word specifies the digital output number.
fr: * 'M63 P' - Désactive un bit de sortie numérique en synchronisme avec un mouvement. Le mot P- spécifie le numéro du bit de sortie.

source: * 'M64 P-' - turn on digital output immediately. The P- word specifies the digital output number.
fr: * 'M64 P' - Active immédiatement un bit de sortie numérique. Le mot P- spécifie le numéro du bit de sortie.

source: * 'M65 P-' - turn off digital output immediately. The P- word specifies the digital output number.
fr: * 'M65 P' - Désactive immédiatement un bit de sortie numérique. Le mot P- spécifie le numéro du bit de sortie.

source: The P-word ranges from 0 to a default value of 3. If needed the the number of I/O can be increased by using the num_dio parameter when loading the motion controller. See the Integrator's Manual Configuration Section LinuxCNC and HAL section for more information.
fr: Le mot P spécifie le numéro du bit de sortie numérique. Le mot P doit être compris entre 0 et une valeur par défaut de 3. Si nécessaire, le nombre des entrées/sorties peut être augmenté en utilisant le paramètre num_dio lors du chargement du contrôleur de mouvement. Voir le manuel de configuration, section 'LinuxCNC et HAL', pour plus d'informations.

source: The M62 & M63 commands will be queued. Subsequent commands referring to the same output number will overwrite the older settings. More than one output change can be specified by issuing more than one M62/M63 command.
fr: Les commandes M62 et M63 seront mises en file d'attente. Toute nouvelle commande, destinée à un bit de sortie écrasera l'ancien réglage de ce bit. Plusieurs bits peuvent changer d'état simultanément par l'envoi de plusieurs commandes M62/M63.

source: The actual change of the specified outputs will happen at the beginning of the next motion command. If there is no subsequent motion command, the queued output changes won't happen. It's best to always program a motion G code (G0, G1, etc) right after the M62/63.
fr: Les nouveaux changements d'état des bits de sortie spécifiés, seront effectifs au début du prochain mouvement commandé. S'il n'y a pas de commande de mouvement ultérieur, les changements en attente n'auront pas lieu. Il est préférable de toujours programmer un G-code de mouvement (G0, G1, etc) juste après les M62/63.

source: M64 & M65 happen immediately as they are received by the motion controller. They are not synchronized with movement, and they will break blending.
fr: M64 et M65 produisent leur effet immédiatement après être reçus par le contrôleur de mouvement. Ils ne sont pas synchronisés avec un mouvement.

source: [NOTE] M62-65 will not function unless the appropriate motion.digital-out-nn pins are connected in your hal file to outputs.
fr: [NOTE] M62 à M66 ne seront opérationnels que si les pins motion.digital-out-nn appropriées sont connectées aux sorties dans le fichier HAL.

source: [[sec:M66-Input-Control]] == M66 Wait on Input (((M66 Input Control)))
fr: == M66 Contrôle d'entrée numérique et analogique[[sec:M66]] (((M66 Contrôle d'entrée numérique et analogique)))

source: M66 P- | E- <L-> ----
fr: M66 P- | E- <L-> <Q-> ----

source: 'P-' - specifies the digital input number from 0 to 3.
fr: 'P' - Spécifie le numéro d'un bit d'entrée numérique entre 0 et 3.

source: 'E-' - specifies the analog input number from 0 to 3.
fr: 'E' - Spécifie le numéro d'un bit d'entrée analogique entre 0 et 3.

source: * 'L-' - specifies the wait mode type. ** 'Mode 0: IMMEDIATE' - no waiting, returns immediately. The current value of the input is stored in parameter #5399 ** 'Mode 1: RISE' - waits for the selected input to perform a rise event. ** 'Mode 2: FALL' - waits for the selected input to perform a fall event. ** 'Mode 3: HIGH' - waits for the selected input to go to the HIGH state. ** 'Mode 4: LOW' - waits for the selected input to go to the LOW state. * 'Q-' - specifies the timeout in seconds for waiting. If the timeout is exceeded, the wait is interrupt, and the variable #5399 will be holding the value -1. The Q value is ignored if the L-word is zero (IMMEDIATE). A Q value of zero is an error if the L-word is non-zero.
fr: * 'L' - Spécifie le mode d'attente. ** Mode 0: 'IMMEDIATE' - pas d'attente, retour immédiat, la valeur courante de l'entrée est stockée dans le paramètre #5399 ** Mode 1: 'RISE' attente d'un front montant sur l'entrée. ** Mode 2: 'FALL' attente d'un front descendant sur l'entrée. ** Mode 3: 'HIGH' attente d'un état logique HAUT sur l'entrée. ** Mode 4: 'LOW' attente d'un état logique BAS sur l'entrée. * 'Q' - Spécifie le délai d'attente, en secondes. Si le délai est dépassé, l'attente est interrompue et la variable #5399 positionnée à -1. La valeur de Q est ignorée si le mot L est zéro (IMMEDIATE). Une valeur de Q à zéro est une erreur si le mot L n'est pas à zéro.

source: Mode 0 is the only one permitted for an analog input.
fr: Le mode '0' est le seul autorisé pour une entrée analogique.

source: .M66 Example Lines ----
fr: .Exemple de ligne avec M66 ----

source: M66 P0 L3 Q5 (wait up to 5 seconds for digital input 0 to turn on) ----
fr: M66 P0 L3 Q5 (attend jusqu'à 5 secondes la montée de l'entrée numérique 0) ----

source: M66 wait on an input stops further execution of the program, until the selected event (or the programmed timeout) occurs.
fr: M66 attend un nouvel événement sur une entrée ou la fin de l'exécution du programme, jusqu'à ce que l'événement sélectionné (ou le délai d'attente programmé) ne survienne.

source: It is an error to program M66 with both a P-word and an E-word (thus selecting both an analog and a digital input). In LinuxCNC these inputs are not monitored in real time and thus should not be used for timing-critical applications.
fr: C'est également une erreur de programmer M66 avec les deux mots, un mot P- et un mot E- (ce qui reviendrait à sélectionner à la fois une entrée analogique et une numérique). Dans LinuxCNC, ces entrées ne sont pas suivies en temps réel, elles ne doivent donc pas être utilisées pour des applications pour lesquelles le temps est critique.

source: The number of I/O can be increased by using the num_dio or num_aio parameter when loading the motion controller. See the Integrator's Manual, Core Components Section, Motion subsection, for more information.
fr: Le nombre des entrées/sorties peut être augmenté en utilisant les paramètres num_dio ou num_aio lors du chargement du contrôleur de mouvement. Voir le Manuel de configuration pour plus d'informations, paragraphes "LinuxCNC et HAL".

source: [NOTE] M66 will not function unless the appropriate motion.digital-in-nn pins or motion.analog-in-nn pins are connected in your hal file to an input.
fr: [NOTE] M66 ne sera opérationnel que si les pins motion.digital-in-nn ou motion.analog-in-nn appropriées sont connectées aux entrées dans le fichier HAL.

source: .Example HAL Connection ----
fr: .Exemple de connection de Hal ----

source: net signal-name motion.digital-in-00 <= parport.0.pin10-in ----
fr: net nom-signal motion.digital-in-00 <= parport.0.pin10-in ----

source: [[sec:M67-Analog-Output]] == M67 Synchronized Analog Output (((M67 Analog Motion Output Control)))
fr: == M67 Contrôle de sortie analogique synchroniée[[sec:M67]] (((M67 Contrôle de sortie analogique synchronisée avec un mouvement)))

source: 'M67' - set an analog output synchronized with motion.
fr: 'M67' - Contrôle une sortie analogique synchronisée avec un mouvement.

source: 'E-' - output number ranging from 0 to 3.
fr: 'E' - Spécifie le numéro de la sortie, doit être compris entre 0 et 3.

source: 'Q-' - is the value to set (set to 0 to turn off).
fr: 'Q' - Spécifie la valeur à appliquer (mettre à 0 pour désactiver).

source: The actual change of the specified outputs will happen at the beginning of the next motion command. If there is no subsequent motion command, the queued output changes won't happen. It's best to always program a motion G code (G0, G1, etc) right after the M67. M67 functions the same as M62-63.
fr: Les changements de valeur spécifiés, seront effectifs au début du prochain mouvement commandé. S'il n'y a pas de commande de mouvement ultérieur, les changements en attente n'auront pas lieu. Il est préférable de toujours programmer un G-code de mouvement (G0, G1, etc) juste après les M67. M67 fonctionne comme M62 à M63.

source: [NOTE] M67 will not function unless the appropriate motion.analog-out-nn pins are connected in your hal file to outputs.
fr: [NOTE] M67 ne sera opérationnel que si les pins motion.analog-out-nn appropriées sont connectées aux sorties dans le fichier HAL.

source: [[sec:M68-Analog-Output]] == M68 Analog Output (((M68 Analog Aux Output Control)))
fr: == M68 Contrôle de sortie analogique directe[[sec:M68]] (((M68 Contrôle de sortie analogique directe)))

source: 'M68' - set an analog output immediately.
fr: 'M68' - Contrôle directement une sortie analogique.

source: M68 output happen immediately as they are received by the motion controller. They are not synchronized with movement, and they will break blending. M68 functions the same as M64-65.
fr: M68 produit son effet immédiatement après être reçu par le contrôleur de mouvement. Il n'est pas synchronisé avec un mouvement. M68 fonctionne comme M64 à M65.

source: [NOTE] M68 will not function unless the appropriate motion.analog-out-nn pins are connected in your hal file to outputs.
fr: [NOTE] M68 ne sera opérationnel que si les pins motion.analog-out-nn appropriées sontconnectées aux sorties dans le fichier HAL.

source: == M70 Save Modal State[[sec:M70-Save-Modal-State]] (((M70 Save Modal State)))
fr: == M70 Enregistrement de l'état modal courant[[sec:M70]] (((M70 Save Modal State)))

source: To explicitly save the modal state at the current call level, program 'M70'. Once modal state has been saved with 'M70', it can be restored to exactly that state by executing an 'M72'.
fr: Pour enregistrer explicitement l'état modal au niveau de l'appel courant, programmer 'M70'. Une fois l'état modal enregistré avec 'M70', il peut être restauré exactement identique en exécutant un 'M72'.

source: A pair of 'M70' and 'M72' instructions will typically be used to protect a program against inadvertant modal changes within subroutines.
fr: Une paire d'instructions 'M70' et 'M72' est typiquement utilisée pour protéger un programme contre d'éventuels changements modaux pouvant se produire dans les sous-programmes.

source: [[saved_state_by_M70]] The state saved consists of:
fr: [[saved_state_by_M70]] Les états enregistrés sont les suivants:

source: current G20/G21 settings (imperial/metric)
fr: unités machine courantes G20/G21 (po/mm)

source: selected plane (G17/G18/G19 G17.1,G18.1,G19.1)
fr: plan de travail courant (G17/G18/G19 G17.1,G18.1,G19.1)

source: status of cutter compensation (G40,G41,G42,G41.1,G42,1)
fr: statut de la compensation de rayon d'outil (G40,G41,G42,G41.1,G42,1)

source: distance mode - relative/absolute (G90/G91)
fr: mode de déplacement - relatif/absolu (G90/G91)

source: feed mode (G93/G94,G95)
fr: mode de vitesse (G93/G94,G95)

source: current coordinate system (G54-G59.3)
fr: coordonnées système courantes (G54-G59.3)

source: tool length compensation status (G43,G43.1,G49)
fr: statut de la compensation de longueur d'outil (G43,G43.1,G49)

source: retract mode (G98,G99)
fr: options du plan de retrait (G98,G99)

source: spindle mode (G96-css or G97-RPM)
fr: mode de contrôle de broche (G96-css ou G97-RPM)

source: arc distance mode (G90.1, G91.1)
fr: mode de déplacement en arc (G90.1, G91.1)

source: lathe radius/diameter mode (G7,G8)
fr: mode diamètre/rayon des tours (G7,G8)

source: path control mode (G61, G61.1, G64)
fr: mode de contrôle de trajectoire (G61, G61.1, G64)

source: current feed and speed ('F' and 'S' values)
fr: avance et vitesse broche courantes (valeurs 'F' et 'S')

source: spindle status (M3,M4,M5) - on/off and direction
fr: statut de la broche (M3,M4,M5) - on/off et direction

source: mist (M7) and flood (M8) status
fr: statut du lubrifiant (M7) et (M8)

source: speed override (M51) and feed override (M50) settings
fr: réglages des correcteurs de vitesse broche (M51) et du correcteur de vitesse travail (M50)

source: adaptive feed setting (M52)
fr: réglage du contrôle de vitesse adaptative (M52)

source: feed hold setting (M53)
fr: réglage du contrôle de la coupure de vitesse (M53)

source: Note that in particular, the motion mode (G1 etc) is NOT restored.
fr: Noter qu'en particulier, les modes de mouvement (G1 etc) ne sont PAS restaurés.

source: 'current call level' means either:
fr: 'Le niveau de l'appel courant' signifie:

source: * executing in the main program. There is a single storage location for state at the main program level; if several 'M70' instructions are executed in turn, only the most recently saved state is restored when an 'M72' is executed.
fr: * Exécution dans le programme principal. Il n'y a qu'un seul emplacement de stockage pour l'état modal au niveau du programme principal; si plusieurs instructions 'M70' sont exécutées tour à tour, seul l'état enregistré le plus récent est restauré quand un 'M72' est exécuté.

source: * executing within a G-code subroutine. The state saved with 'M70' within a subroutine behaves exactly like a local named parameter - it can be referred to only within this subroutine invocation with an 'M72' and when the subroutine exits, the paramter goes away.
fr: * Exécution dans un sous-programme G-code. L'état enregistré par 'M70' dans un sous-programme se comporte exactement comme un paramètre nommé local - on ne peut s'y référer qu'à l'intérieur du sous-programme en invoquant un 'M72', à la sortie du sous-programme, le paramètre disparaît.

source: A recursive invocation of a subroutine introduces a new call level.
fr: Une invocation récursive d'un sous-programme introduit un nouveau niveau d'appel.

source: == M71 Invalidate Stored Modal State[[sec:M71-Invalidate-Stored-Modal-State]] (((M71 Invalidate Stored Modal State)))
fr: == M71 Invalide l'état modal enregistré[[sec:M71]] (((M71 Invalidate Stored Modal State)))

source: <<saved_state_by_M70,Modal state saved with an 'M70'>> or by an <<sec:M73-Save-Autorestore-Modal-State, 'M73'>> at the current call level is invalidated (cannot be restored from anymore).
fr: <<saved_state_by_M70,L'état modal enregistré par 'M70'>> ou par <<sec:M73, 'M73'>> au niveau de l'appel courant est invalidé (ne peut plus être restauré nulle part).

source: A subsequent 'M72' at the same call level will fail.
fr: Un appel ultérieur à 'M72' sur le même niveau d'appel, échouera.

source: If executed in a subroutine which protects modal state by an 'M73', a subsequent return or endsub will *not* restore modal state.
fr: Si il est exécuté dans un sous-programme qui protège l'état modal par un 'M73', un 'return' ou 'endsub' ultérieur ne restaurera 'PAS' l'état modal.

source: The usefulness of this feature is dubious. It should not be relied upon as it might go away.
fr: L'utilité de ce dispositif est douteuse. Il ne devrait pas être invoqué quand il peut disparaître.

source: == M72 Restore Modal State[[sec:M72-Restore-Modal-State]] (((M72 Restore Modal State)))
fr: == M72 Restauration de l'état modal enregistré[[sec:M72]] (((M72 Restore Modal State)))

source: <<saved_state_by_M70,Modal state saved with an 'M70'>> code can be restored by executing an 'M72'.
fr: <<saved_state_by_M70,L'état modal enregistré par un 'M70'>> peut être restauré en exécutant un 'M72'.

source: The handling of G20/G21 is specially treated as feeds are interpreted differently depending on G20/G21: if length units (mm/in) are about to be changed by the restore operation, 'M72 'will restore the distance mode first, and then all other state including feed to make sure the feed value is interpreted in the correct unit setting.
fr: La gestion de G20/G21 reçoit un traitement particulier car les avances sont interprétées différemment selon G20/G21: si les unités de longueur (mm/po) doivent être modifiées par une opération de restauration, 'M72' va restaurer le mode distance en premier, puis ensuite tous les autres états, y compris les avances pour être sure que les valeurs d'avance soient interprétées selon un réglage d'unités correct.

source: It is an error to execute an 'M72' with no previous 'M70' save operation at that level.
fr: C'est une erreur d'exécuter 'M72' sans enregistrement précédent avec 'M70' à ce niveau.

source: The following example demonstrates saving and explicitely restoring modal state around a subroutine call using 'M70' and 'M72'. Note that the 'imperialsub' subroutine is not "aware" of the M7x features and can be used unmodified:
fr: L'exemple suivant montre l'enregistrement puis la restauration de l'état modal autour de l'appel d'un sous-programme utilisant 'M70' et 'M72'. Noter que le sous-programme 'imperialsub' n'est pas "au courant" des caractéristiques de M7x et peut être utilisé non modifié:

source: ; main program g21 (metric) g90 (absolute) f200 (fast speed) S2500 (high rpm)
fr: ; programme principal g21 (metric) g90 (absolute) f200 (fast speed) S2500 (high rpm)

source: == M73 Save and Autorestore Modal State[[sec:M73-Save-Autorestore-Modal-State]] (((M73 Save and Autorestore Modal State)))
fr: == M73 Enregistrement/auto-restauration de l'état modal[[sec:M73]] (((M73 Save and Autorestore Modal State)))

source: To save modal state within a subroutine, and restore state on subroutine 'endsub' or any 'return' path, program 'M73'.
fr: Pour enregistrer l'état modal à l'intérieur d'un sous-programme et restaurer cet état lors d'un 'endsub' ou autre 'return', programmer 'M73'.

source: Aborting a running program in a subroutine which has an 'M73' operation will *not* restore state .
fr: En cas d'abandon d'un programme en cours d'exécution dans un sous-programme traitant un 'M73', l'état ne sera PAS restauré.

source: Also, the normal end ('M2') of a main program which contains an 'M73' will *not* restore state.
fr: En outre, la fin normale ('M2') d'un programme principal contenant un 'M73' ne restaurera pas l'état.

source: The suggested use is at the beginning of a O-word subroutine as in the following example. Using 'M73' this way enables designing subroutines which need to modify modal state but will protect the calling program against inadvertant modal changes. Note the use of <<sec:Predefined-Named-Parameters, predefined named parameters>> in the 'showstate' subroutine.
fr: L'utilisation suggérée consiste à placer au début d'un sous-programme, un O-code de sous-programme comme dans l'exemple ci-dessous. En utilisant 'M73', cette manière valide le design des sous-programmes qui doivent modifier l'état modal mais qui protège le programme appelant contre tout changement inopiné de l'état modal. Noter l'usage de <<sec:Parametres-Nommes, paramètres nommés>> dans le sous-programme 'showstate'.

source: ; note - no M72 is needed here - the following endsub or an ; explicit 'return' will restore caller state O<imperialsub> endsub
fr: ; note - M72 n'est pas utilisé ici - le endsub suivant ou un ; 'return' explicite restaurera l'état de l'appelant O<imperialsub> endsub

source: ; main program g21 (metric) g90 (absolute) f200 (fast speed) S2500 (high rpm) (debug, in main, state now:) o<showstate> call o<imperialsub> call (debug, back in main, state now:) o<showstate> call m2 ---------------------------------------------------------------------
fr: ; programme principal g21 (metric) g90 (absolute) f200 (fast speed) S2500 (high rpm) (debug, in main, state now:) o<showstate> call o<imperialsub> call (debug, back in main, state now:) o<showstate> call m2 ----

source: === Selectively restoring modal state by testing predefined parameters [[sec:Selectively-restoring-modal-state]]
fr: == Restauration sélective de l'état modal

source: Executing an 'M72' or returning from a subroutine which contains an 'M73' will restore <<saved_state_by_M70,*all* modal state saved>>.
fr: Exécuter un 'M72' ou au retour d'un sous-programme contenant un 'M73_ pour restaurer <<saved_state_by_M70,*tout* l'état modal enregistré>>.

source: If only some aspects of modal state should be preserved, an alternative is the usage of <<sec:Predefined-Named-Parameters, predefined named parameters>>, local parameters and conditional statements. The idea is to remember the modes to be restored at the beginning of the subroutine, and restore these before exiting. Here is an example, based on snippet of 'nc_files/tool-length-probe.ngc':
fr: Si seulement certains aspects de l'état modal doivent être préservés, une alternative consiste a utiliser les <<sec:Predefined-Named-Parameters,paramètres nommés prédéfinis>>, paramètres locaux et états conditionnels. L'idée est de rappeler les modes à restaurer au début du sous-programme et de restaurer ceux-ci avant de quitter. Voici un exemple, basé sur le programme 'nc_files/tool-length-probe.ngc':

source: [[sec:M100-to-M199]] == M100 to M199 User Defined Commands (((M100 to M199 User Defined Commands)))(((User Defined Commands M100-M199)))
fr: == M100 à M199 Commandes définies par l'utilisateur[[sec:M100-a-M199]] (((M100 à M199 M-codes définis par l'utilisateur)))

source: 'M1--' - an integer in the range of 100 - 199.
fr: 'M1 --' - Un entier compris entre 100 et 199.

source: 'P-' - a number passed to the file as the first parameter.
fr: 'P' - Un nombre passé comme premier argument au programme externe.

source: 'Q-' - a number passed to the file as the second parameter.
fr: 'Q' - Un nombre passé comme second argument au programme externe.

source: [NOTE] After creating a new 'M1nn' file you must restart the GUI so it is aware of the new file, otherwise you will get an 'Unkown m code' error.
fr: [NOTE] Après la création d'un nouveau programme M1nn, l'interface graphique doit être redémarrée pour que le nouveau programme soit pris en compte, autrement une erreur 'M-code inconnu' surviendra.

source: The external program named 'M100' through 'M199' (no extension and a capitol M) is executed with the optional P and Q values as its two arguments. Execution of the G code file pauses until the external program exits. Any valid executable file can be used. The file must be located in the search path specificed in the ini file configuration. See the ini config section of the Integrators Manual for more information on search paths.
fr: Le programme externe, nommé 'M100' à 'M199', (avec un 'M' majuscule et aucune extension) qui doit se trouver dans le répertoire pointé par la variable '[DISPLAY] PROGRAM_PREFIX' du fichier ini, sera exécuté avec les valeurs 'P-' et 'Q-' comme étant ses deux arguments. L'exécution du fichier G-code courant passera en pause jusqu'à ce que le programme invoqué soit terminé. Tout fichier exécutable valide peut être utilisé. Le fichier doit se trouver dans le chemin spécifié dans le fichier ini de configuration. Voir la section sur le fichier de configuration dans le manuel.
