Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/machining_center.*.po
Languages: fr

source: A tool table is required to use the Interpreter. The file tells which tools are in which tool changer slots and what the size and type of each tool is. The name of the tool table is defined in the ini file:
fr: Un fichier d'outils est requis par l'interpréteur. Le fichier indique dans quels emplacements du carrousel sont placés les outils, la longueur et le diamètre de chacun des outils. Le nom de la table d'outils est défini sous cette forme dans le fichier ini:

source: The default filename probably looks something like the above, but you may prefer to give your machine its own tool table, using the same name as your ini file, but with a tbl extension:
fr: Il est également possible de donner à la table d'outils le même nom que le fichier ini, mais avec une extension tbl, par exemple:

source: or
fr: ou

source: For more information on the specifics of the tool table format, see the <<sec:tool-table,Tool Table Format>> Section.
fr: D'autres informations sont disponibles sur les spécificités du <<sec:Tool-Table-Format, format de la table d'outils>>.

source: [[sec:Parameters]] == Parameters
fr: == Paramètres[[sec:Parametres]]

source: (((parameters)))
fr: (((paramètres)))

source: In the RS274/NGC language view, a machining center maintains an array of numerical parameters defined by a system definition (RS274NGC_MAX_PARAMETERS). Many of them have specific uses especially in defining coordinate systems. The number of numerical parameters can increase as development adds support for new parameters. The parameter array persists over time, even if the machining center is powered down. LinuxCNC uses a parameter file to ensure persistence and gives the Interpreter the responsibility for maintaining the file. The Interpreter reads the file when it starts up, and writes the file when it exits.
fr: Dans le langage RS274/NGC, la machine maintient un tableau de paramètres numériques définis par le paramètre (RS274NGC_MAX_PARAMETERS). La plupart d'entre eux ont un usage spécifique. LinuxCNC utilise un fichier de paramètres et assure sa persistance, il donne à l'interpréteur la responsabilité d'actualiser le fichier. L'interpréteur lit le fichier quand il démarre et l'écrit juste avant de s'arrêter.

source: All parameters are available for use in G code programs.
fr: Tous les paramètres sont disponibles pour une utilisation dans les programmes de G-code.

source: The format of a parameter file is shown in the following table. The file consists of any number of header lines, followed by one blank line, followed by any number of lines of data. The Interpreter skips over the header lines. It is important that there be exactly one blank line (with no spaces or tabs, even) before the data. The header line shown in the following table describes the data columns, so it is suggested (but not required) that that line always be included in the header.
fr: Un fichier de paramètres est composé d'un certain nombre de lignes d'en-tête, suivies par une ligne vide, suivie d'un nombre quelconque de lignes de données. Les lignes d'en-tête sont ignorées par l'interpréteur. Il est important qu'il y ait une ligne vide (sans espace ni tabulation), avant les données. La ligne d'en-tête montrée dans le tableau ci-dessous, décrit les colonnes de données, il est donc proposé (mais pas obligatoire) que cette ligne soit toujours présente.

source: The Interpreter reads only the first two columns of the table. The third column, 'Comment', is not read by the Interpreter.
fr: L'interpréteur lit seulement les deux premières colonnes du tableau. Il ignore la troisième colonne, Commentaire.

source: Each line of the file contains the index number of a parameter in the first column and the value to which that parameter should be set in the second column. The value is represented as a double-precision floating point number inside the Interpreter, but a decimal point is not required in the file. All of the parameters shown in the following table are required parameters and must be included in any parameter file, except that any parameter representing a rotational axis value for an unused axis may be omitted. An error will be signaled if any required parameter is missing. A parameter file may include any other parameter, as long as its number is in the range 1 to 5400. The parameter numbers must be arranged in ascending order. An error will be signaled if not. Any parameter included in the file read by the Interpreter will be included in the file it writes as it exits. The original file is saved as a backup file when the new file is written. Comments are not preserved when the file is written.
fr: Chaque ligne du fichier contient le numéro d'index d'un paramètre dans la première colonne et la valeur attribuée à ce paramètre, dans la deuxième colonne. La valeur est représentée par une nombre flottant en double précision à l'intérieur de l'interpréteur, mais le point décimal n'est pas exigé dans le fichier. Le format des paramètres décrit ci-dessous, est obligatoire et doit être utilisé pour tous les fichiers de paramètres, à l'exception des paramètres représentant une valeur sur un axe rotatif inutilisé, qui peuvent être omis. Une erreur sera signalée si un paramètre requis est absent. Un fichier de paramètres peut inclure tout autre paramètre, tant que son numéro est compris dans une fourchette de 1 à 5400. Les numéros de paramètre doivent être disposés dans l'ordre croissant. Sinon, une erreur sera signalée. Le fichier original est copié comme fichier de sauvegarde lorsque le nouveau fichier est écrit. Les commentaires ne sont pas conservés lorsque le fichier est écrit.

source: .Parameter File Format[[cap:Parameter-File-Format]]
fr: .Format d'un fichier de paramètres[[sec:Format-fichier-de-parametres]]

source: [width="75%", options="header", cols="^,^,<"] |======================================== |Parameter Number | Parameter Value | Comment |5161 | 0.0 | G28 Home X |5162 | 0.0 | G28 Home Y |========================================
fr: [width="90%", options="header"] |======================================== |Numéro d'index | Valeur | Commentaire |5161 | 0.0 | G28 pom X |5162 | 0.0 | G28 pom Y |========================================

source: See the <<sec:parameters,Parameters>> section for more information.
fr: Voir la section sur les <<sec:parametres,Parameters>> pour d'autres informations.
