Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/machining_center.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = CNC Machine Overview
fr: = Aperçu global d'une machine CNC

source: [[cha:cnc-machine-overview]] (((CNC Machine Overview)))
fr: [[cha:Apercu-machine-CNC]] (((Aperçu machine CNC)))

source: This section gives a brief description of how a CNC machine is viewed from the input and output ends of the Interpreter.
fr: Cette section donne une description des différents organes constituant une machine à commande numérique (CNC).

source: == Mechanical Components
fr: == Composants mécaniques

source: A CNC machine has many mechanical components that may be controlled or may affect the way in which control is exercised. This section describes the subset of those components that interact with the Interpreter. Mechanical components that do not interact directly with the Interpreter, such as the jog buttons, are not described here, even if they affect control.
fr: Une machine à commande numérique dispose de beaucoup de composants mécaniques pouvant être contrôlés, ou qui peuvent avoir une incidence sur la façon dont le contrôle de la machine s'effectue. Cette section décrit les composants qui interagissent avec l'interpréteur. Les autres composants mécaniques, comme les boutons de jog, ne seront pas décrits ici, même si ils affectent le contrôle.

source: Any CNC machine has one or more Axes. Different types of CNC machines have different combinations. For instance, a '4-axis milling machine' may have XYZA or XYZB axes. A lathe typically has XZ axes. A foam-cutting machine may have XYUV axes. In LinuxCNC, the case of a XYYZ 'gantry' machine with two motors for one axis is better handled by kinematics rather than by a second linear axis. footnote:[If the motion of mechanical components is not independent, as with hexapod machines, the RS274/NGC language and the canonical machining functions will still be usable, as long as the lower levels of control know how to control the actual mechanisms to produce the same relative motion of tool and workpiece as would be produced by independent axes. This is called 'kinematics'.]
fr: Toute machine à commande numérique dispose d'un ou de plusieurs axes. Les différents types de machines ont différentes combinaisons d'axes. Par exemple, une 'fraiseuse 4 axes' peut avoir la combinaison d'axes XYZA ou XYZB. Un tour classique aura les axes XZ. Une machine de découpe à fil chaud aura les axes XYUV. footnote:[Si le mouvement des composants mécaniques n'est pas indépendant, comme sur une machine hexapode, le langage RS274/NGC et les fonctions standards seront quand même utilisables, tant que le contrôle de bas niveau sait comment contrôler les mécanismes actuels pour produire le mouvement relatif de l'outil et de la pièce qui auraient été produits par des axes indépendants. C'est appelé, la 'cinématique'.]

source: .Primary Linear Axes (((axes, primary linear)))
fr: .Axes linéaires primaires (((axes linéaires primaires)))

source: The X, Y, and Z axes produce linear motion in three mutually orthogonal directions.
fr: Les axes X, Y et Z produisent des mouvements linéaires dans trois directions, mutuellement orthogonales.

source: .Secondary Linear Axes (((axes, secondary linear)))
fr: .Axes linéaires secondaires (((axes linéaires secondaires)))

source: The U, V, and W axes produce linear motion in three mutually orthogonal directions. Typically, X and U are parallel, Y and V are parallel, and Z and W are parallel.
fr: Les axes U, V et W produisent des mouvements linéaires dans trois directions, mutuellement orthogonales. Habituellement, X et U sont parallèles, Y et V sont parallèles et Z et W sont parallèles.

source: .Rotational Axes (((axes, rotational)))
fr: .Axes rotatifs (((Axes rotatifs)))

source: The A, B and C axes produce angular motion (rotation). Typically, A rotates around a line parallel to X, B rotates around a line parallel to Y, and C rotates around a line parallel to Z.
fr: Les axes A, B et C produisent des mouvements angulaires (rotations). Habituellement, l'axe de rotation de A est parallèle à X, l'axe de rotation de B est parallèle à Y et l'axe de rotation de C est parallèle à Z.

source: === Spindle (((spindle)))
fr: === Broche (((broche)))

source: A CNC machine typically has a spindle which holds one cutting tool, probe, or the material in the case of a lathe. The spindle may or may not be controlled by the CNC software.
fr: Une machine à commande numérique est équipée d'une broche qui maintient un outil coupant, un palpeur ou d'autres outils. La broche peut tourner dans les deux sens. Elle peut être pilotée ou non par le programme CNC.

source: === Coolant (((coolant)))
fr: === Arrosage (((arrosage)))

source: If a CNC machine has components to provide mist coolant and/or flood coolant they can be controlled by G codes.
fr: Une machine à commande numérique peut être équipée d'un système fournissant l'arrosage fluide ou un arrosage par gouttelettes.

source: [[sub:Feed-and-Speed]] === Feed and Speed Override
fr: === Correcteurs de vitesse d'avance et de broche[[sub:Feed-and-Speed]]

source: (((feed override))) (((spindle speed override)))
fr: (((correcteurs vitesse))) (((correcteur vitesse broche)))

source: A CNC machine can have separate feed and speed override controls, which let the operator specify that the actual feed rate or spindle speed used in machining at some percentage of the programmed rate.
fr: Une machine à commande numérique est équipée de boutons de réglage de la vitesse d'avance et de la vitesse de rotation de la broche, ils laissent l'opérateur corriger les vitesses nécessaires pour la broche et l'avance travail, il peut ainsi augmenter ou réduire les vitesses programmées.

source: [[sub:Block-Delete-Switch]] === Block Delete Switch
fr: === Bouton d'effacement de bloc[[sec:Bouton-effacement-de-block]]

source: (((optional block delete)))
fr: (((Bouton effacement de bloc)))

source: A CNC machine can have a block delete switch. See the <<sub:Block-Delete-Switch-Interaction,Block Delete>> Section.
fr: Une machine à commande numérique peut être équipée d'un bouton d'effacement de bloc. Voir la section <<sec:Interaction-effacement-de-bloc,effacement de bloc>>.

source: [[sub:Optional-Program-Stop]] === Optional Program Stop Switch
fr: === Arrêt de programme optionnel[[sub:Optional-Program-Stop]]

source: (((optional program stop)))
fr: (((arrêt optionnel)))

source: A CNC machine can have an optional program stop switch. See the <<sub:Optional-Program-Stop-Interaction,Optional Program Stop>> Section.
fr: Une machine à commande numérique peut être équipée d'un bouton d'arrêt du programme. Voir la section <<sub:Optional-Program-Stop-Interaction,arrêt de programme optionnel>>.

source: == Control and Data Components
fr: == Composants de contrôle et de données

source: === Linear Axes
fr: === Axes linéaires

source: The X, Y, and Z axes form a standard right-handed coordinate system of orthogonal linear axes. Positions of the three linear motion mechanisms are expressed using coordinates on these axes.
fr: Les axes X, Y et Z forment un système de coordonnées orthogonales standard. La position d'un axe s'exprime en utilisant ses coordonnées.

source: The U, V and W axes also form a standard right-handed coordinate system. X and U are parallel, Y and V are parallel, and Z and W are parallel (when A, B, and C are rotated to zero).
fr: Les axes U, V et W forment également un système de coordonnées standard. X et U sont parallèles, Y et V sont parallèles enfin Z et W sont parallèles.

source: === Rotational Axes
fr: === Axes rotatifs

source: The rotational axes are measured in degrees as wrapped linear axes in which the direction of positive rotation is counterclockwise when viewed from the positive end of the corresponding X, Y, or Z-axis. By 'wrapped linear axis', we mean one on which the angular position increases without limit (goes towards plus infinity) as the axis turns counterclockwise and decreases without limit (goes towards minus infinity) as the axis turns clockwise. Wrapped linear axes are used regardless of whether or not there is a mechanical limit on rotation.
fr: Les axes rotatifs se mesurent en degrés, leur mouvement enveloppant un axe linéaire. Leur sens de rotation positif est le sens anti-horaire quand l'observateur est placé face à l'axe et du côté positif de cet axe X, Y ou Z. Par 'enveloppant un axe linéaire', nous entendons un axe rotatif, sur lequel la position angulaire augmente vers l'infini positif quand il tourne dans le sens anti-horaire et vers l'infini négatif quand il tourne dans le sens horaire. Les axes enveloppants sont utilisés indépendamment d'avoir ou non des limites mécaniques à leur rotation.

source: Clockwise or counterclockwise is from the point of view of the workpiece. If the workpiece is fastened to a turntable which turns on a rotational axis, a counterclockwise turn from the point of view of the workpiece is accomplished by turning the turntable in a direction that (for most common machine configurations) looks clockwise from the point of view of someone standing next to the machine. footnote:[If the parallelism requirement is violated, the system builder will have to say how to distinguish clockwise from counterclockwise.]
fr: Une partie du texte en Anglais, totalement contradictoire, a été supprimée ici.

source: [[sub:Controlled-Point]] === Controlled Point
fr: === Point contrôlé[[sec:Point-controle]]

source: (((controlled point)))
fr: (((point contrôlé)))

source: The controlled point is the point whose position and rate of motion are controlled. When the tool length offset is zero (the default value), this is a point on the spindle axis (often called the gauge point) that is some fixed distance beyond the end of the spindle, usually near the end of a tool holder that fits into the spindle. The location of the controlled point can be moved out along the spindle axis by specifying some positive amount for the tool length offset. This amount is normally the length of the cutting tool in use, so that the controlled point is at the end of the cutting tool. On a lathe, tool length offsets can be specified for X and Z axes, and the controlled point is either at the tool tip or slightly outside it (where the perpendicular, axis-aligned lines touched by the 'front' and 'side' of the tool intersect).
fr: Le point contrôlé est le point dont la position et la vitesse de déplacement sont contrôlés. Quand la compensation de longueur d'outil est à zéro (valeur par défaut), c'est un point situé sur l'axe de la broche et proche de la fin de celle-ci. Cette position peut être déplacée le long de l'axe de la broche en spécifiant une compensation de longueur d'outil. Cette compensation correspond généralement à la longueur de l'outil coupant courant. Ainsi, le point contrôlé est à la pointe de l'outil. Sur un tour, les correcteurs d'outil peuvent être spécifiés pour les axes X et Z, le point contrôlé est à la pointe de l'outil ou (correction du rayon de bec) légèrement en retrait du point d'intersection des droites perpendiculaires formées par l'axe des points de tangence à la pièce, de face et sur le côté de l'outil.

source: [[sub:Coordinate-Linear-Motion]] === Coordinated Linear Motion
fr: === Mouvement linéaire coordonné[[sec:Mouvement-lineaire-coordonne]]

source: To drive a tool along a specified path, a machining center must often coordinate the motion of several axes. We use the term 'coordinated linear motion' to describe the situation in which, nominally, each axis moves at constant speed and all axes move from their starting positions to their end positions at the same time. If only the X, Y, and Z axes (or any one or two of them) move, this produces motion in a straight line, hence the word 'linear' in the term. In actual motions, it is often not possible to maintain constant speed because acceleration or deceleration is required at the beginning and/or end of the motion. It is feasible, however, to control the axes so that, at all times, each axis has completed the same fraction of its required motion as the other axes. This moves the tool along same path, and we also call this kind of motion coordinated linear motion.
fr: Pour mener un outil sur une trajectoire spécifiée, une machine à commande numérique doit coordonner les mouvements de plusieurs axes. Nous utilisons le terme 'mouvement linéaire coordonné' pour décrire une situation dans laquelle, nominalement, chacun des axes se déplace à vitesse constante et tous les axes se déplacent de leur point de départ à leur point d'arrivée en même temps. Si deux des axes X, Y, Z (ou les trois) se déplacent, ceci produit un mouvement en ligne droite, d'où le mot 'linéaire' dans le terme. Dans les véritables mouvements, ce n'est souvent pas possible de maintenir la vitesse constante à cause des accélérations et décélérations nécessaires en début et fin de mouvement. C'est faisable, cependant, de contrôler les axes ainsi, chaque axe doit en permanence faire la même fraction du mouvement requis que les autres axes. Ceci déplace l'outil le long du même parcours et nous appelons aussi ce genre de mouvement, mouvement linéaire coordonné.

source: Coordinated linear motion can be performed either at the prevailing feed rate, or at traverse rate, or it may be synchronized to the spindle rotation. If physical limits on axis speed make the desired rate unobtainable, all axes are slowed to maintain the desired path.
fr: Un mouvement linéaire coordonné peut être exécuté soit en vitesse travail, soit en vitesse rapide, ou il peut être synchronisé à la rotation de la broche. Si les limites physiques de l'axe rendent le déplacement impossible, tous les axes seront ralentis pour maintenir le parcours prévu.

source: === [[sub:feed-rate]]Feed Rate
fr: === [[sub:Vitesse-d-avance]]Vitesse d'avance

source: (((feed rate)))
fr: (((vitesse d'avance)))

source: The rate at which the controlled point or the axes move is nominally a steady rate which may be set by the user. In the Interpreter, the interpretation of the feed rate is as follows unless 'inverse time feed' or 'feed per revolution' modes are being used see Section <<sec:G93-G94-G95-Mode,G93 G94 G95>>.
fr: La vitesse à laquelle le point contrôlé se déplace est ajustable par l'opérateur. Sauf en mode 'vitesse inverse du temps' ou vitesse par tour, voir la section <<sec:G93-G94-G95-Modes,G93 G94 G95>>, dans l'interpréteur, l'interprétation des vitesses d'avance est la suivante:

source: . If any of XYZ are moving, F is in units per minute in the XYZ cartesian system, and all other axes (ABCUVW) move so as to start and stop in coordinated fashion. . Otherwise, if any of UVW are moving, F is in units per minute in the UVW cartesian system, and all other axes (ABC) move so as to start and stop in coordinated fashion. . Otherwise, the move is pure rotary motion and the F word is in rotary units in the ABC 'pseudo-cartesian' system.
fr: . Si le déplacement concerne un des axes XYZ, F est en unités machine par minute dans le système Cartésien XYZ et les mouvements des autres axes (ABCUVW) sont également dans un même mode de coordonnées. . Autrement, si le déplacement concerne un des axes UVW, F est en unités machine par minute dans le système Cartésien UVW, tous les autres axes (ABC) se déplacent dans un même mode de coordonnées. . Autrement, le mouvement est purement rotatif et le mot F est en unités de rotation dans le système pseudo-Cartésien ABC.

source: Flood coolant and mist coolant may each be turned on independently. The RS274/NGC language turns them off together see Section <<sec:M7-M8-M9,M7 M8 M9>>.
fr: Arrosage fluide ou par gouttelettes peuvent être activés séparément. Le langage RS274/NGC les arrête ensemble, voir la section <<sec:M7-M8-M9, M7 M8 M9>>.

source: === Dwell (((dwell)))
fr: === Temporisation (((tempo)))

source: A machining center may be commanded to dwell (i.e., keep all axes unmoving) for a specific amount of time. The most common use of dwell is to break and clear chips, so the spindle is usually turning during a dwell. Regardless of the Path Control Mode (see Section <<sec:Path-Control-Mode,Path Control>>) the machine will stop exactly at the end of the previous programmed move, as though it was in exact path mode.
fr: Une temporisation peut être commandée (ex: pour immobiliser tous les axes) pendant une durée spécifique. La broche n'est pas arrêtée pendant une temporisation! Sans s'occuper <<sec:Modes-de-controle-trajectoires, du mode de contrôle de trajectoire>> la machine s'arrêtera exactement à la fin du dernier mouvement avant la temporisation, comme si elle était en mode trajectoire exact.

source: === Units (((units)))
fr: === Unités (((unités)))

source: Units used for distances along the X, Y, and Z axes may be measured in millimeters or inches. Units for all other quantities involved in machine control cannot be changed. Different quantities use different specific units. Spindle speed is measured in revolutions per minute. The positions of rotational axes are measured in degrees. Feed rates are expressed in current length units per minute, or degrees per minute, or length units per spindle revolution, as described in Section <<sec:G93-G94-G95-Mode,G93 G94 G95>>.
fr: Les unités utilisées pour les distances le long des axes X, Y et Z peuvent être les pouces ou les millimètres. La vitesse de rotation de la broche est en tours par minute. Les positions des axes rotatifs sont exprimées en degrés. Les vitesses d'avance sont exprimées en unités machine par minute ou en degrés par minute ou en unités de longueur par tour de broche, comme décrit dans la section <<sub:Vitesse-d-avance, des vitesses>>.

source: === Current Position
fr: === Position courante

source: The controlled point is always at some location called the 'current position', and the controller always knows where that is. The numbers representing the current position must be adjusted in the absence of any axis motion if any of several events take place:
fr: Le point contrôlé est toujours à un emplacement appelé la 'position courante', et le contrôleur sait toujours où est cette position. Les valeurs représentant la position courante doivent être ajustées en l'absence de tout mouvement des axes si un de ces événements a lieu:

source: . Length units are changed. . Tool length offset is changed. . Coordinate system offsets are changed.
fr: . Les unités de longueur ont changé. . La compensation de longueur d'outil a changé. . Le décalage d'origine a changé.

source: [[sub:Selected-Plane]] === Selected Plane
fr: === Choix du plan de travail[[sec:Choix-du-plan-de-travail]]

source: There is always a 'selected plane', which must be the XY-plane, the YZ-plane, or the XZ-plane of the machining center. The Z-axis is, of course, perpendicular to the XY-plane, the X-axis to the YZ-plane, and the Y-axis to the XZ-plane.
fr: Il y a toujours un 'plan sélectionné', qui doit être le plan XY, le plan YZ, ou le plan XZ de la machine. L'axe Z est, bien sûr, perpendiculaire au plan XY, l'axe X perpendiculaire au plan YZ et l'axe Y perpendiculaire au plan XZ.

source: === Tool Carousel
fr: === Carrousel d'outils

source: Zero or one tool is assigned to each slot in the tool carousel.
fr: Aucun ou un outil est assigné à chaque emplacement dans le carrousel.

source: === Tool Change
fr: === Changeur d'outil

source: A machining center may be commanded to change tools.
fr: Une machine à commande numérique peut commander un changeur d'outils.

source: === Pallet Shuttle
fr: === Chargeur de pièce

source: The two pallets may be exchanged by command.
fr: Les deux porte-pièces peuvent être intervertis par commande.

source: [[sec:Path-Control-Mode]] === Path Control Mode
fr: === Modes de contrôle de trajectoire[[sec:Modes-de-controle-trajectoires]]

source: The machining center may be put into any one of three path control modes: (1) exact stop mode, (2) exact path mode, or (3) continuous mode with optional tolerance. In exact stop mode, the machine stops briefly at the end of each programmed move. In exact path mode, the machine follows the programmed path as exactly as possible, slowing or stopping if necessary at sharp corners of the path. In continuous mode, sharp corners of the path may be rounded slightly so that the feed rate may be kept up (but by no more than the tolerance, if specified). See Sections <<sec:G61-G61_1,G61/G61.1>> and <<sec:G64,G64>>.
fr: La machine peut être placée dans un de ces trois modes de contrôle de trajectoire: * mode arrêt exact - En mode arrêt exact, le mobile s'arrête brièvement à la fin de chaque mouvement programmé. * mode trajectoire exacte - En mode trajectoire exacte, le mobile suit la trajectoire programmée aussi précisément que possible, ralentissant ou s'arrêtant si nécessaire aux angles vifs du parcours. * mode trajectoire continue avec tolérance optionnelle - En mode trajectoire continue, les angles vifs du parcours peuvent être légèrement arrondis pour que la vitesse soit maintenue (sans dépasser la tolérance, si elle est spécifiée). Voir également les G-codes <<sec:G61-G61_1,G61/G61.1>> et <<sec:G64,G64>> des contrôles de trajectoire.

source: == Interpreter Interaction with Switches
fr: == Interaction de l'interpréteur avec les boutons

source: The Interpreter interacts with several switches. This section describes the interactions in more detail. In no case does the Interpreter know what the setting of any of these switches is.
fr: L'interpréteur interagit avec plusieurs boutons de commande. Cette section décrit ces interactions plus en détail. En aucun cas l'interpréteur ne connaît ce que sont les réglages de ces boutons.

source: === Feed and Speed Override Switches[[feed-interaction]]
fr: === Boutons des correcteurs de vitesses[[feed-interaction]]

source: The Interpreter will interpret RS274/NGC commands which enable 'M48' or disable 'M49' the feed and speed override switches. For certain moves, such as the traverse out of the end of a thread during a threading cycle, the switches are disabled automatically.
fr: L'interpréteur de commande RS274/NGC autorise (M48) ou interdit (M49) l'action des boutons d'ajustement des vitesses. Pour certains mouvements, tels que la sortie de filet à la fin d'un cycle de filetage, les boutons sont neutralisés automatiquement.

source: LinuxCNC reacts to the speed and feed override settings when these switches are enabled.
fr: LinuxCNC réagit aux réglages de ces boutons seulement quand ils sont autorisés.

source: See the <<sec:M48-M49-Override,M48 M49 Override>> section for more information.
fr: Voir l'inhibition et l'activation <<sec:M48-M49, des correcteurs de vitesse>>.

source: [[sub:Block-Delete-Switch-Interaction]] === Block Delete Switch
fr: === Bouton d'effacement de bloc[[sec:Interaction-effacement-de-bloc]]

source: If the block delete switch is on, lines of G code which start with a slash (the block delete character) are not interpreted. If the switch is off, such lines are interpreted. Normally the block delete switch should be set before starting the NGC program.
fr: Si le bouton 'Effacement de bloc' est actif, les lignes de G-code commençant par le caractère barre de fraction (caractère d'effacement de bloc) ne sont pas interprétées. Si le bouton est désactivé, ces mêmes lignes sont interprétées. Normalement le bouton d'effacement de bloc doit être positionné avant de lancer le programme G-code.

source: [[sub:Optional-Program-Stop-Interaction]] === Optional Program Stop Switch
fr: === Arrêt programme optionnel[[sub:Optional-Program-Stop-Interaction]]

source: If this switch is on and an M1 code is encountered, program execution is paused.
fr: Si ce bouton est actif et qu'un code M1 est rencontré, le programme est mis en pause.

source: [[sub:Tool-Table]] == Tool Table
fr: == Table d'outils[[sec:Fichier-Outils]]
