Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/o-code.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = O Codes
fr: = Les O-codes

source: O-codes provide for flow control in NC programs. Each block has an associated number, which is the number used after O. Care must be taken to properly match the O-numbers. O codes use the letter 'O' not the number zero as the first character in the number like O100.
fr: Les O-codes permettent le contrôle des flux dans les programmes NGC. Ils commencent par une lettre 'O', qu'il ne faut pas confondre avec le chiffre '0'. Chaque bloc est associé à un numéro, qui est la valeur utilisée juste après la lettre 'O'.

source: .Numbering Example ----
fr: .Exemple de la numérotation ----

source: o100 sub (notice that the if-endif block uses a different number) o110 if [#2 GT 5] (some code here) o110 endif (some more code here) o100 endsub ----
fr: o100 sub (noter que les blocs if - endif utilisent des numéros différents) o110 if [#2 GT 5] (du code ici) o110 endif (encore du code ici) o100 endsub ----

source: The behavior is undefined if:
fr: Le comportement est indéfini si:

source: The same number is used for more than one block
fr: Le même nombre est utilisé pour plusieurs blocs

source: Other words are used on a line with an O- word
fr: D'autres mots sont utilisés sur une ligne contenant un mot O-.

source: Comments are used on a line with an O-word
fr: Un commentaire est utilisé sur une ligne contenant un mot O-.

source: [NOTE] Using the lower case o makes it easier to distinguish from a 0 that might have been mistyped. For example o100 is easier to see than O100 that it is not a 0.
fr: [TIP] L'utilisation de la lettre 'o' minuscule facilite la distinction avec le chiffre '0' qui peut être tapé par erreur. Par exemple: o100 est plus facile à distinguer de 0100 que O100.

source: The following statements cause an error message and abort the interpreter:
fr: Les états suivants provoquent un message d'erreur et abandonnent l'interpréteur:

source: a `return` or `endsub` not within a sub defintion
fr: un `return` ou `endsub` ne contenant pas de définition sub

source: a label on `repeat` which is defined elsewhere
fr: un label pour `repeat` qui déjà défini quelque part

source: a label on `while` which is defińed elsewhere and not referring to a `do`
fr: un label pour `while` qui est déjà défini quelque part et ne faisant pas référence a un `do`

source: a label on `if` defined elsewhere
fr: un label pour `if` défini quelque part

source: a undefined label on `else` or `elseif`
fr: un label indéfini pour `else` ou `elseif`

source: a label on `else`, `elseif` or `endif` not pointing to a matching `if`
fr: un label pour `else`, `elseif` ou `endif` ne correspondant pas à un `if`

source: a label on `break` or `continue` which does not point to a matching `while` or `do`
fr: un label pour `break` ou `continue` ne correspondant pas à un `while` ou un `do`

source: a label on `endrepeat` or `endwhile` no referring to a corresponding `while` or `repeat`
fr: un label pour `endrepeat` ou `endwhile` ne correspondant pas à un `while` ou un `repeat`

source: To make these errors non-fatal warnings on stderr, set bit 0x20 in the `[RS274NGC]FEATURE=` mask ini option.
fr: Pour envoyer ces erreurs non-fatal sur stderr, positionner le bit 0x20 dans l'option de masque ini dans `[RS274NGC]FEATURE=`.

source: [[sec:subroutines]] == Subroutines (((Subroutines))) (((sub)))(((endsub)))(((return)))(((call)))
fr: == Sous-programmes[[sec:Sous-programmes]]

source: Subroutines extend from a 'O- sub' to an 'O- endsub' . The lines between 'O- sub' and 'O- endsub' are not executed until the subroutine is called with 'O- call'.
fr: Les sous-programmes s'étendent d'un 'O- sub' à un 'O- endsub'. Les lignes, à l'intérieur du sous-programme (le corps du sous-programme), ne sont pas exécutées dans l'ordre, mais elles sont exécutées à chaque fois que le sous-programme est appelé avec un 'O- call'.

source: .Subroutine Example ----
fr: .Exemple de sous-programme ----

source: o100 sub G53 G0 X0 Y0 Z0 (rapid move to machine home) o100 endsub ... o100 call (call the subroutine here) M2 ----
fr: o100 sub (sous-programme de mouvement rapide à l'origine) G53 X0 Y0 Z0 o100 endsub (autres lignes) o100 call (ici, appel du sous-programme) M2 ----

source: See <<sec:G53-Move-in,G53>> & <<sec:G0,G0>> & <<sec:M2-M30,M2>> sections for more information.
fr: Voir <<sec:G53,mouvement G53>>, <<sec:G0,mouvement rapide G0>>, <<sec:M2-M30,fin de programme M2>>.

source: .O- Return Inside a subroutine, 'O- return' can be executed. This immediately returns to the calling code, just as though 'O- endsub' was encountered.
fr: .O- return À l'intérieur d'un sous-programme, 'O- return' peut être exécuté, pour retourner immédiatement au code appelant, comme si 'O- endsub' avait été rencontré.

source: .O- Return Example ----
fr: .Exemple avec 'O- return' ----

source: o100 sub o110 if [#2 GT 5] (test if parameter #2 is greater than 5) o100 return (return to top of subroutine if test is true) o110 endif (some code here that only gets executed if parameter #2 is less than 5) o100 endsub ----
fr: o100 sub o110 if [#2 GT 5] (teste si le paramètre #2 est supérieur à 5) o100 return (si le test est vrai, retourne au début du sous-programme) o110 endif (autre code ici, qui sera exécuté si le paramètre #2 est inférieur à 5) o100 endsub ----

source: See the <<sec:Binary-Operators,Binary Operators>> & <<sec:parameters,Parameters>> sections for more information.
fr: Voir <<sec:Operateurs-Binaires,les opérateurs binaires>>, <<sec:parametres,les paramètres>>.

source: .O- Call 'O- Call' takes up to 30 optional arguments, which are passed to the subroutine as '#1', '#2' , ..., #N. Parameters from #N+1 to #30 have the same value as in the calling context. On return from the subroutine, the values of parameters #1 through #30 (regardless of the number of arguments) will be restored to the values they had before the call. Parameters #1 - #30 are local to the subroutine.
fr: .O- call 'O- call' peut prendre jusqu'à 30 arguments optionnels, qui sont passés au sous-programme comme '#1', '#2' , ..., '#N'. Les paramètres de #N+1 à #30 ont la même valeur dans le contexte de l'appel. Au retour du sous-programme, les valeurs des paramètres #1 jusqu'à #30 (quel que soit le nombre d'arguments) sont restaurés aux valeurs qu'ils avaient avant l'appel.

source: Because '1 2 3' is parsed as the number 123, the parameters must be enclosed in square brackets. The following calls a subroutine with 3 arguments:
fr: Parce que '1 2 3' est analysé comme le nombre 123, les paramètres doivent être placés entre crochets. L'appel de sous-programme suivant, s'effectue avec 3 arguments:

source: .O- Call Example ----
fr: .Exemple d'appel 'O- call' ----

source: Subroutine bodies may not be nested. They may only be called after they are defined. They may be called from other functions, and may call themselves recursively if it makes sense to do so. The maximum subroutine nesting level is 10.
fr: Les corps de sous-programme ne peuvent pas être imbriqués. Ils ne peuvent être appelés qu'après avoir été définis. Ils peuvent être appelés depuis d'autres fonctions et peuvent s'appeler eux même récursivement, s'il est judicieux de le faire. Le niveau maximum d'imbrication des sous-programmes est de 10.

source: Subroutines do not have 'return values', but they may change the value of parameters above #30 and those changes will be visible to the calling code. Subroutines may also change the value of global named parameters.
fr: Les sous-programmes n'ont pas de 'valeur de retour', mais ils peuvent changer la valeur des paramètres au dessus de #30 et ces changements sont visibles depuis le code appelant. Les sous-programmes peuvent aussi changer la valeur des paramètres nommés globaux.

source: [[sec:looping]] == Looping (((Looping)))(((do)))(((while)))(((endwhile)))(((break)))(((continue)))
fr: == Boucles[[sec:Boucles]]

source: The 'while loop' has two structures: 'while/endwhile', and 'do/while'. In each case, the loop is exited when the 'while' condition evaluates to false. The difference is when the test condition is done. The 'do/while' loop runs the code in the loop then checks the test condition. The 'while/endwhile' loop does the test first.
fr: La 'boucle while' a deux structures possibles: 'while - endwhile' et 'do - while'. Dans chaque cas, la boucle est quittée quand la condition du 'while' devient fausse. La différence se trouve en fin de test de la condition. La boucle 'do - while' exécute le code dans la boucle puis test la condition. La boucle 'while - endwhile' effectue le test d'abord.

source: .While Endwhile Example ----
fr: .Exemple avec 'while - endwhile' ----

source: (draw a sawtooth shape) G0 X1 Y0 (move to start position) #1 = 1 (assign parameter #1 the value of 0) F25 (set a feed rate) o101 while [#1 LT 10] G1 X0 G1 Y[#1/10] X1 #1 = [#1+1] (increment the test counter) o101 endwhile M2 (end program) ----
fr: (dessine la forme d'une dent de scie) G0 X1 Y0 (déplacement en position de départ) #1 = 1 (assigne la valeur 1 au paramètre #1) F25 (fixe la vitesse d'avance travail) o101 while [#1 LT 10] G1 X0 G1 Y[#1/10] X1 #1 = [#1+1] (incrémente le compteur de test) o101 endwhile M2 (fin de programme) ----

source: .Do While Example ----
fr: .Exemple avec 'do - while' ----

source: #1 = 0 (assign parameter #1 the value of 0) o100 do (debug, parameter 1 = #1) o110 if [#1 EQ 2] #1 = 3 (assign the value of 3 to parameter #1) (msg, #1 has been assigned the value of 3) o100 continue (skip to start of loop) o110 endif (some code here) #1 = [#1 + 1] (increment the test counter) o100 while [#1 LT 3] (msg, Loop Done!) M2 ----
fr: #1 = 0 (assigne la valeur 0 au paramètre #1) o100 do (debug, paramètre 1 = #1) o110 if [#1 EQ 2] #1 = 3 (assigne la valeur 3 au paramètre #1) (msg, #1 s'est vu assigné la valeur 3) o100 continue (saute au début de la boucle) o110 endif (le code d'usinage ici) #1 = [#1 + 1] (incrémente le compteur de test) o100 while [#1 LT 3] (msg, boucle terminée) M2 ----

source: Inside a while loop, 'O- break' immediately exits the loop, and 'O- continue' immediately skips to the next evaluation of the 'while' condition. If it is still true, the loop begins again at the top. If it is false, it exits the loop.
fr: À l'intérieur d'une boucle while, 'O- break', quitte immédiatement la boucle et 'O- continue', saute immédiatement à la prochaine évaluation de la condition du 'while'. Si elle est vraie, la boucle recommence au début. Si elle est fausse, la boucle est quittée.

source: [[sec:conditional]] == Conditional (((Conditional: if, elseif, else, endif)))(((if)))(((else)))(((elseif)))(((endif)))
fr: == Conditionnel[[sec:Conditionnels]]

source: The 'if' conditional consists of a group of statements with the same 'o' number that start with 'if' and end with 'endif'. Optional 'elseif' and 'else' conditions may be between the starting 'if' and the ending 'endif'.
fr: Le 'if' conditionnel exécute un groupe d'instructions avec le même nombre 'o' qui commence avec 'if' et se termine avec 'endif'. Les conditions optionnelles 'elseif' et 'else' peuvent se trouver entre le 'if' et le 'endif'.

source: If the 'if' conditional evaluates to true then the group of statements following the 'if' up to the next conditional line are executed.
fr: Si la condition du 'if' est vraie, les instructions qui suivent le 'if' seront exécutées jusqu'à, au maximum, l'instruction conditionnelle suivante.

source: If the 'if' conditional evaluates to false then the 'elseif' conditions are evaluated in order until one evaluates to true. If the 'elseif' condition is true then the statements following the 'elseif' up to the next conditional line are executed. If none of the 'if' or 'elseif' conditions evaluate to true then the statements following the 'else' are executed. When a condition is evaluated to true no more conditions are evaluated in the group.
fr: Si la condition du 'if' est fausse, alors les instructions conditionnelles 'elseif' suivantes seront évaluées l'une après l'autre. Si la condition du 'elseif' est vraie alors les instructions suivant ce 'elseif' seront exécutées jusqu'à l'instruction conditionnelle suivante. Si aucune des conditions du 'if' ou du 'elseif' n'est vraie, alors les instructions suivant le 'else' seront exécutées. Quand une condition est vraie, les autres instructions conditionnelles du groupe ne sont plus évaluées.

source: .If Endif Example ----
fr: .Exemple avec 'if - endif' ----

source: o101 if [#31 EQ 3] (if parameter #31 is equal to 3 set S2000) S2000 o101 endif ----
fr: o102 if [#31 EQ 3] (si le paramètre #31 est égal à 3 alors S2000) S2000 o102 endif ----

source: .If ElseIf Else EndIf Example ----
fr: .Exemple avec 'if - elseif - else - endif' ----

source: o102 if [#2 GT 5] (if parameter #2 is greater than 5 set F100) F100 o102 elseif [#2 LT 2] (else if parameter #2 is less than 2 set F200) F200 o102 else (else if parameter #2 is 2 through 5 set F150) F150 o102 endif ----
fr: o102 if [#2 GT 5] (si le paramètre #2 est supérieur à 5 alors F100) F100 o102 elseif [#2 LT 2] (sinon si le paramètre #2 est inférieur à 2 alors F200) F200 o102 else (sinon le paramètre #2 vaut entre 2 et 5 alors F150) F150 o102 endif ----

source: Several conditons may be tested for by 'elseif' statements until the 'else' path is finally executed if all preceding conditons are false:
fr: Plusieurs conditions peuvent être testées par les déclarations 'elseif', jusqu'à ce que le 'else' soit finalement exécuté si tous les conditions précédentes sont fausses:

source: .If Elseif Else Endif Example ----
fr: .Exemple avec 'If - Elseif - Else - Endif' ----

source: O102 if [#2 GT 5] (if parameter #2 is greater than 5 set F100) F100 O102 elseif [#2 LT 2] (else if parameter #2 less than 2 set F200) F20 O102 else (parameter #2 between 2 and 5) F200 O102 endif ----
fr: O102 if [#2 GT 5] (si le paramètre #2 est plus grand que 5 alors F100) F100 O102 elseif [#2 LT 2] (sinon si le paramètre #2 est moins grand que 2 alors F200) F20 O102 else (paramètre #2 entre 2 et 5) F200 O102 endif ----

source: [[sec:repeat]] == Repeat(((Repeat)))
fr: == Répétition[[sec:Repetitions]]

source: The 'repeat' will execute the statements inside of the repeat/endrepeat the specified number of times. The example shows how you might mill a diagonal series of shapes starting at the present position.
fr: La répétition 'repeat', exécutera les blocs contenus entre 'repeat' et 'endrepeat' le nombre de fois spécifié entre crochets. L'exemple suivant montre comment usiner une séries de 5 formes diagonales commençant à la position courante.

source: .Repeat Example ----
fr: .Exemple avec 'repeat' ----

source: (Mill 5 diagonal shapes) G91 (Incremental mode) o103 repeat [5] ... (insert milling code here) G0 X1 Y1 (diagonal move to next position) o103 endrepeat G90 (Absolute mode) ----
fr: (Usine 5 formes diagonales) G91 (Mode incrémental) o103 repeat [5] (insérer le code d'usinage ici) G0 X1 Y1 (Mouvement en diagonale vers la position suivante) o103 endrepeat G90 (Mode absolu) ----

source: The O-number may be given by a parameter and/or calculation.
fr: Le numéro de O- peut être donnée par un paramètre ou un calcul.

source: .Indirection Example ----
fr: .Exemple d'indirection ----

source: .Computing values in O-words For more information on computing values see the following sections
fr: .Calcul des valeurs dans les O-codes Voici un condensé des sections utiles aux calculs des O-codes:

source: <<sec:Parameters,Parameters>>
fr: <<sec:parametres, les paramètres>>

source: <<sec:Expressions,Expressions>>
fr: <<sec:Expressions, les expressions>>

source: <<sec:Binary-Operators,Binary Operators>>
fr: <<sec:Operateurs-Binaires, les opérateurs binaires>>

source: <<sub:functions,Functions>>
fr: <<sec:Fonctions, les fonctions>>

source: == Calling Files(((Calling Files)))
fr: == Appel de fichier

source: To call a separate file with a subroutine name the file the same as your call and include a sub and endsub in the file. The file must be in the directory pointed to by 'PROGRAM_PREFIX' or 'SUBROUTINE_PATH' in the ini file. The file name can include *lowercase* letters, numbers, dash, and underscore only. A named subroutine file can contain only a single subroutine definition.
fr: Pour appeler un fichier séparé avec un sous-programme, donner à ce fichier le même nom, il doit contenir un 'sub' et un 'endsub'. Le fichier appelé doit se trouver dans le répertoire pointé par la variable 'PROGRAM_PREFIX' ou 'SUBROUTINE_PATH' du fichier ini. Les noms de fichiers ne peuvent inclure que des lettres *minuscules*, des chiffres, des points et des tirets bas. Un fichier de sous-programme nommé ne peut contenir qu'une seule définition de sous-programme.

source: .Named File Example ----
fr: .Exemple: l'appel d'un fichier nommé ----

source: o<myfile> call ----
fr: o<monfichier> call (appel un fichier nommé) ----

source: .Numbered File Example ----
fr: .Exemple: l'appel d'un fichier numéroté ----

source: o123 call ----
fr: o123 call (appel un fichier numéroté) ----

source: In the called file you must include the oxxx sub and endsub and the file must be a valid file.
fr: Dans le fichier appelé doit se touver le 'sub' et le 'endsub' correspondant à l'appel. Le fichier doit être un fichier valide.

source: .Called File Example ----
fr: .Exemple: le fichier 'monfichier.ngc' appelé ----

source: (filename myfile.ngc) o<myfile> sub (code here) o<myfile> endsub M2 ----
fr: o<monfichier> sub (du code ici) o<monfichier> endsub M2 ----

source: [NOTE] The file names are lowercase letters only so 'o<MyFile>' is converted to 'o<myfile>' by the interpreter. More information about the search path and options for the search path are in the INI Configuration Section.
fr: [NOTE] Les noms de fichiers doivent être en lettres minuscules, ainsi 'o<MonFichier>' sera transformé en 'o<monfichier>' par l'interpréteur.

source: == Subroutine return values(((Return Values)))
fr: == Valeurs de retour de sous-programme

source: Subroutines may optionally return a value by an optional expression at an 'endsub' or 'return' statement.
fr: Les sous-programmes peuvent, éventuellement, retourner une valeur par une expression optionnelle à la déclaration 'endsub' ou 'return'.

source: .Return value example ----
fr: .Exemple de valeur avec Return ----

source: A subroutine return value is stored in the '#<_value>' <<sec:Predefined-Named-Parameters, predefined named parameter>> , and the '#<_value_returned>' predefined parameter is set to 1, to indicate a value was returned. Both paramters are global, and are cleared just before the next subroutine call.
fr: Une valeur de retour du sous-programme est stockée dans le <<sec:Predefined-Named-Parameters, paramètre nommé prédéfini>>, '#<_value>', la '#<_valeur_retournee>' du paramètre prédéfini passe à 1, ce qui indique qu'une valeur est retournée. Ces deux paramètres sont globaux, ils seront vidés juste avant le prochain appel du sous-programme.
