Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/other-code.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = Other Codes
fr: = Les autres codes

source: [[cha:other-codes]] (((Other Codes)))
fr: [[cha:Les-autres-codes]] (((Les autres codes)))

source: [[sec:F-feed-rate]] == F: Set Feed Rate (((F: Set Feed Rate)))
fr: == F: Réglage de la vitesse d'avance travail[[sec:F-Vitesse]] (((F: Réglage de la vitesse d'avance travail)))

source: 'Fx' - set the feed rate to 'x'. 'x' is usually in machine units (inches or millimeters) per minute.
fr: Pour régler la vitesse d'avance, programmer 'Fn', n étant la vitesse en unités machine (millimètres ou pouces) par minute.

source: The application of the feed rate is as described in the <<sub:feed-rate,Feed Rate>> Section, unless inverse time feed rate mode is in effect, in which case the feed rate is as described in the <<sec:G93-G94-G95-Mode,G93 G94 G95>> Section.
fr: L'application de la vitesse est telle que décrite dans l'aperçu global d'une machine numérique, section <<sub:Vitesse-d-avance,vitesse d'avance>>, à moins que le mode vitesse inverse du temps ne soit activé, dans ce cas, la vitesse est telle que décrite dans la section sur le choix des modes de <<sec:G93-G94-G95-Modes,vitesse>>.

source: [[sec:S-spindle-speed]] == S: Set Spindle Speed (((S: Set Spindle Speed)))
fr: == S: Réglage de la vitesse de rotation de la broche[[sec:S-Broche]] (((S: Réglage de la vitesse de rotation de la broche)))

source: 'Sx' - set the speed of the spindle to 'x' revolutions per minute (RPM).
fr: 'Sn' - régler la vitesse de la broche à 'n' tours par minute (tr/mn).

source: The spindle will turn at that speed when a 'M3' or 'M4' is in effect. It is OK to program an S word whether the spindle is turning or not. If the speed override switch is enabled and not set at 100%, the speed will be different from what is programmed. It is OK to program S0, the spindle will not turn if that is done.
fr: La broche va tourner à cette vitesse quand un 'M3' ou un 'M4' est activé. Il est permis de programmer un mot S que la broche tourne ou non. Si le curseur de correction de vitesse broche est autorisé et n'est pas positionné sur 100%, la vitesse de broche sera différente de celle programmée. Il est permis de programmer 'S0', la broche ne tournera pas.

source: It is an error if:
fr: C'est une erreur si:

source: the S number is negative.
fr: La valeur de S est négative.

source: As described in the <<sec:G84-Right-Hand-Tapping,G84>> Section, if a 'G84' (tapping) canned cycle is active and the feed and speed override switches are enabled, the one set at the lower setting will take effect. The speed and feed rates will still be synchronized. In this case, the speed may differ from what is programmed, even if the speed override switch is set at 100%.
fr: Comme décrit dans la section <<sec:G84,G84>>, si un cycle de taraudage 'G84' est actif et que les cuseurs de vitesse rapide et d'avance travail sont autorisés, celui qui a le réglage le plus bas sera utilisé. Les vitesses de rotation et d'avance resteront synchronisées. Dans ce cas, la vitesse peut différer de celle programmée, même si le curseur de correction de vitesse travail est sur 100%.

source: [[sec:T-Select-Tool]] == T: Select Tool (((T: Select Tool)))
fr: == T: Choix de l'outil[[sec:T-Choix-Outil]] (((T: Choix de l'outil)))

source: 'Tx' - prepare to change to tool 'x'.
fr: 'Tn' - préparation au changement d'outil, 'n' représente le prochain outil à monter.

source: The tool is not changed until an 'M6' is programmed (see Section <<sec:M6-Tool-Change,M6>>). The T word may appear on the same line as the 'M6' or on a previous line. It is OK if T words appear on two or more lines with no tool change. Only the the most recent T word will take effect at the next tool change.
fr: L'outil ne sera appelé et changé que quand un 'M6' sera programmé voir la section <<sec:M6-Appel-Outil, sur l'appel d'outil>>. Le mot T peut apparaitre sur la même ligne que le M6 ou sur une ligne précédente. Il est même permis, mais normalement inutile, qu'un mot T apparaisse à plus de deux lignes avant le changement d'outil. Seul le plus récent mot T prendra effet au prochain changement d'outil.

source: NOTE: When LinuxCNC is configured for a nonrandom toolchanger (see the entry for RANDOM_TOOLCHANGER in the <<sub:EMCIO-Section,EMCIO Section>>), 'T0' gets special handling: no tool will be selected. This is useful if you want the spindle to be empty after a tool change.
fr: NOTE: Quand LinuxCNC est configuré pour un changeur d'outil à positions fixes (voir les infos sur RANDOM_TOOLCHANGER dans la <<sub:Section-EMCIO,section EMCIO>>). Il est permis de programmer 'T0', aucun outil ne sera sélectionné. C'est utile pour avoir la broche vide.

source: NOTE: 'T0' When LinuxCNC is configured for a random toolchanger (see the entry for RANDOM_TOOLCHANGER in the <<sub:EMCIO-Section,EMCIO Section>>), 'T0' does not get any special treatment: T0 is a valid tool like any other. It is customary to use T0 on a random toolchanger machine to track an empty pocket, so that it behaves like a nonrandom toolchanger machine and unloads the spindle.
fr: NOTE: Qaund LinuxCNC est configuré pour un changeur d'outil à positions aléatoires (voir les infos sur RANDOM_TOOLCHANGER dans la <<sub:Section-EMCIO,section EMCIO>>). 'T0' ne demande aucun traitement spécial. T0 est un numéro d'outil valide comme les autres. T0 est utilisé sur les machines à changeur d'outil à positions aléatoires pour suivre une poche vide, de sorte que le changeur d'outil se comporte comme un changeur à positions fixes et décharge la broche.

source: a negative T number is used,
fr: Un valeur négative de T est utilisée.

source: * T number is used that does not appear in the tool table file (with the exception that T0 on nonrandom toolchangers *is* accepted, as noted above).
fr: * Une valeur de T supérieure au nombre de poches d'outils dans le carrousel est utilisée.

source: On some machines, the carousel will move when a T word is programmed, at the same time machining is occurring. On such machines, programming the T word several lines before a tool change will save time. A common programming practice for such machines is to put the T word for the next tool to be used on the line after a tool change. This maximizes the time available for the carousel to move.
fr: Sur certaines machines, le carrousel se déplace lorsque le mot T est programmé, avec l'usinage en cours. Sur ces machines, programmer 'Tn', plusieurs lignes de texte avant le changement d'outil permet de gagner du temps. Une pratique de programmation courante pour ces types de machines, consiste à placer le mot T pour le prochain outil sur la ligne suivant le changement d'outil. Cela laisse au carrousel tout le temps pour se positionner.

source: Rapid moves after a 'T<n>' will not show on the AXIS preview until after a feed move. This is for machines that travel long distances to change the tool like a lathe. This can be very confusing at first. To turn this feature off for the current tool program a G1 without any move after the 'T<n>'.
fr: Les mouvements rapides qui suivent un Tn, n'apparaissent pas sur l'écran de parcours d'outil d'Axis et ce, jusqu'au prochain mouvement en vitesse travail. Cela se remarque surtout sur les machines ayant de longues distances de déplacement lors du changement d'outil, comme les tours. Cela peut prêter à confusion au début. Pour contourner cet aléa pour l'outil courant, ajouter un G1 sans mouvement juste après le Tn.
