Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/overview.*.po
Languages: fr

source: [width="80%", cols="4,6", options="header"] |======================================== |Modal Group Meaning | Member Words |Stopping (Group 4) | M0, M1, M2, M30, M60 |I/O on/off (Group 5) | M6 Tn |Tool Change (Group 6) | M6 Tn |Spindle (Group 7) | M3, M4, M5 |Coolant (Group 8) | (M7 M8 can both be on), M9 |Override Switches (Group 9) | M48, M49 |User Defined (Group 10) |M100-M199 |========================================
fr: [width="100%", cols="4,6", options="header"] |========================================================== |Signification du groupe modal | Mots M |Types de fin de programme ('Groupe 4') | M0, M1, M2, M30, M60 |On/Off I/O ('Groupe 5') | M6 Tn |Appel d'outil ('Groupe 6') | M6 Tn |Commande de broche ('Groupe 7') | M3, M4, M5, M19 |Arrosages ('Groupe 8') | (M7, M8, peuvent être actifs simultanément), M9 |Boutons de correction de vitesse ('Groupe 9')| M48, M49, M50, M51 |Définis par l'utilisateur ('Groupe 10') | M100 à M199 |==========================================================

source: For several modal groups, when a machining center is ready to accept commands, one member of the group must be in effect. There are default settings for these modal groups. When the machining center is turned on or otherwise re-initialized, the default values are automatically in effect.
fr: Pour plusieurs groupes modaux, quand la machine est prête à accepter des commandes, un membre du groupe doit être actif. Il y a des paramètres par défaut pour ces groupes modaux. Lorsque la machine est mise en marche ou ré-initialisées, les valeurs par défaut sont automatiquement actives.

source: Group 1, the first group on the table, is a group of G codes for motion. One of these is always in effect. That one is called the current motion mode.
fr: Groupe 1, le premier groupe du tableau, est un groupe de G-codes pour les mouvements. À tout moment, un seul d'entre eux est actif. Il est appelé le mode de mouvement courant.

source: It is an error to put a G-code from group 1 and a G-code from group 0 on the same line if both of them use axis words. If an axis word-using G-code from group 1 is implicitly in effect on a line (by having been activated on an earlier line), and a group 0 G-code that uses axis words appears on the line, the activity of the group 1 G-code is suspended for that line. The axis word-using G-codes from group 0 are G10, G28, G30, and G92.
fr: C'est une erreur que de mettre un G-code du groupe 1 et un G-code du groupe 0 sur la même ligne si les deux utilisent les mêmes axes. Si un mot d'axe utilisant un G-code du groupe 1 est implicitement actif sur la ligne (en ayant été activé sur une ancienne ligne) et qu'un G-code du groupe 0 utilisant des mots d'axes apparaît sur la même ligne, l'activité du G-code du groupe 1 est révoquée pour le reste de la ligne. Les mots d'axes utilisant des G-codes du groupe 0 sont G10, G28, G30 et G92.

source: It is an error to include any unrelated words on a line with 'O-' flow control.
fr: C'est une erreur d'inclure des mots sans rapport sur une ligne avec le contrôle de flux 'O-'.

source: [[sec:comments]] == Comments
fr: == Commentaires[[sec:Commentaires]]

source: Comments can be added to lines of G code to help clear up the intention of the programmer. Comments can be embedded in a line using parentheses () or for the remainder of a line using a semi-colon. The semi-colon is not treated as the start of a comment when enclosed in parentheses.
fr: Des commentaires peuvent être ajoutés aux lignes de G-code pour clarifier l'intention du programmeur. Les commentaires peuvent être placés sur une ligne en les encadrant par des parenthèses. Ils peuvent aussi occuper tout le reste de la ligne à partir d'un point virgule. Le point virgule n'est pas traité comme un début de commentaire si il se trouve entre deux parenthèses.

source: Comments may appear between words, but not between words and their corresponding parameter. So, 'S100(set speed)F200(feed)' is OK while 'S(speed)100F(feed)' is not.
fr: Les commentaires peuvent se trouver entre des mots, mais pas entre des mots et leur paramètre correspondant. Ainsi, 'S100(set speed)F200(feed)' est correct alors que 'S(speed)100F(feed)' ne l'est pas.

source: G0 (Rapid to start) X1 Y1 G0 X1 Y1 (Rapid to start; but don't forget the coolant) M2 ; End of program. ---------------------------------------------------------------------
fr: G0 (Rapide à démarrer.) X1 Y1 G0 X1 Y1 (Rapide à démarrer; mais n'oubliez pas l'arrosage.) M2 ; Fin du programme. ----

source: There are several 'active' comments which look like comments but cause some action, like '(debug,..)' or '(print,..)'. If there are several comments on a line, only the last comment will be interpreted according to these rules. Hence, a normal comment following an active comment will in effect disable the active comment. For example, '(foo) (debug,#1)' will print the value of parameter '#1', however '(debug,#1)(foo)' will not.
fr: Il y a plusieurs commentaires 'actif' qui ressemblent à un commentaire mais qui produit certaines actions, comme '(debug,...)' ou '(print,...)', expliqués plus loin. Si plusieurs commentaires se trouvent sur la même ligne, seul le dernier sera interprété selon les règles. Par conséquent, un commentaire normal suivant un commentaire actif aura pour effet de désactiver le commentaire actif. Par exemple, '(foo) (debug,#1)' affichera la valeur du paramètre '#1', mais '(debug,#1) (foo)' ne l'affichera pas.

source: A comment introduced by a semicolon is by definition the last comment on that line, and will always be interpreted for active comment syntax.
fr: Un commentaire commençant par un point virgule est par définition le dernier commentaire sur cette ligne et sera toujours interprété selon la syntaxe des commentaires actifs.

source: [[sec:messages]] == Messages (((Messages)))
fr: == Messages[[sec:Messages]]

source: * '(MSG,)' - displays message if 'MSG' appears after the left parenthesis and before any other printing characters. Variants of 'MSG' which include white space and lower case characters are allowed. The rest of the characters before the right parenthesis are considered to be a message. Messages should be displayed on the message display device of the user interface if provided.
fr: * '(MSG,)' - Un commentaire contient un message si 'MSG' apparaît après la parenthèse ouvrante et avant tout autre caractère. Les variantes de 'MSG' qui incluent un espace blanc et des minuscules sont permises. Le reste du texte avant la parenthèse fermante est considéré comme un message. Les messages sont affichés sur la visu de l'interface utilisateur.

source: .Message Example ----
fr: .Exemple de message ----

source: (MSG, This is a message) ----
fr: (MSG, Ceci est un message) ----

source: [[sec:probe-logging]] == Probe Logging (((Probe Logging)))
fr: == Enregistrement des mesures[[sec:Log-des-mesures]]

source: * '(PROBEOPEN filename.txt)' - will open filename.txt and store the 9-number coordinate consisting of XYZABCUVW of each successful straight probe in it. * '(PROBECLOSE)' - will close the open probelog file.
fr: * '(PROBEOPEN filename.txt)' - ouvrira le fichier 'filename.txt' et y enregistrera les 9 coordonnées de XYZABCUVW pour chacune des mesures réussie. * '(PROBECLOSE)'. - fermera le fichier de log palpeur.

source: For more information on probing see the <<sec:G38-probe,G38>> Section.
fr: Voir la section <<sec:G38-x-Palpeur, sur la mesure au palpeur>> pour d'autres informations sur le palpage avec G38.

source: [[sec:log]] == Logging (((Logging)))
fr: == Log général[[sec:Log-general]]

source: * '(LOGOPEN,filename.txt)' - opens the named log file. If the file already exists, it is truncated.
fr: * '(LOGOPEN,filename.txt)' - Ouvre le fichier de log 'filename.txt'. Si le fichier existe déjà, il sera tronqué.

source: * '(LOGAPPEND,filename)' - opens the named log file. If the file already exists, the data is appended.
fr: * '(LOGAPPEND,filename.txt)' - Ouvre le fichier de log 'filename.txt'. Si le fichier existe déjà, il sera ajoutées.

source: '(LOGCLOSE)' - closes an open log file.
fr: '(LOGCLOSE)' - Si le fichier est ouvert, il sera fermé.

source: * '(LOG,)' - everything past the ',' is written to the log file if it is open. Supports expansion of parameters as described below.
fr: * '(LOG,message)' - Le 'message' placé derrière la virgule est écrit dans le fichier de log si il est ouvert. Supporte l'extension des paramètres comme décrit plus loin.

source: [[sec:debug-messages]] == Debug Messages (((Debug Messages)))
fr: == Messages de débogage[[sec:Messages-debogage]]

source: * '(DEBUG,)' - displays a message like '(MSG,)' with the addition of special handling for comment parameters as described below.
fr: * '(DEBUG,commentaire)' sont traités de la même façon que ceux avec '(msg,reste du commentaire)' avec l'ajout de possibilités spéciales pour les paramètres, comme décrit plus loin.

source: [[sec:print-messages]] == Print Messages (((Print Messages)))
fr: == Messages print[[sec:print-messages]]

source: * '(PRINT,)' - messages are output to 'stderr' with special handling for comment parameters as described below.
fr: * '(PRINT,commentaire)' vont directement sur la sortie 'stderr' avec des possibilités spéciales pour les paramètres, comme décrit plus loin.

source: == Comment Parameters
fr: == Paramètres dans les commentaires

source: In the DEBUG, PRINT and LOG comments, the values of parameters in the message are expanded.
fr: Dans les commentaires avec DEBUG, PRINT et LOG, les valeurs des paramètres dans le message sont étendues.

source: For example: to print a named global variable to stderr (the default console window) add a line to your G code like...
fr: Par exemple: pour afficher le contenu d'une variable nommée globale sur la sortie stderr (la fenêtre de la console par défaut), ajouter une ligne au G-code comme...

source: .Parameters Example ----
fr: .Exemple de paramètres en commentaire ----

source: (print,endmill dia = #<_endmill_dia>) (print,value of variable 123 is: #123) ----
fr: (print,diamètre fraise 3 dents = #<_troisdents_dia>) (print,la valeur de la variable 123 est: #123) ----

source: Inside the above types of comments, sequences like '\#123' are replaced by the value of the parameter 123. Sequences like '\#<named parameter>' are replaced by the value of the named parameter. Named parameters will have white space removed from them. So, '\#<named parameter>' will be converted to '#<namedparameter>'.
fr: À l'intérieur de ces types de commentaires, les séquences comme '#123' sont remplacées par la valeur du paramètre 123. Les séquences comme '#<paramètre nommé>' sont remplacées par la valeur du paramètre nommé. Les espaces dans les noms des paramètres nommés seront supprimés, '#<parametre nomme>' deviendra '#<parametrenomme>'.

source: == File Requirements
fr: == Exigences des fichiers

source: A G code file must contain one or more lines of G code and be terminated with a <<sec:M2-M30,Program End>>. Any G code past the program end is not evaluated.
fr: Un programme G-code doit contenir une ou plusieurs lignes de G-code puis se terminer par un code de <<sec:M2-M30,fin de programme>>. Tout G-code, placé après ce code de fin de programme, sera ignoré.

source: If a program end code is not used a pair of percent signs '%' with the first percent sign on the first line of the file followed by one or more lines of G code and a second percent sign. Any code past the second percent sign is not evaluated.
fr: Si le programme n'utilise pas le G-code de fin de programme, une paire de signes pourcent '%' peut être utilisée. Le premier signe '%' doit dans ce cas se trouver sur la première ligne du fichier, suivi par une ou plusieurs lignes de G-code, puis du second signe '%'. Tout G-code placé après le second signe '%' sera ignoré.

source: [NOTE] The file must be created with a text editor like Gedit and not a word processor like Open Office Word Processor.
fr: [NOTE]Les fichiers de G-code doivent être créés avec un éditeur de texte comme Gedit et non avec un traitement de texte comme Open Office.

source: == File Size
fr: == Taille des fichiers

source: The interpreter and task are carefully written so that the only limit on part program size is disk capacity. The TkLinuxCNC and Axis interface both load the program text to display it to the user, though, so RAM becomes a limiting factor. In Axis, because the preview plot is drawn by default, the redraw time also becomes a practical limit on program size. The preview can be turned off in Axis to speed up loading large part programs. In Axis sections of the preview can be turned off using <<sub:axis-preview-control,preview control>> comments.
fr: L'interpréteur et le gestionnaire de tâches ont été écrits, de sorte que la taille des fichiers n'est limité que par la capacité du disque dur. Les interfaces graphiques TkLinuxCNC et Axis affichent tous les deux le programme G-code à l'écran pour l'utilisateur, cependant, la RAM devient un facteur limitant. Dans Axis, parce-que l'aperçu du parcours d'outil est affiché par défaut, le rafraîchissement de l'écran devient une limite pratique à la taille des fichiers. Le tracé du parcours d'outil peut être désactivé dans Axis pour accélérer le chargement des fichiers conséquents. L'aperçu peut être désactivé en passant un <<sub:Commentaires-speciaux,commentaire spécial>>.

source: [[sec:Order-of-Execution]] == G Code Order of Execution (((G Code Order of Execution)))
fr: == Ordre d'exécution[[sec:Ordre-d-execution]]

source: The order of execution of items on a line is defined not by the position of each item on the line, but by the following list:
fr: L'ordre d'exécution des éléments d'une ligne est défini, non pas par sa position dans la ligne mais par la liste suivante:

source: O-word commands (optionally followed by a comment but no other words allowed on the same line)
fr: Commandes O-code, optionnellement suivies d'un commentaire mais aucun autre mot n'est permis sur la même ligne.

source: Comment (including message)
fr: Commentaire (message inclus)

source: Set feed rate mode (G93, G94).
fr: Positionnement du mode de vitesses (G93, G94).

source: Set feed rate (F).
fr: Réglage de la vitesse travail (F).

source: Set spindle speed (S).
fr: Réglage de la vitesse de rotation de la broche (S).

source: Select tool (T).
fr: Sélection de l'outil (T).

source: HAL pin I/O (M62-M68).
fr: pin I/O de HAL (M62 à M68).

source: Change tool (M6) and Set Tool Number (M61).
fr: Appel d'outil (M6) et réglage du N° d'outil (M61).

source: Spindle on or off (M3, M4, M5).
fr: Marche/Arrêt broche (M3, M4, M5).

source: Save State (M70, M73), Restore State (M72), Invalidate State (M71).
fr: Enregistrer l'état (M70, M73), restaurer l'état (M72), invalider l'état (M71).

source: Coolant on or off (M7, M8, M9).
fr: Marche/Arrêt arrosages (M7, M8, M9).

source: Enable or disable overrides (M48, M49,M50,M51,M52,M53).
fr: Activation/Inhibition des correcteurs de vitesse (M48, M49, M50, M51, M52, M53).

source: User-defined Commands (M100-M199).
fr: Commandes définies par l'opérateur (M100 à M199).

source: Dwell (G4).
fr: Temporisation (G4).

source: Set active plane (G17, G18, G19).
fr: Choix du plan de travail (G17, G18, G19).

source: Set length units (G20, G21).
fr: Choix des unités de longueur (G20, G21).

source: Cutter radius compensation on or off (G40, G41, G42)
fr: Activation/Désactivation de la compensation de rayon d'outil (G40, G41, G42).

source: Cutter length compensation on or off (G43, G49)
fr: Activation/Désactivation de la compensation de longueur d'outil (G43, G49).

source: Coordinate system selection (G54, G55, G56, G57, G58, G59, G59.1, G59.2, G59.3).
fr: Sélection du système de coordonnées (G54, G55, G56, G57, G58, G59, G59.1, G59.2, G59.3).

source: Set path control mode (G61, G61.1, G64)
fr: Réglage du mode de trajectoire (G61, G61.1, G64)

source: Set distance mode (G90, G91).
fr: Réglage du mode de déplacement (G90, G91).

source: Set retract mode (G98, G99).
fr: Réglage du mode de retrait (G98, G99).

source: * Go to reference location (G28, G30) or change coordinate system data (G10) or set axis offsets (G92, G92.1, G92.2, G94). * Perform motion (G0 to G3, G33, G38.x, G73, G76, G80 to G89), as modified (possibly) by G53. * Stop (M0, M1, M2, M30, M60).
fr: * Prise d'origine (G28, G30) ou établissement du système de coordonnées (G10) ou encore, réglage des décalages d'axes (G92, G92.1, G92.2, G94). * Effectuer un mouvement (G0 à G3, G33, G80 à G89), tel que modifié (éventuellement) par G53. * Arrêt (M0, M1, M2, M30, M60).

source: == G Code Best Practices (((G Code Best Practices)))
fr: == G-Code: Bonnes pratiques (((G-Code bonnes pratiques)))

source: === Use an appropriate decimal precision
fr: === Utiliser un nombre de décimales approprié

source: Use at least 3 digits after the decimal when milling in millimeters, and at least 4 digits after the decimal when milling in inches.
fr: Utiliser au plus 3 chiffres après la virgule pour l'usinage en millimètres et au plus 4 chiffres après la virgule pour l'usinage en pouces.

source: === Use consistent white space
fr: === Utiliser les espaces de façon cohérente

source: G-code is most legible when at least one space appears before words. While it is permitted to insert white space in the middle of numbers, there is no reason to do so.
fr: Le G-code est plus lisible quand au moins un espace apparaît avant les mots. S'il est permis d'insérer des espaces blancs au milieu des chiffres, il faut éviter de le faire.

source: === Use Center-format arcs
fr: === Préférer le 'format centre' pour les arcs

source: Center-format arcs (which use 'I- J- K-' instead of 'R-' ) behave more consistently than R-format arcs, particularly for included angles near 180 or 360 degrees.
fr: Les arcs en format centre (qui utilisent 'I- J- K-' au lieu de 'R-' ) se comportent de façon plus précise que ceux en format rayon, particulièrement pour des angles proche de 180 et 360 degrés.

source: === Put important modal settings at the top of the file
fr: === Placer les codes modaux importants au début des programmes

source: When correct execution of your program depends on modal settings, be sure to set them at the beginning of the part program. Modes can carry over from previous programs and from the MDI commands.
fr: Lorsque l'exécution correcte de votre programme dépend de paramètres modaux, n'oubliez pas de les mettre au début du programme. Des modes incorrects peuvent provenir d'un programme précédent ou depuis des entrées manuelles.

source: As a good preventative measure, put a line similar to the following at the top of all your programs:
fr: Une bonne mesure préventive consiste à placer la ligne suivante au début de tous les programmes:

source: G17 G20 G40 G49 G54 G80 G90 G94 ---------------------------------------------------------------------
fr: G17 G21 G40 G49 G54 G80 G90 G94 ----

source: (XY plane, inch mode, cancel diameter compensation, cancel length offset, coordinate system 1, cancel motion, non-incremental motion, feed/minute mode)
fr: (plan XY, mode mm, annulation de la compensation de rayon, et de longueur, système de coordonnées numéro 1, arrêt des mouvements, déplacements absolus, mode vitesse/minute)

source: Perhaps the most critical modal setting is the distance units--If you do not include G20 or G21, then different machines will mill the program at different scales. Other settings, such as the return mode in canned cycles may also be important.
fr: Peut-être que le code modal le plus important est le réglage des unités machine. Si les codes G20 ou G21, ne sont pas inclus, selon les machines l'échelle d'usinage sera différente. D'autres valeurs comme le plan de retrait des cycles de perçage peuvent être importantes.

source: === Don't put too many things on one line
fr: === Ne pas mettre trop de choses sur une ligne

source: Ignore everything in Section <<sec:Order-of-Execution,Order of Execution>>, and instead write no line of code that is the slightest bit ambiguous.
fr: Ignorer le contenu de la section <<sec:Ordre-d-execution, ordre d'exécution>> et ne pas écrire de ligne de code qui laisse la moindre ambiguïté.

source: === Don't set & use a parameter on the same line
fr: === Ne pas définir et utiliser un paramètre sur la même ligne

source: Don't use and set a parameter on the same line, even though the semantics are well defined. Updating a variable to a new value, such as '#1=[#1+#2]' is OK.
fr: Ne pas 'utiliser' et 'définir' un paramètre sur la même ligne, même si la sémantique est bien définie. Mettre à jour une variable, à une nouvelle valeur, telle que '#1 = [#1 + #2]' est autorisé.

source: === Don't use line numbers
fr: === Ne pas utiliser les numéros de ligne

source: Line numbers offer no benefits. When line numbers are reported in error messages, the numbers refer to the line number in the file, not the N-word value.
fr: Les numéros de ligne n'apportent rien. Quand des numéros de ligne sont rapportés dans les messages d'erreur, ces numéros font référence aux numéros de lignes à l'intérieur du programme, pas aux valeurs des mots N.

source: == Linear and Rotary Axis
fr: == Axes rotatifs et linéaires

source: Because the meaning of an F-word in feed-per-minute mode varies depending on which axes are commanded to move, and because the amount of material removed does not depend only on the feed rate, it may be easier to use G93 inverse time feed mode to achieve the desired material removal rate.
fr: La signification du mot 'F-', exprimé en vitesse par minute, étant différente selon l'axe concerné par la commande de déplacement et parce-que la quantité de matière enlevée ne dépend pas seulement de la vitesse d'avance, il est facile d'utiliser le mode inverse du temps 'G93' pour atteindre la quantité de matériaux à enlever, souhaitée.

source: == Common Error Messages
fr: == Messages d'erreur courants

source: * 'G code out of range' - A G code greater than G99 was used, the scope of G codes in LinuxCNC is 0 - 99. Not every number between 0 and 99 is a valid G code. * 'Unknown g code used' - A G code was used that is not part of the LinuxCNC G code language. * 'i,j,k word with no Gx to use it' - i, j and k words must be used on the same line as the G code. * 'Cannot use axis values without a g code that uses them' - Axis values can not be used on a line without either a modal G code in effect or a G code on the same line. * 'File ended with no percent sign or program end' - Every G code file must end in a M2 or M30 or be wrapped with the percent sign %.
fr: * 'G code hors d'étendue' - Un G-code supérieur à G99 a été utilisé. L'étendue des G-codes dans LinuxCNC est comprise entre 0 et 99. Toutefois, les valeurs entre 0 et 99 ne sont pas toutes celle d'un G-code valide. * 'Utilisation d'un G code inconnu' - Un G-code à été utilisé qui n'appartient pas aux langage G-code de LinuxCNC. * 'Mot i, j, k sans Gx l'utilisant' - Les mots i, j et k doivent être utilisés sur la même ligne que leur G-code. * 'Impossible d'employer des valeurs d'axe sans G code pour les utiliser' - Les valeurs d'axe ne peuvent pas être utilisées sur une ligne sans qu'un G-code ne se trouve sur la même ligne ou qu'un G-code modal soit actif. * 'Le fichier se termine sans signe pourcent ni fin de programme' - Tout fichier G-code doit se terminer par un M2, un M30 ou être encadré par le signe '%'.

source: [appendix] = Numbered Parameters persistence [[var_file_format]]
fr: == Persistance des paramètres numérotés[[var_file_format]]
