Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/overview.*.po
Languages: fr

source: A parameter setting does not take effect until after all parameter values on the same line have been found. For example, if parameter 3 has been previously set to 15 and the line '#3=6 G1 X#3' is interpreted, a straight move to a point where X equals 15 will occur and the value of parameter 3 will be 6.
fr: La valeur d'un paramètre ne prendra pas effet tant que toutes les autres valeurs de paramètres sur la même ligne n'auront pas été trouvées. Par exemple, si le paramètre 3 a été fixé précédemment à 15, et que la ligne '#3=6 G1 X#3' est interprétée, un mouvement rectiligne jusqu'au point X=15 se produira et la valeur du paramètre 3 sera 6.

source: The '\#' character takes precedence over other operations, so that, for example, '\#1+2' means the number found by adding 2 to the value of parameter 1, not the value found in parameter 3. Of course, '\#[1+2]' does mean the value found in parameter 3. The '\#' character may be repeated; for example '##2' means the value of the parameter whose index is the (integer) value of parameter 2.
fr: Le caractère '\#' a une précédence supérieure à celle des autres opérations, ainsi par exemple, '\#1+2' signifie la valeur trouvée en ajoutant 2 à la valeur contenue dans le paramètre 1 et non la valeur trouvée dans le paramètre 3. Bien sûr, '\#[1+2]' signifie la valeur trouvée dans le paramètre 3. Le caractère '\#' peut être répété, par exemple '##2' signifie le paramètre dont le numéro est égal à la valeur entière trouvée dans le paramètre 2.

source: 31-5000:: G-Code user parameters. These parameters are global in the G Code file, and available for general use. Volatile.
fr: 31 à 5000:: Paramètres des G-Code utilisateur. Ces paramètres sont globaux dans le fichier G-code, et disponibles pour un usage général. Volatile.

source: 5061-5069:: Coordinates of a "G38.2" Probe result - X, Y, Z, A, B, C, U, V & W. Volatile.
fr: 5061 à 5069:: Coordonnées d'un résultat de palpage 'G38.2' - X Y Z A B C U V W. Volatile.

source: 5070:: "G38" probe result - 1 if success, 0 if probe failed to close. Used with G38.3 and G38.5. Volatile.
fr: 5070:: Résultat d'un palpage "G38" - 1 si succès, 0 si contact de sonde en défaut. Utilisé avec G38.3 et G38.5. Volatile.

source: 5161-5169:: "G28" Home for X, Y, Z, A, B, C, U, V & W. Persistent.
fr: 5161 à 5169:: Origine 'G28' pour X Y Z A B C U V W. Persistant.

source: 5181-5189:: "G30" Home for X, Y, Z, A, B, C, U, V & W. Persistent.
fr: 5181 à 5189:: Origine 'G30' pour X Y Z A B C U V W. Persistant.

source: 5210:: 1 if "G92" offset is currently applied, 0 otherwise. Persistent.
fr: 5210:: 1 si le décalage 'G92' est couramment appliqué, 0 autrement. Persistant.

source: 5211-5219:: "G92" offset for X, Y, Z, A, B, C, U, V & W. Persistent.
fr: 5211 à 5219:: Décalage 'G92' pour X Y Z A B C U V W. Persistant.

source: 5220:: Coordinate System number 1 - 9 for G54 - G59.3. Persistent.
fr: 5220:: Système de coordonnées 1 à 9 pour G54 à G59.3. Persistant.

source: 5221-5230:: Coordinate System 1, G54 for X, Y, Z, A, B, C, U, V, W & R. R denotes the XY rotation angle around the Z axis. Persistent.
fr: 5221 à 5230:: Système de coordonnées 1, G54 pour X Y Z A B C U V W R. Persistant.

source: 5241-5250:: Coordinate System 2, G55 for X, Y, Z, A, B, C, U, V, W & R. Persistent.
fr: 5241 à 5250:: Système de coordonnées 2, G55 pour X Y Z A B C U V W R. Persistant.

source: 5261-5270:: Coordinate System 3, G56 for X, Y, Z, A, B, C, U, V, W & R. Persistent.
fr: 5261 à 5270:: Système de coordonnées 3, G56 pour X Y Z A B C U V W R. Persistant.

source: 5281-5290:: Coordinate System 4, G57 for X, Y, Z, A, B, C, U, V, W & R. Persistent.
fr: 5281 à 5290:: Système de coordonnées 4, G57 pour X Y Z A B C U V W R. Persistant.

source: 5301-5310:: Coordinate System 5, G58 for X, Y, Z, A, B, C, U, V, W & R. Persistent.
fr: 5301 à 5310:: Système de coordonnées 5, G58 pour X Y Z A B C U V W R. Persistant.

source: 5321-5330:: Coordinate System 6, G59 for X, Y, Z, A, B, C, U, V, W & R. Persistent.
fr: 5321 à 5330:: Système de coordonnées 6, G59 pour X Y Z A B C U V W R. Persistant.

source: 5341-5350:: Coordinate System 7, G59.1 for X, Y, Z, A, B, C, U, V, W & R. Persistent.
fr: 5341 à 5350:: Système de coordonnées 7, G59.1 pour X Y Z A B C U V W R. Persistant.

source: 5361-5370:: Coordinate System 8, G59.2 for X, Y, Z, A, B, C, U, V, W & R. Persistent.
fr: 5361 à 5370:: Système de coordonnées 8, G59.2 pour X Y Z A B C U V W R. Persistant.

source: 5381-5390:: Coordinate System 9, G59.3 for X, Y, Z, A, B, C, U, V, W & R. Persistent.
fr: 5381 à 5390:: Système de coordonnées 9, G59.3 pour X Y Z A B C U V W R. Persistant.

source: 5399:: Result of M66 - Check or wait for input. Volatile.
fr: 5399:: Résultat de M66 - Surveille ou attends une entrée. Volatile.

source: 5400:: Tool Number. Volatile.
fr: 5400:: Numéro de l'outil courant. Volatile.

source: 5401-5409:: Tool Offsets for X, Y, Z, A, B, C, U, V & W. Volatile.
fr: 5401 à 5409:: Offset d'outil pour X Y Z A B C U V W. Volatile.

source: 5410:: Tool Diameter. Volatile.
fr: 5410:: Diamètre de l'outil courant. Volatile.

source: 5411:: Tool Front Angle. Volatile.
fr: 5411:: Angle frontal de l'outil courant. Volatile.

source: 5412:: Tool Back Angle. Volatile.
fr: 5412:: Angle arrière de l'outil courant. Volatile.

source: 5413:: Tool Orientation. Volatile.
fr: 5413:: Orientation de l'outil. Volatile.

source: 5420-5428:: Current relative position in the active coordinate system including all offsets and in the current program units for X, Y, Z, A, B, C, U, V & W, volatile.
fr: 5420 à 5428:: Position relative courante dans le système de coordonnées actif, incluant tous les décalages et dans l'unité courante du programme pour X Y Z A B C U V W. Volatile.

source: 5599:: flag for controlling the output of (DEBUG,) statements. 1=output, 0=no output; default=1. Volatile.
fr: 5599:: Drapeau pour contrôler la sortie d'état de (DEBUG,). 1=sortie, 0=sortie non; défaut=1. Volatile.

source: 5600:: toolchanger fault indicator. Used with the iocontrol-v2 component. 1: toolchanger faulted, 0: normal. Volatile.
fr: 5600:: Indicateur de défaut du changeur d'outil. Utilisé avec le composant iocontrol-v2. 1: erreur rencontrée, 0: normal. Volatile.

source: 5601:: toolchanger fault code. Used with the iocontrol-v2 component. Reflects the value of the `toolchanger-reason` HAL pin if a fault occured. Volatile.
fr: 5601:: Code de défaut du changeur d'outil. Utilisé avec le composant iocontrol-v2. Reflète la valeur de la pin de Hal 'toolchanger-reason' si une erreur s'est produite. Volatile.

source: [[sub:subroutine-parameters]] === Subroutine Parameters
fr: === Paramètres de sous-programme[[sec:Parametres-sous-programme]]

source: 1-30:: Subroutine local parameters of call arguments. These parameters are local to the subroutine. Volatile. See also the chapter on <<cha:O-Codes,O-Codes>>.
fr: 1-30:: Paramètres d'appel d'arguments, locaux au sous-programme. Voir la section des <<cha:O-codes, O-codes>>.

source: [[sub:Named-Parameters]] === Named Parameters
fr: === Paramètres nommés[[sec:Parametres-Nommes]]

source: Named parameters work like numbered parameters but are easier to read. All parameter names are converted to lower case and have spaces and tabs removed, so '#<param>' and '#<P a R am >' refer to the same parameter. Named parameters must be enclosed with `< >` marks.
fr: Les paramètres nommés fonctionnent comme les paramètres numérotés mais sont plus faciles à lire. Les paramètres nommés sont tous convertis en minuscules, les espaces et tabulations sont supprimés. Les paramètres nommés doivent être encadrés des signes '<' et '>'.

source: '#<named parameter here>' is a local named parameter. By default, a named parameter is local to the scope in which it is assigned. You can't access a local parameter outside of its subroutine - this is so that two subroutines can use the same parameter names without fear of one subroutine overwriting the values in another.
fr: '#<Un paramètre nommé>' est un paramètre nommé local. Par défaut, un paramètre nommé est local à l'étendue dans laquelle il est assigné. L'accès à un paramètre local, en dehors de son sous-programme est impossible, de sorte que deux sous-programmes puissent utiliser le même nom de paramètre sans craindre qu'un des deux n'écrase la valeur de l'autre.

source: '#<_global named parameter here>' is a global named parameter. They are accessible from within called subroutines and may set values within subroutines that are accessible to the caller. As far as scope is concerned, they act just like regular numeric parameters. They are not stored in files.
fr: '#<_un paramètre global>' est un paramètre nommé global. Noter le '_' qui les caractérise en début de nom. Ils sont accessibles depuis les sous-programmes appelés, et peuvent définir des valeurs dans tous les sous-programmes accessibles à l'appelant. En ce qui concerne la portée, ils agissent comme des paramètres numérotés. Ils ne sont pas enregistrés dans des fichiers.

source: Examples:
fr: Exemples:

source: Declaration of named global variable
fr: Déclaration d'une variable nommée globale

source: #<_endmill_dia> = 0.049 ----
fr: #<_troisdents_dia> = 10.00 ----

source: Reference to previously declared global variable
fr: Référence à la variable globale précédemment déclarée

source: #<_endmill_rad> = [#<_endmill_dia>/2.0] ----
fr: #<_troisdents_rayon> = [#<_troisdents_dia>/2.0] ----

source: Mixed literal and named parameters
fr: Mélange de paramètres nommés et de valeurs littérales

source: o100 call [0.0] [0.0] [#<_inside_cutout>-#<_endmill_dia>] [#<_Zcut>] [#<_feedrate>] ----
fr: o100 call [0.0] [0.0] [#<_decoupe_interieure>-#<_troisdents_dia>][#<_Zprofondeur>] [#<_vitesse>] ----

source: Named parameters spring into existence when they are assigned a value for the first time. Local named parameters vanish when their scope is left: when a subroutine returns, all its local parameters are deleted and cannot be referred to anymore.
fr: Les paramètres nommés apparaissent quand une valeur leur est assignée pour la première fois. Ils disparaissent lorsque leur portée d'application est quittée: au retour d'un sous-programme, tous ses paramètres locaux sont effacés et ne peuvent plus être référencés nulle part.

source: It is an error to use a non-existent named paramater within an expression, or at the right-hand side of an assignment. Printing the value of a non-existent named parameter with a DEBUG statement - like '(DEBUG, #<no_such_parameter>)' will display the string +++######+++.
fr: C'est une erreur d'utiliser un paramètre nommé inexistant dans une expression, ou à la droite d'une assignation. Afficher la valeur d'un paramètre local inexistant dans un message d'état de DEBUG, comme '(DEBUG, #<parametre_introuvable>)' affichera la chaîne +++######+++.

source: Global parameters, as well as local parameters assigned to at the global level, retain their value once assigned even when the program ends, and have these values when the program is run again.
fr: Les paramètres globaux, ainsi que les paramètres locaux assignés au niveau global, conservent leur valeur une fois assignée, même lorsque le programme se termine, ils auront toujours ces valeurs à la prochaine exécution du programme.

source: The <<EXISTS-Function,'EXISTS' function>> tests whether a given named parameter exists.
fr: La <<Fonction-EXISTS,fonction 'EXISTS'>> teste si le paramètre nommé donné existe.

source: === Predefined Named Parameters[[sec:Predefined-Named-Parameters]]
fr: === Paramètres nommés prédéfinis[[sec:Predefined-Named-Parameters]]

source: The following global read only named parameters are available to access internal state of the interpreter and machine state. They can be used in arbitrary expressions, for instance to control flow of the program with if-then-else statements. Note that <<sec:Adding-Predefined-Named-Parameters,new predefined named parameters>> can be added easily without changes to the source code.
fr: Les paramètres globaux suivants sont disponibles en lecture seule, pour accéder aux états internes de l'interpréteur et de la machine. Ils peuvent être utilisés dans les expressions quelconques, par exemple pour contrôler le flux d'un programme avec les instructions 'if-then-else'.

source: `#<_vmajor>` - Major package version. If current version was 2.5.2 would return 2.5.
fr: '#<_vmajor>' - Version majeure de LinuxCNC. Si la version courante est 2.5.2, 2.5 est retourné.

source: `#<_vminor>` - Minor package version. If current version was 2.6.2 it would return 0.2.
fr: '#<_vminor>' - Version mineure du LinuxCNC. Si la version courante est 2.6.2, 0.2 est retourné.

source: * `#<_line>` - Sequence number. If running a G-Code file, this returns the current line number.
fr: * '#<_line>' - Numéro de séquence. Si un fichier G-code est en cours, le numéro de la ligne courante est retourné.

source: * `#<_motion_mode>` - Return the interpreter's current motion mode:
fr: * '#<_current_pocket>' - Retourne le N° de poche de l'outil courant.

source: [width="20%",options="header"] |======================================== |Motion mode | return value |G1| 10 |G2| 20 |G3| 30 |G33| 330 |G38.2| 382 |G38.3| 383 |G38.4| 384 |G38.5| 385 |G5.2| 52 |G73| 730 |G76| 760 |G80| 800 |G81| 810 |G82| 820 |G83| 830 |G84| 840 |G85| 850 |G86| 860 |G87| 870 |G88| 880 |G89| 890 |========================================
fr: * '#<_motion_mode>' - Retourne le mode mouvement courant de l'interpréteur: [width="20%",options="header",align="left"] |======================================== |Mode mouvement | Valeur retournée |G1| 10 |G2| 20 |G3| 30 |G33| 330 |G38.2| 382 |G38.3| 383 |G38.4| 384 |G38.5| 385 |G5.2| 52 |G73| 730 |G76| 760 |G80| 800 |G81| 810 |G82| 820 |G83| 830 |G84| 840 |G85| 850 |G86| 860 |G87| 870 |G88| 880 |G89| 890 |======================================== * '#<_plane>' - Retourne une valeur désignant le plan courant: [width="20%",options="header",align="left"] |======================================== |Plan | Valeur retournée |G17| 170 |G18| 180 |G19| 190 |G17.1| 171 |G18.1| 181 |G19.1| 191 |========================================

source: * `#<_plane>` - returns the value designating the current plane:
fr: * '#<_current_pocket>' - Retourne le N° de poche de l'outil courant.

source: [width="20%",options="header"] |======================================== |Plane | return value |G17| 170 |G18| 180 |G19| 190 |G17.1| 171 |G18.1| 181 |G19.1| 191 |========================================
fr: [width="30%", options="header",align="left"] |======================================== |N° de paramètre | Valeur du paramètre |5161 | 0.0 |5162 | 0.0 |========================================

source: * `#<_ccomp>` - Status of cutter compensation. Return values:
fr: * '#<_ccomp>' - Statut de la compensation d'outil. Retourne une valeur:

source: [width="20%",options="header"] |======================================== |Mode | return value |G40 | 400 |G41 | 410 |G41.1| 411 |G41 | 410 |G42 | 420 |G42.1 | 421 |========================================
fr: * '#<_ccomp>' - Statut de la compensation d'outil. Retourne une valeur: [width="20%",options="header",align="left"] |======================================== |Mode | Valeur retournée |G40 | 400 |G41 | 410 |G41.1| 411 |G41 | 410 |G42 | 420 |G42.1 | 421 |========================================

source: * `#<_metric>` - Return 1 if G21 is on, else 0.
fr: * '#<_metric>' - Retourne 1 si G21 est 'on', sinon 0.

source: * `#<_imperial>` - Return 1 if G20 is on, else 0.
fr: * '#<_imperial>' - Retourne 1 si G20 est 'on', sinon 0.

source: * `#<_absolute>` - Return 1 if G90 is on, else 0.
fr: * '#<_absolute>' - Retourne 1 si G90 est 'on', sinon 0.

source: * `#<_incremental>` - Return 1 if G91 is on, else 0.
fr: * '#<_incremental>' - Retourne 1 si G91 est 'on', sinon 0.

source: * `#<_inverse_time>` - Return 1 if inverse feed mode (G93) is on, else 0.
fr: * '#<_inverse_time>' - Retourne 1 si le mode inverse du temps (G93) est 'on', sinon 0.

source: * `#<_units_per_minute>` - Return 1 if Units/minute feed mode (G94) is on, else 0.
fr: * '#<_units_per_minute>' - Retourne 1 si le mode unités par minute (G94) est 'on', sinon 0.

source: * `#<_units_per_rev>` - Return 1 if Units/revolution mode (G95) is on, else 0.
fr: * '#<_units_per_rev>' - Retourne 1 si le mode Unités par tour (G95) est 'on', sinon 0.

source: * `#<_coord_system>` - Return index of the current coordinate system (G54..G59.3)
fr: * '#<_coord_system>' - Retourne l'index du système de coordonnées courant (G54 à G59.3).

source: [width="20%",options="header"] |======================================== |Mode | return value |G54| 0 |G55| 1 |G56| 2 |G57| 3 |G58| 4 |G59| 5 |G59.1|6 |G59.2|7 |G59.3|8 |========================================
fr: [width="20%",options="header",align="left"] |======================================== |Mode | Valeur retournée |G54| 0 |G55| 1 |G56| 2 |G57| 3 |G58| 4 |G59| 5 |G59.1|6 |G59.2|7 |G59.3|8 |========================================

source: * `#<_tool_offset>` - Return 1 if tool offset (G43) is on, else 0.
fr: * '#<_tool_offset>' - Retourne 1 si l'offset d'outil (G43) est 'on', sinon 0.

source: * `#<_retract_r_plane>` - Return 1 if G98 is set, else 0.
fr: * '#<_retract_r_plane>' - Retourne 1 si G98 est actif, sinon 0.

source: * `#<_retract_old_z>` - Return 1 if G99 is on, else 0.
fr: * '#<_retract_old_z>' - Retourne 1 si G99 est 'on', sinon 0.

source: [[sub:system-parameters]] === System Parameters
fr: === Paramètres système[[sec:Parametres-Systeme]]

source: * `#<_spindle_rpm_mode>` - Return 1 if spindle rpm mode (G97) is on, else 0.
fr: * '#<_spindle_rpm_mode>' - Retourne 1 si la broche est en mode tr/mn (G97), sinon 0.

source: * `#<_spindle_css_mode>` - Return 1 if constant surface speed mode (G96) is on, else 0.
fr: * '#<_spindle_css_mode>' - Retourne 1 si la broche est en mode vitesse de coupe constante (G96), sinon 0.

source: * `#<_ijk_absolute_mode>` - Return 1 if Absolute Arc distance mode (G90.1) is on, else 0.
fr: * '#<_ijk_absolute_mode>' - Retourne 1 si le mode de déplacement en arc est absolu (G90.1), sinon 0.

source: * `#<_lathe_diameter_mode>` - Return 1 if this is a lathe configuration and diameter (G7) mode is on, else 0.
fr: * '#<_lathe_diameter_mode>' - Retourne 1 pour un tour configuré en mode diamètre (G7), sinon 0.

source: * `#<_lathe_radius_mode>` - Return 1 if this is a lathe configuration and radius (G8) mode is on, else 0.
fr: * '#<_lathe_radius_mode>' - Retourne 1 pour un tour configuré en mode rayon (G8), sinon 0.

source: * `#<_spindle_on>` - Return 1 if spindle currently running (M3 or M4) else 0.
fr: * '#<_spindle_on>' - Retourne 1 si la broche tourne (M3 ou M4 en cours), sinon 0.

source: * `#<_spindle_cw>` - Return 1 if spindle direction is clockwise (M3) else 0.
fr: * '#<_spindle_cw>' - Retourne 1 si la broche est dans le sens horaire (M3), sinon 0.

source: * `#<_mist>` - Return 1 if mist (M7) is on.
fr: * '#<_mist>' - Retourne 1 si l'arrosage par gouttelettes est activé (M7).

source: * `#<_flood>` - Return 1 if flood (M8) is on.
fr: * '#<_flood>' - Retourne 1 si l'arrosage fluide est activé (M8).

source: * `#<_speed_override>` - Return 1 if feed override (M48 or M50 P1) is on, else 0.
fr: * '#<_speed_override>' - Retourne 1 si un correcteur de vitesse est activé (M48 ou M50 P1), sinon 0.

source: * `#<_feed_override>` - Return 1 if feed override (M48 or M51 P1) is on, else 0.
fr: * '#<_feed_override>' - Retourne 1 si un correcteur de vitesse d'avance est activé (M48 ou M51 P1), sinon 0.

source: * `#<_adaptive_feed>` - Return 1 if adaptive feed (M52 or M52 P1) is on, else 0.
fr: * '#<_adaptive_feed>' - Retourne 1 si un correcteur de vitesse adaptative est activé (M52 ou M52 P1), sinon 0.

source: * `#<_feed_hold>` - Return 1 if feed hold switch is enabled (M53 P1), else 0.
fr: * '#<_feed_hold>' - Retourne 1 si le contrôle de coupure vitesse est activé (M53 P1), sinon 0.

source: * `#<_feed>` - Return the current feed value (F).
fr: * '#<_feed>' - Retourne la valeur courante d'avance travail (F).

source: * `#<_rpm>` - Return the current spindle speed (S).
fr: * '#<_rpm>' - Retourne la valeur courante de vitesse broche (S).

source: * `#<_x>` - Return current X coordinate. Same as #5420.
fr: * '#<_x>' - Retourne la coordonnée machine courante en X. Identique à #5420.

source: * `#<_y>` - Return current Y coordinate. Same as #5421.
fr: * '#<_y>' - Retourne la coordonnée machine courante en Y. Identique à #5421.

source: * `#<_z>` - Return current Z coordinate. Same as #5422.
fr: * '#<_z>' - Retourne la coordonnée machine courante en Z. Identique à #5422.

source: * `#<_a>` - Return current A coordinate. Same as #5423.
fr: * '#<_a>' - Retourne la coordonnée machine courante en A. Identique à #5423.

source: * `#<_b>` - Return current B coordinate. Same as #5424.
fr: * '#<_b>' - Retourne la coordonnée machine courante en B. Identique à #5424.

source: * `#<_c>` - Return current C coordinate. Same as #5425.
fr: * '#<_c>' - Retourne la coordonnée machine courante en C. Identique à #5425.

source: * `#<_u>` - Return current U coordinate. Same as #5426.
fr: * '#<_u>' - Retourne la coordonnée machine courante en U. Identique à #5426.

source: * `#<_v>` - Return current V coordinate. Same as #5427.
fr: * '#<_v>' - Retourne la coordonnée machine courante en V. Identique à #5427.

source: * `#<_w>` - Return current W coordinate. Same as #5428.
fr: * '#<_w>' - Retourne la coordonnée machine courante en W. Identique à #5428.

source: * `#<_current_tool>` - Return number of the current tool in spindle. Same as #5400.
fr: * '#<_current_tool>' - Retourne le N° de l'outil courant monté dans la broche. Identique à #5400.

source: * `#<_current_pocket>` - Return pocket number of the current tool.
fr: * '#<_current_pocket>' - Retourne le N° de poche de l'outil courant.

source: * `#<_selected_tool>` - Return number of the selected tool post a T code. Default -1.
fr: * '#<_selected_tool>' - Retourne le N° de l'outil sélectionné par le mot T. Par défaut -1.

source: * `#<_selected_pocket>` - Return number of the selected pocket post a T code. Default -1 (no pocket selected).
fr: * '#<_selected_pocket>' - Retourne le N° de poche sélectionné par le mot T. Par défaut -1 (pas de poche sélectionnée).

source: * `#<_value>` - [[param:_value]] Return value from the last O-word `return` or `endsub`. Default value 0 if no expression after `return` or `endsub`. Initialized to 0 on program start.
fr: * '#<_value>' - [[param:_value]] Retourne la valeur du dernier O-code 'return' ou 'endsub'. Valeur 0 par défaut si pas d'expression après 'return' ou 'endsub'. Initialisé à 0 au démarrage du programme.

source: * `#<_value_returned>` - 1.0 if the last O-word `return` or `endsub` returned a value, 0 otherwise. Cleared by the next O-word call.
fr: * '#<_value_returned>' - 1.0 si le dernier O-code 'return' ou 'endsub' a retourné une valeur, 0 autrement. Effacé par le prochain appel à un O-code.

source: * `#<_task>` - 1.0 if the executing interpreter instance is part of milltask, 0.0 otherwise. Sometimes it is necessary to treat this case specially to retain proper preview, for instance when testing the success of a probe (G38.x) by inspecting #5070, which will always fail in the preview interpreter (e.g. Axis).
fr: * '#<_task>' - 1.0 si l'instance en cours d'exécution par l'interpréteur fait partie d'une tâche de fraisage, 0.0 autrement. Il est parfois nécessaire de traiter ce cas particulier pour conserver un chemin d'outil propre, par exemple quand on teste le succès d'une mesure au palpeur (G38.x), en examinant #5070, ce qui ratait toujours dans le chemin d'outil de l'interpréteur (ex: Axis).
