Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/overview.*.po
Languages: fr

source: The values of parameters in the persistent range are retained over time, even if the machining center is powered down. LinuxCNC uses a parameter file to ensure persistence. It is managed by the Interpreter. The Interpreter reads the file when it starts up, and writes the file when it exits.
fr: Les valeurs des paramètres de la gamme persistante sont conservés au fil du temps, même si la machine est mise hors tension. LinuxCNC utilise un fichier de paramètres pour assurer la persistance. Il est géré par l'interpréteur. L'interpréteur lit le fichier quand il démarre, et écrit le fichier quand il s'arrête.

source: The format of a parameter file is shown in Table <<sec:format-parameter-file,Parameter File Format>>.
fr: Le format du fichier de paramètres est visible sur la table ci-dessous.

source: The Interpreter expects the file to have two columns. It skips any lines which do not contain exactly two numeric values. The first column is expected to contain an integer value (the parameter's number). The second column contains a floating point number (this parameter's last value). The value is represented as a double-precision floating point number inside the Interpreter, but a decimal point is not required in the file.
fr: L'interpréteur attend un fichier à deux colonnes. Il saute toutes les lignes qui ne contiennent pas exactement deux valeurs numériques. La première colonne doit contenir un nombre entier (le N° du paramètre). La deuxième colonne contient un nombre à virgule flottante (la valeur du paramètre). La valeur est représentée comme un nombre à virgule flottante en double précision à l'intérieur de l'interpréteur, mais un point décimal n'est pas requis dans le fichier.

source: Parameters in the user-defined range (31-5000) may be added to this file. Such parameters will be read by the Interpreter and written to the file as it exits.
fr: Des paramètres dans l'étendue définie par l'utilisateur (31 à 5000) peuvent être ajoutés à ce fichier. Ces paramètres seront lus par l'interpréteur et écrits dans le fichier quand il s'arrête.

source: Missing Parameters in the persistent range will be initialized to zero and written with their current values on the next save operation.
fr: Les paramètres manquants dans la gamme persistante seront initialisés à zéro et écrits avec leurs valeurs courantes lors de la prochaine opération de sauvegarde.

source: The parameter numbers must be arranged in ascending order. An `Parameter file out of order` error will be signaled if they are not in ascending order.
fr: Les numéros de paramètres doivent être disposés dans l'ordre croissant. Un fichier de paramètre en désordre aboutira à une erreur si l'ordre n'est pas croissant.

source: The original file is saved as a backup file when the new file is written.
fr: Le fichier d'origine est enregistré comme backup lorsque le nouveau fichier est écrit.

source: .Parameter File Format[[sec:format-parameter-file]]
fr: .Format des fichiers de paramètres[[sec:format-parameter-file]]

source: [width="90%", options="header"] |======================================== |Parameter Number | Parameter Value |5161 | 0.0 |5162 | 0.0 |========================================
fr: [width="30%", options="header",align="left"] |======================================== |N° de paramètre | Valeur du paramètre |5161 | 0.0 |5162 | 0.0 |========================================
