Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/overview.*.po
Languages: fr

source: * `#<_call_level>` - current nesting level of O-word procedures. For debugging.
fr: * '#<_call_level>' - niveau d'imbrication actuel des procédures O-word. Pour le débogage.

source: * `#<_remap_level>` - current level of the remap stack. Each remap in a block adds one to the remap level. For debugging.
fr: * '#<_remap_level>' - niveau actuel de la pile de remappage. Chaque remap dans un bloc, ajoute un niveau dans la pile. Pour le débogage.

source: [[sec:Expressions]] == Expressions
fr: == Expressions[[sec:Expressions]]

source: An expression is a set of characters starting with a left bracket '[' and ending with a balancing right bracket ']' . In between the brackets are numbers, parameter values, mathematical operations, and other expressions. An expression is evaluated to produce a number. The expressions on a line are evaluated when the line is read, before anything on the line is executed. An example of an expression is '[1 + acos[0] - [#3 ** [4.0/2]]]'.
fr: Une expression est un groupe de caractères commençant avec le crochet gauche '[' et se terminant avec le crocher droit ']' . Entre les crochets, on trouve des nombres, des valeurs de paramètre, des opérations mathématiques et d'autres expressions. Une expression est évaluée pour produire un nombre. Les expressions sur une ligne sont évaluées quand la ligne est lue et avant que quoi que ce soit, ne soit exécuté sur cette ligne. Un exemple d'expression: '[1 + acos[0] - [#3 ** [4.0/2]]]'.

source: [[sec:Binary-Operators]] == Binary Operators
fr: == Opérateurs binaires[[sec:Operateurs-Binaires]]

source: Binary operators only appear inside expressions. There are four basic mathematical operations: addition ('+'), subtraction ('-'), multiplication ('\*'), and division ('/'). There are three logical operations: non-exclusive or ('OR'), exclusive or ('XOR'), and logical and ('AND'). The eighth operation is the modulus operation ('MOD'). The ninth operation is the 'power' operation ('**') of raising the number on the left of the operation to the power on the right. The relational operators are equality ('EQ'), inequality ('NE'), strictly greater than ('GT'), greater than or equal to ('GE'), strictly less than ('LT'), and less than or equal to ('LE').
fr: Les opérateurs binaires ne se rencontrent que dans les expressions. Il y a quatre opérateurs mathématiques de base: addition (+), soustraction (-), multiplication (`*`) et division (`/`). Il y a trois opérateurs logiques: le ou (OR), le ou exclusif (XOR) et le et logique (AND). Le huitième opérateur est le modulo (MOD). Le neuvième opérateur est l'élévation à la puissance (`**`) qui élève le nombre situé à sa gauche à la puissance du nombre situé à sa droite. Les opérateurs de relation sont: égalité (EQ), non égalité (NE), strictement supérieur (GT), supérieur ou égal (GE), strictement inférieur (LT) et inférieur ou égal (LE).

source: The binary operations are divided into several groups according to their precedence. (see table <<cap:Operator-Precedence,Operator-Precedence>>) If operations in different precedence groups are strung together (for example in the expression '[2.0 / 3 * 1.5 - 5.5 / 11.0]'), operations in a higher group are to be performed before operations in a lower group. If an expression contains more than one operation from the same group (such as the first '/' and '*' in the example), the operation on the left is performed first. Thus, the example is equivalent to: '[ [ [2.0 / 3] * 1.5] - [5.5 / 11.0] ]' , which is equivalent to to '[1.0 - 0.5]' , which is '0.5'.
fr: Les opérations binaires sont divisées en plusieurs groupes selon leur précédence. Si dans une opération se trouvent différents groupes de précédence, par exemple dans l'expression '[2.0 / 3 * 1.5 - 5.5 / 11.0]', les opérations du groupe supérieur seront effectuées avant celles des groupes inférieurs. Si une expression contient plusieurs opérations du même groupe (comme les premiers '/' et '*' dans l'exemple), l'opération de gauche est effectuée en premier. Notre exemple est équivalent à: '[\[[2.0/3]*1.5]-[5.5/11.0]]', qui est équivalent à '[1.0-0.5]', le résultat est: '0.5'.

source: The logical operations and modulus are to be performed on any real numbers, not just on integers. The number zero is equivalent to logical false, and any non-zero number is equivalent to logical true.
fr: Les opérations logiques et le modulo sont exécutés sur des nombres réels et non pas seulement sur des entiers. Le zéro est équivalent à un état logique faux (FALSE), tout nombre différent de zéro est équivalent à un état logique vrai (TRUE).

source: .Operator Precedence[[cap:Operator-Precedence]](((operator precedence)))
fr: .Précédence des opérateurs[[sec:Precedence-des-operateurs]]

source: [width="60%", options="header", cols="2*^"] |======================================== |Operators | Precedence |** | 'highest' |* / MOD | |+ - | |EQ NE GT GE LT LE | |AND OR XOR | 'lowest' |========================================
fr: [width="90%", options="header"] |======================================== |Opérateurs | Précédence |** | 'haute' |* / MOD | |+ - | |EQ NE GT GE LT LE | |AND OR XOR | 'basse' |========================================

source: === Equality and floating-point values
fr: === Égalité des valeurs à virgule flottante

source: The RS274/NGC language only supports floating-point values of finite precision. Therefore, testing for equality or inequality of two floating-point values is inherently problematic. The interpreter solves this problem by considering values equal if their absolute difference is less than 0.0001 (this value is defined as `TOLERANCE_EQUAL` in src/emc/rs274ngc/interp_internal.hh).
fr: Le langage RS274/NGC ne supporte que les valeurs en virgule flottante ayant une précision finie. Par conséquent, tester l'égalité ou l'inégalité de deux valeurs à virgule flottante est problématique en soi. L'interpréteur résout ce problème en considérant les valeurs égales si leur différence absolue est inférieure à 0,0001 (cette valeur est définie comme 'TOLERANCE_EQUAL' dans src/emc/RS274NGC/interp_internal.hh).

source: [[sub:Unary-Operation-Value]] == Functions[[sub:functions]]
fr: == Fonctions[[sec:Fonctions]] [[sec:Operations-unaires]]

source: A function is either 'ATAN' followed by one expression divided by another expression (for example 'ATAN[2]/[1+3]') or any other function name followed by an expression (for example 'SIN[90]'). The available functions are shown in table <<cap:Functions,Functions>>. Arguments to unary operations which take angle measures ('COS', 'SIN', and 'TAN' ) are in degrees. Values returned by unary operations which return angle measures ('ACOS', 'ASIN', and 'ATAN') are also in degrees.
fr: Une fonction commence par son nom, comme 'ATAN', suivi par une expression divisée par une autre expression (par exemple, 'ATAN[2]/[1+3]') ou tout autre nom de fonction suivi par une expression (par exemple 'SIN[90]'). Les fonctions disponibles sont visibles le tableau ci-dessous. Les arguments pour les opérations unaires sur des angles ('COS', 'SIN' et 'TAN') sont en degrés. Les valeurs retournées par les opérations sur les angles ('ACOS', 'ASIN' et 'ATAN') sont également en degrés.

source: .Functions[[cap:Functions]]
fr: .Fonctions

source: [width="75%", options="header", cols="^,<"] |======================================== |Function Name | Function result |ATAN[Y]/[X] | Four quadrant inverse tangent |ABS[arg] | Absolute value |ACOS[arg] | Inverse cosine |ASIN[arg] | Inverse sine |COS[arg] | Cosine |EXP[arg] | e raised to the given power |FIX[arg] | Round down to integer |FUP[arg] | Round up to integer |ROUND[arg] | Round to nearest integer |LN[arg] | Base-e logarithm |SIN[arg] | Sine |SQRT[arg] | Square Root |TAN[arg] | Tangent |EXISTS[arg] | Check named Parameter |========================================
fr: [width="90%", options="header"] |======================================== |Nom de fonction | Fonction |ATAN[Y]/[X] | Tangente quatre quadrants |ABS[arg] | Valeur absolue |ACOS[arg] | Arc cosinus |ASIN[arg] | Arc sinus |COS[arg] | Cosinus |EXP[arg] | Exposant |FIX[arg] | Arrondi à l'entier immédiatement inférieur |FUP[arg] | Arrondi à l'entier immédiatement supérieur |ROUND[arg] | Arrondi à l'entier le plus proche |LN[arg] | Logarithme Néperien |SIN[arg] | Sinus |SQRT[arg] | Racine carrée |TAN[arg] | Tangente |EXISTS[arg] | Vérifie l'existence d'un paramètre nommé |========================================

source: The 'FIX' function rounds towards the left (less positive or more negative) on a number line, so that 'FIX[2.8] =2' and 'FIX[-2.8] = -3', for example. The 'FUP' operation rounds towards the right (more positive or less negative) on a number line; 'FUP[2.8] = 3' and 'FUP[-2.8] = -2', for example.
fr: La fonction 'FIX' arrondi un nombre vers la gauche, (moins positif ou plus négatif) par exemple, 'FIX[2.8]=2' et 'FIX[-2.8]=-3'. La fonction 'FUP' à l'inverse, arrondi un nombre vers la droite (plus positif ou moins négatif) par exemple, 'FUP[2.8]=3' et 'FUP[-2.8]=-2'.

source: [[EXISTS-Function]]The `EXISTS` function checks for the existence of a single named parameter. It takes only one named parameter and returns 1 if it exists and 0 if it does not exist. It is an error if you use a numbered parameter or an expression. Here is an example for the usage of the EXISTS function:
fr: [[Fonction-EXISTS]]La fonction 'EXISTS' vérifie l'existence d'un simple paramètre nommé. Elle reçoit le paramètre à vérifier en argument, elle retourne 1 si celui-ci existe et 0 sinon. C'est une erreur si un paramètre numéroté ou une expression est utilisé. Voici un exemple de l'utilisation de la fonction EXISTS:

source: o<test> sub o10 if [EXISTS[#<_global>]] (debug, _global exists and has the value #<_global>) o10 else (debug, _global does not exist) o10 endif o<test> endsub
fr: o<test> sub o10 if [EXISTS[#<_global>]] (debug, _global existe et a la valeur #<_global>) o10 else (debug, _global n'existe pas) o10 endifo <test> endsub

source: == Repeated Items
fr: == Répétitions d'items

source: A line may have any number of G words, but two G words from the same modal group may not appear on the same line See the <<sec:Modal-Groups,Modal Groups>> Section for more information.
fr: Une ligne peut contenir autant de mots G que voulu, mais un seul du même <<sec:Groupes-modaux, groupe modal>>.

source: A line may have zero to four M words. Two M words from the same modal group may not appear on the same line.
fr: Une ligne peut avoir de zéro à quatre mots M. Mais pas deux mots M du même groupe modal.

source: For all other legal letters, a line may have only one word beginning with that letter.
fr: Pour toutes les autres lettres autorisées, un seul mot commençant par cette lettre peut se trouver sur la même ligne.

source: If a parameter setting of the same parameter is repeated on a line, '#3=15 #3=6', for example, only the last setting will take effect. It is silly, but not illegal, to set the same parameter twice on the same line.
fr: Si plusieurs valeurs de paramètre se répètent sur la même ligne, par exemple: '#3=15 #3=6', seule la dernière valeur prendra effet. Il est absurde, mais pas illégal, de fixer le même paramètre deux fois sur la même ligne.

source: If more than one comment appears on a line, only the last one will be used; each of the other comments will be read and its format will be checked, but it will be ignored thereafter. It is expected that putting more than one comment on a line will be very rare.
fr: Si plus d'un commentaire apparaît sur la même ligne, seul le dernier sera utilisé, chacun des autres sera lu et son format vérifié, mais il sera ignoré. Placer plusieurs commentaires sur la même ligne est très rare.

source: == Item order
fr: == Ordre des éléments

source: The three types of item whose order may vary on a line (as given at the beginning of this section) are word, parameter setting, and comment. Imagine that these three types of item are divided into three groups by type.
fr: Les trois types d'éléments dont l'ordre peut varier sur une ligne (comme indiqué au début de cette section) sont les mots, les valeurs de paramètres et les commentaires. Imaginez que ces trois types d'éléments sont divisés en trois groupes selon leur type.

source: The first group (the words) may be reordered in any way without changing the meaning of the line.
fr: Dans le premier groupe les mots, peuvent être réarrangés dans n'importe quel ordre sans changer la signification de la ligne.

source: If the second group (the parameter settings) is reordered, there will be no change in the meaning of the line unless the same parameter is set more than once. In this case, only the last setting of the parameter will take effect. For example, after the line '#3=15 #3=6' has been interpreted, the value of parameter 3 will be 6. If the order is reversed to '#3=6 #3=15' and the line is interpreted, the value of parameter 3 will be 15.
fr: Dans le second groupe les valeurs de paramètre, quelque soit leur arrangement, il n'y aura pas de changement dans la signification de la ligne sauf si le même paramètre est présent plusieurs fois. Dans ce cas, seule la dernière valeur prendra effet. Par exemple, quand la ligne '#3=15 #3=6' aura été interprétée, la valeur du paramètre 3 vaudra 6. Si l'ordre est inversé, '#3=6 #3=15' après interprétation, la valeur du paramètre 3 vaudra 15.

source: If the third group (the comments) contains more than one comment and is reordered, only the last comment will be used.
fr: Enfin dans le troisième groupe, les commentaires, si plusieurs commentaires sont présents sur une ligne, seul le dernier commentaire sera utilisé.

source: If each group is kept in order or reordered without changing the meaning of the line, then the three groups may be interleaved in any way without changing the meaning of the line. For example, the line 'g40 g1 #3=15 (foo) #4=-7.0' has five items and means exactly the same thing in any of the 120 possible orders (such as '#4=-7.0 g1 #3=15 g40 (foo)') for the five items.
fr: Si chaque groupe est laissé, ou réordonné, dans l'ordre recommandé, la signification de la ligne ne changera pas, alors les trois groupes peuvent être entrecroisés n'importe comment sans changer la signification de la ligne. Par exemple, la ligne 'g40 g1 #3=15 (foo) #4=-7.0' à cinq items est signifiera exactement la même chose dans les 120 ordres d'arrangement possibles des cinq items comme '#4=-7.0 g1 #3=15 g40 (foo)'.

source: == Commands and Machine Modes
fr: == Commandes et modes machine

source: Many commands cause the controller to change from one mode to another, and the mode stays active until some other command changes it implicitly or explicitly. Such commands are called 'modal'. For example, if coolant is turned on, it stays on until it is explicitly turned off. The G codes for motion are also modal. If a G1 (straight move) command is given on one line, for example, it will be executed again on the next line if one or more axis words is available on the line, unless an explicit command is given on that next line using the axis words or canceling motion.
fr: En G-code, de nombreuses commandes produisent, d'un mode à un autre, quelque chose de différent au niveau de la machine, le mode reste actif jusqu'à ce qu'une autre commande ne le révoque, implicitement ou explicitement. Ces commandes sont appelées 'modales'. Par exemple, si l'arrosage est mis en marche, il y reste jusqu'à ce qu'il soit explicitement arrêté. Les G-codes pour les mouvements sont également modaux. Si, par exemple, une commande G1 (déplacement linéaire) se trouve sur une ligne, elle peut être utilisée sur la ligne suivante avec seulement un mot d'axe, tant qu'une commande explicite est donnée sur la ligne suivante en utilisant des axes ou un arrêt de mouvement.

source: 'Non-modal' codes have effect only on the lines on which they occur. For example, G4 (dwell) is non-modal.
fr: Les codes 'non modaux' n'ont d'effet que sur la ligne ou ils se présentent. G4 (tempo) est non modal.

source: == Polar Coordinates (((Polar Coordinates)))
fr: == Coordonnées polaires (((coordonnées polaires)))

source: Polar Coordinates can be used to specify the XY coordinate of a move. The @n is the distance and ^n is the angle. The advantage of this is for things like bolt hole circles which can be done very simply by moving to a point in the center of the circle, setting the offset and then moving out to the first hole then run the drill cycle. Polar Coordinates always are from the current XY zero position. To shift the Polar Coordinates from machine zero use an offset or select a coordinate system.
fr: Des coordonnées polaires peuvent être utilisées pour spécifier les coordonnées 'XY' d'un mouvement. Le signe @n donne la distance et le ^n donne l'angle. C'est avantageux pour les cercles de trous tangents qui peuvent alors être réalisés très simplement en donnant un point situé au centre du cercle, régler la compensation de rayon d'outil, déplacer l'outil vers le premier trou et lancer le cycle de perçage. Les coordonnées polaires partent toujours avec le zéro à la position courante. Pour décaler les coordonnées polaires depuis le zéro machine, utiliser le décalage pièce ou choisir le système de coordonnées machine.

source: In Absolute Mode the distance and angle is from the XY zero position and the angle starts with 0 on the X Positive axis and increases in a CCW direction about the Z axis. The code G1 @1^90 is the same as G1 Y1.
fr: En mode absolu, la distance est donnée à partir de la position 'X0, Y0' et l'angle commence à '0' sur l'axe X positif et augmente dans la direction trigonométrique (anti-horaire) autour de l'axe Z. Le code 'G1 @1 ^90' fait la même chose que 'G1 Y1'.

source: In Relative Mode the distance and angle is also from the XY zero position but it is cumulative. This can be confusing at first how this works in incremental mode.
fr: En mode relatif, la distance et l'angle sont également donnés à partir de la position 'XY zéro', mais ils sont cumulatifs. Ce fonctionnement en mode incrémental peut être déroutant au début.

source: For example if you have the following program you might expect it to be a square pattern.
fr: Par exemple: avec le programme suivant, vous vous attendez à obtenir une trajectoire carré.

source: You can see from the following figure that the output is not what you might expect. Because we added 0.5 to the distance each time the distance from the XY zero position increased with each line.
fr: Vous pouvez voir sur la figure suivante que la sortie n'est pas celle à laquelle vous vous attendiez, parce-que avons ajouté 0.5 à la distance de la position XY zéro à chaque début de ligne.

source: .Polar Spiral[[fig:Polar-Spiral]]
fr: .Spirale polaire[[fig:Spirale-polaire]]

source: image::images/polar01.png[align="center"]
fr: image::images/polar01.png[]

source: The following code will produce our square pattern.
fr: Le code suivant va produire notre modèle carré.

source: As you can see by only adding to the angle by 90 degrees each time the end point distance is the same for each line.
fr: Comme vous pouvez le voir, en ajoutant seulement l'angle de 90 degrés à chaque ligne. La distance du point final est la même pour chaque ligne.

source: .Polar Square[[fig:Polar-Square]]
fr: .Carré polaire[[fig:Carre-polaire]]

source: image::images/polar02.png[align="center"]
fr: image::images/polar02.png[]

source: It is an error if:
fr: C'est une erreur si:

source: An incremental move is started at the origin
fr: Un mouvement incrémental est lancé à l'origine.

source: A mix of Polar and and X or Y words are used
fr: Un mélange de mots polaires et de mots X ou Y est utilisé.

source: [[sec:Modal-Groups]] == Modal Groups (((Modal Groups)))
fr: == Groupes modaux[[sec:Groupes-modaux]]

source: Modal commands are arranged in sets called 'modal groups', and only one member of a modal group may be in force at any given time. In general, a modal group contains commands for which it is logically impossible for two members to be in effect at the same time - like measure in inches vs. measure in millimeters. A machining center may be in many modes at the same time, with one mode from each modal group being in effect. The modal groups are shown in the following Table.
fr: Les commandes modales sont arrangées par lots appelés 'groupes modaux', à tout moment, un seul membre d'un groupe modal peut être actif. En général, un groupe modal contient des commandes pour lesquelles il est logiquement impossible que deux membres soient actifs simultanément, comme les unités en pouces et les unités en millimètres. Un centre d'usinage peut être dans plusieurs modes simultanément, si un seul mode pour chaque groupe est actif. Les groupes modaux sont visibles dans le tableau <<tbl:G-codes-modaux, ci-dessous>>.

source: .G-Code Modal Groups[[cap:Modal-Groups]]
fr: .Groupes modaux des G-codes[[tbl:G-codes-modaux]]

source: [width="100%", cols="4,6", options="header"] |======================================== |Modal Group Meaning | Member Words |Non-modal codes (Group 0) | G4, G10 G28, G30, G53 G92, G92.1, G92.2, G92.3, .2+|Motion (Group 1) | G0, G1, G2, G3, G33, G38.x, G73, G76, G80, G81 | G82, G83, G84, G85, G86, G87, G88, G89 |Plane selection (Group 2) | G17, G18, G19, G17.1, G18.1, G19.1 |Distance Mode (Group 3) | G90, G91 |Arc IJK Distance Mode (Group 4) | G90.1, G91.1 |Feed Rate Mode (Group 5) | G93, G94, G95 |Units (Group 6) | G20, G21 |Cutter Diameter Compensation (Group 7)| G40, G41, G42, G41.1, G42.1 |Tool Length Offset (Group 8) | G43, G43.1, G49 |Canned Cycles Return Mode (Group 10) | G98, G99 |Coordinate System (Group 12) | G54, G55, G56, G57, G58, G59, G59.1, G59.2, G59.3 |Control Mode (Group 13) | G61, G61.1, G64 |Spindle Speed Mode (Group 14) | G96, G97 |Lathe Diameter Mode (Group 15) | G7, G8 |========================================
fr: [width="100%", cols="4,6", options="header"] |========================================================== |Signification du groupe modal | Mots G |Codes non modaux ('Groupe 0')| G4, G10, G28, G30, G53, G92, G92.1, G92.2, G92.3 .2+|Mouvements ('Groupe 1') | G0, G1, G2, G3, G33, G38.x, G73, G80, G81, | G82, G83, G84, G85, G86, G87, G88, G89 |Choix du plan de travail ('Groupe 2')| G17, G18, G19, G17.1, G18.1, G19.1 |Mode déplacement ('Groupe 3') | G90, G91 |Mode déplacement en arc IJK ('Groupe 4') |G90.1, G91.1 |Mode de vitesses ('Groupe 5') | G93, G94, G95 |Unités machine ('Groupe 6') | G20, G21 |Compensation de rayon d'outil ('Groupe 7')| G40, G41, G42, G41.1, G42.1 |Compensation de longueur d'outil ('Groupe 8')| G43, G43.1, G49 |Plan de retrait cycle de perçage ('Groupe 10')| G98, G99 |Systèmes de coordonnées ('Groupe 12')| G54, G55, G56, G57, G58, G59, G59.1, G59.2, G59.3 |Mode contrôle de trajectoire ('Groupe 13') |G61, G61.1, G64 |Mode contrôle vitesse broche ('Groupe 14') | G96, G97 |Mode diamètre/rayon sur les tours ('Groupe 15') | G7, G8 |==========================================================

source: .M-Code Modal Groups[[tbl:m-modal-groups]]
fr: .Groupes modaux des M-codes[[tbl:M-codes-modaux]]
