Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/overview.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = G Code Overview
fr: = Vue générale du langage G-codes de LinuxCNC

source: [[cha:g-code-overview]] (((G Code Overview)))
fr: [[cha:Vue-generale-G-code]] (((Vue générale du G-code de LinuxCNC)))

source: == Overview
fr: == Brève description du G-code de LinuxCNC

source: The LinuxCNC G Code language is based on the RS274/NGC language. The G Code language is based on lines of code. Each line (also called a 'block') may include commands to do several different things. Lines of code may be collected in a file to make a program.
fr: Le G-code utilisé par LinuxCNC est basé sur le langage RS274/NGC. Le langage G-code est basé sur des lignes de code. Chaque ligne (également appelée un 'bloc') peut inclure des commandes pour faire produire diverses actions à la machine. Plusieurs lignes de code peuvent être regroupées dans un fichier pour créer un programme G-code.

source: A typical line of code consists of an optional line number at the beginning followed by one or more 'words'. A word consists of a letter followed by a number (or something that evaluates to a number). A word may either give a command or provide an argument to a command. For example, 'G1 X3' is a valid line of code with two words. 'G1' is a command meaning 'move in a straight line at the programmed feed rate to the programmed end point', and 'X3' provides an argument value (the value of X should be 3 at the end of the move). Most LinuxCNC G Code commands start with either G or M (for General and Miscellaneous). The words for these commands are called 'G codes' and 'M codes.'
fr: Une ligne de code commence par un numéro de ligne optionnel, suivi par un ou plusieurs 'mots'. Un mot commence par une lettre suivie d'un nombre (ou quelque chose qui permet d'évaluer un nombre). Un mot peut, soit donner une commande, soit fournir un argument à une commande. Par exemple, 'G1 X3' est une ligne de code valide avec deux mots. 'G1' est une commande qui signifie 'déplaces toi en ligne droite à la vitesse programmée' et 'X3' fournit la valeur d'argument (la valeur de X doit être 3 à la fin du mouvement). La plupart des commandes G-code commencent avec une lettre G ou M (G pour Général et M pour Miscellaneous (auxiliaire)). Les termes pour ces commandes sont 'G-codes' et 'M-codes.'

source: The LinuxCNC language has no indicator for the start of a program. The Interpreter, however, deals with files. A single program may be in a single file, or a program may be spread across several files. A file may demarcated with percents in the following way. The first non-blank line of a file may contain nothing but a percent sign, '%', possibly surrounded by white space, and later in the file (normally at the end of the file) there may be a similar line. Demarcating a file with percents is optional if the file has an 'M2' or 'M30' in it, but is required if not. An error will be signaled if a file has a percent line at the beginning but not at the end. The useful contents of a file demarcated by percents stop after the second percent line. Anything after that is ignored.
fr: Le langage de LinuxCNC n'a pas d'indicateur de début de programme. L'interpréteur cependant traite les fichiers. Un programme simple peut être en un seul fichier, mais il peut aussi être partagé sur plusieurs fichiers. Un fichier peut être délimité par le signe pour-cent de la manière suivante. La première ligne non vide d'un fichier peut contenir un signe '%' seul, éventuellement encadré d'espaces blancs, ensuite, à la fin du fichier on doit trouver une ligne similaire. Délimiter un fichier avec des % est facultatif si le fichier comporte un 'M2' ou un 'M30', mais est requis sinon. Une erreur sera signalée si un fichier a une ligne pour-cent au début, mais pas à la fin. Le contenu utile d'un fichier délimité par % s'arrête après la seconde ligne %. Tout le reste est ignoré.

source: The LinuxCNC G Code language has two commands ('M2' or 'M30'), either of which ends a program. A program may end before the end of a file. Lines of a file that occur after the end of a program are not to be executed. The interpreter does not even read them.
fr: Le langage G-code de LinuxCNC prévoit les deux commandes ('M2' ou 'M30') pour finir un programme. Le programme peut se terminer avant la fin du fichier. Les lignes placées après la fin d'un programme ne seront pas exécutées. L'interpréteur ne les lit même pas.

source: == Format of a line
fr: == Format d'une ligne

source: A permissible line of input code consists of the following, in order, with the restriction that there is a maximum (currently 256) to the number of characters allowed on a line.
fr: Une ligne de G-code typique est construite de la façon suivante, dans l'ordre avec la restriction à un maximum de 256 caractères sur la même ligne.

source: . an optional block delete character, which is a slash '/'. . an optional line number. . any number of words, parameter settings, and comments. . an end of line marker (carriage return or line feed or both).
fr: . Un caractère optionnel d'effacement de bloc, qui est la barre oblique '/'. . Un numéro de ligne optionnel. . Un nombre quelconque de mots, valeurs de paramètres et commentaires. . Un caractère de fin de ligne (retour chariot ou saut de ligne ou les deux).

source: Any input not explicitly allowed is illegal and will cause the Interpreter to signal an error.
fr: Toute entrée non explicitement permise est illégale, elle provoquera un message d'erreur de l'interpréteur.

source: Spaces and tabs are allowed anywhere on a line of code and do not change the meaning of the line, except inside comments. This makes some strange-looking input legal. The line 'G0X +0. 12 34Y 7' is equivalent to 'G0 x+0.1234 Y7', for example.
fr: Les espaces sont permis ainsi que les tabulations dans une ligne de code dont ils ne changent pas la signification, excepté dans les commentaires. Ceci peut donner d'étranges lignes, mais elles sont autorisées. La ligne 'G0X +0. 12 34Y 7' est équivalente à 'G0 X+0.1234 Y7', par exemple.

source: Blank lines are allowed in the input. They are to be ignored.
fr: Les lignes vides sont permises, elles seront ignorées.

source: Input is case insensitive, except in comments, i.e., any letter outside a comment may be in upper or lower case without changing the meaning of a line.
fr: La casse des caractères est sans importance, excepté dans les commentaires. Toutes les lettres en dehors des commentaires peuvent donc être, indifféremment des majuscules ou des minuscules sans changer la signification de la ligne.

source: == Block Delete [[sub:block-delete]] (((Block Delete)))
fr: == Saut de bloc[[sec:effacement-de-bloc]] (((Block Delete)))

source: The optional block delete character the slash '/' when placed first on a line can be used by some user interfaces to skip lines of code when needed. In Axis the key combination Alt-m-/ toggles block delete on and off. When block delete is on any lines starting with the slash '/' are skipped.
fr: Le caractère optionnel de saut de bloc est la barre oblique '/', quand il est placé en premier sur une ligne, il peut être utilisé par certaines interfaces utilisateur pour sauter, si besoin, des lignes de code. Dans Axis, la combinaison de touches 'Alt-m-/' est une bascule qui active ou désactive le saut de bloc. Quand le saut de bloc est actif, toutes les lignes commençant par '/' sont sautées.

source: == Line Number (((Line Number)))
fr: == Numéro de ligne (((Numéro de ligne)))

source: A line number is the letter N followed by an unsigned integer, optionally followed by a period and another unsigned integer. For example, `N1234` and `N56.78` are valid line numbers. They may be repeated or used out of order, although normal practice is to avoid such usage. Line numbers may also be skipped, and that is normal practice. A line number is not required to be used, but must be in the proper place if used.
fr: Un numéro de ligne commence par la lettre N suivie, généralement d'un nombre entier non signé, mais un entier suivi d'un point puis d'un autre entier est une forme admise. Par exemple, 'N1234' et 'N56.78' sont des N° de ligne valides. Les numéros de ligne peuvent se suivre, être répétés ou être dans le désordre, bien qu'une pratique normale évite ce genre d'usage. Les numéros de ligne peuvent être sautés, c'est une pratique normale. L'utilisation d'un numéro de ligne n'est pas obligatoire mais, si ils sont utilisés, il doivent être placés en début de ligne.

source: == Word (((Word)))
fr: == Les mots (((mots)))

source: A word is a letter other than N followed by a real value.
fr: Un mot est une lettre, autre que N, suivie d'un nombre réel.

source: Words may begin with any of the letters shown in the following Table. The table includes N for completeness, even though, as defined above, line numbers are not words. Several letters (I, J, K, L, P, R) may have different meanings in different contexts. Letters which refer to axis names are not valid on a machine which does not have the corresponding axis.
fr: Les mots peuvent commencer avec l'une ou l'autre des lettres indiquées dans le tableau ci-dessous. Ce tableau inclus N pour être complet, même si, comme défini précédemment, les numéros de lignes ne sont pas des mots. Plusieurs lettres (I, J, K, L, P, R) peuvent avoir différentes significations dans des contextes différents. Les lettres qui se réfèrent aux noms d'axes ne sont pas valides sur une machine n'ayant pas les axes correspondants.

source: .Words and their meanings[[cap:Words-and-their]]
fr: .Les mots et leur signification[[sec:Les-mots-et-leur-significations]]

source: [width="75%", options="header", cols="^1,<5"] |======================================== |Letter | Meaning |A | A axis of machine |B | B axis of machine |C | C axis of machine |D | Tool radius compensation number |F | Feed rate |G | General function (See table <<cap:Modal-Groups,Modal Groups>>) |H | Tool length offset index |I | X offset for arcs and G87 canned cycles |J | Y offset for arcs and G87 canned cycles .2+|K | Z offset for arcs and G87 canned cycles. <| Spindle-Motion Ratio for G33 synchronized movements. |L | generic parameter word for G10, M66 and others |M | Miscellaneous function (See table <<cap:Modal-Groups,Modal Groups>>) |N | Line number .2+|P | Dwell time in canned cycles and with G4. <| Key used with G10. |Q | Feed increment in G73, G83 canned cycles |R | Arc radius or canned cycle plane |S | Spindle speed |T | Tool selection |U | U axis of machine |V | V axis of machine |W | W axis of machine |X | X axis of machine |Y | Y axis of machine |Z | Z axis of machine |========================================
fr: [width="100%", options="header",align="left"] |======================================== |Lettre | Signification |A | Axe A de la machine |B | Axe B de la machine |C | Axe C de la machine |D | Valeur de la compensation de rayon d'outil |F | Vitesse d'avance travail |G | Fonction Générale (voir la table des codes modaux) |H | Index d'offset de longueur d'outil |I | Décalage en X pour les arcs et dans les cycles préprogrammés G87 |J | Décalage en Y pour les arcs et dans les cycles préprogrammés G87 .2+|K | Décalage en Z pour les arcs et dans les cycles préprogrammés G87 <| Distance de déplacement par tour de broche avec G33 |L | Paramètre générique pour pour G10, M66 et autres |M | Fonction auxiliaire (voir la table des codes modaux) |N | Numéro de ligne .2+|P | Temporisation utilisée dans les cycles de perçage et avec G4. <| Mot clé utilisé avec G10. |Q | Incrément Delta en Z dans un cycle G73, G83 |R | Rayon d'arc ou plan de retrait dans un cycle préprogrammé |S | Vitesse de rotation de la broche |T | Numéro d'outil |U | Axe U de la machine |V | Axe V de la machine |W | Axe W de la machine |X | Axe X de la machine |Y | Axe Y de la machine |Z | Axe Z de la machine |========================================

source: [[sub:Number]] == Number
fr: == Les nombres[[sec:Nombres]]

source: The following rules are used for (explicit) numbers. In these rules a digit is a single character between 0 and 9.
fr: Les règles suivantes sont employées pour des nombres (explicites). Dans ces règles un chiffre est un caractère simple compris entre 0 et 9.

source: * A number consists of (1) an optional plus or minus sign, followed by (2) zero to many digits, followed, possibly, by (3) one decimal point, followed by (4) zero to many digits - provided that there is at least one digit somewhere in the number. * There are two kinds of numbers: integers and decimals. An integer does not have a decimal point in it; a decimal does. * Numbers may have any number of digits, subject to the limitation on line length. Only about seventeen significant figures will be retained, however (enough for all known applications). * A non-zero number with no sign as the first character is assumed to be positive.
fr: * Un nombre commence par (1) un signe optionnel plus ou moins, suivi de (2) zéro à plusieurs chiffres, pouvant être suivis par (3) un point décimal, suivi de (4) zéro à plusieurs chiffres - à condition qu'il y ait au moins un chiffre quelque part dans le nombre. * Il existe deux types de nombres: Les entiers et les décimaux, les entiers n'ont pas de point décimal, les décimaux en ont un. * Les nombres peuvent avoir n'importe combien de chiffres, sous réserve de la limitation de longueur d'une ligne. Seulement dix-sept chiffres significatifs seront retenus, c'est toutefois suffisant pour toutes les applications connues. * Un nombre non nul sans signe comme premier caractère est considéré être positif.

source: Notice that initial (before the decimal point and the first non-zero digit) and trailing (after the decimal point and the last non-zero digit) zeros are allowed but not required. A number written with initial or trailing zeros will have the same value when it is read as if the extra zeros were not there.
fr: Noter que les zéros non significatifs, devant ou derrière le point décimal d'un nombre, sont permis mais non requis. Lors de sa lecture, la valeur d'un nombre sera la même, qu'il comporte ou non des zéros non significatifs.

source: Numbers used for specific purposes in RS274/NGC are often restricted to some finite set of values or some to some range of values. In many uses, decimal numbers must be close to integers; this includes the values of indexes (for parameters and carousel slot numbers, for example), M codes, and G codes multiplied by ten. A decimal number which is supposed be close to an integer is considered close enough if it is within 0.0001 of an integer.
fr: Les nombres utilisés à des fins spécifiques en RS274/NGC sont souvent limités à un ensemble fini de valeurs ou d'une certaine plage de valeurs. Dans de nombreux cas, les nombres décimaux doivent être proches d'un nombre entier, cela comprend les valeurs d'index (pour les paramètres et les numéros de poche d'un carrousel, par exemple). Résultant d'une opération arithmétique, comme des M-codes ou des G-codes multipliés par dix. Un nombre décimal devant être proche d'un entier est considéré comme suffisamment proche si il est à 0,0001 d'un entier.

source: [[sec:parameters]] == Parameters (((Parameters)))
fr: == Paramètres[[sec:parametres]]

source: The RS274/NGC language supports 'parameters' - what in other programming languages would be called 'variables'. There are several types of parameter of different purpose and appearance, each described in the following sections. The only value type supported by parameters is floating-point; there are no string, boolean or integer types in G-code like in other programming languages. However, logic expressions can be formulated with <<sec:Binary-Operators,boolean operators>> ( 'AND', 'OR', 'XOR', and the comparison operators 'EQ','NE','GT','GE','LT','LE'), and the 'MOD', 'ROUND', 'FUP' and 'FIX' <<cap:Functions,operators>> support integer arithmetic.
fr: Le langage RS274/NGC supporte les 'paramètres', qui sont appelés 'variables' dans d'autres langages de programmation. Il existe plusieurs types de paramètres ayant différents usages et différentes formes. Le seul type de nombre supporté par les paramètres est le flottant, il n'y a pas de string, pas de boolean ni d'entier dans le G-code comme dans d'autres langages de programmation. Toutefois, les expressions logiques peuvent être formulées avec <<sec:Operateurs-Binaires,les opérateurs booléens>> ('AND', 'OR', 'XOR' et les opérateurs de comparaison 'EQ', 'NE', 'GT', 'GE', 'LT', 'LE') ainsi que 'MOD', 'ROUND', 'FUP', 'FIX' et <<sec:Fonctions, les opérateurs>> qui supportent l'arithmétique entière.

source: Parameters differ in syntax, scope, behavior when not yet initialized, mode, persistence and intended use.
fr: Les paramètres différent par leur syntaxe, leur portée, leur comportement quand ils ne sont pas encore initialisés, leur mode, leur persistance et l'usage pour lequel ils sont prévus.

source: Syntax:: There are three kinds of syntactic appearance: * 'numbered' - #4711 * 'named local' - #<localvalue> * 'named global' - #<_globalvalue>
fr: Syntaxes:: Il y a trois sortes d'apparences syntaxiques: * 'numéroté' - #4711 * 'nommé local' - #<valeurlocale> * 'nommé global' - #<_valeurglobale>

source: Scope:: The scope of a parameter is either global, or local within a subroutine. Subroutine parameters and local named variables have local scope. Global named parameters and numbered parameters starting from number 31 are global in scope. RS274/NGC uses 'lexical scoping' - in a subroutine only the local variables defined therein, and any global variables are visible. The local variables of a calling procedure are not visible in a called procedure.
fr: La portée:: La portée d'un paramètre est soit globale, soit locale à l'intérieur d'un sous-programme. Les paramètres de sous-programme et les paramètres nommés ont une portée locale. Les paramètres nommés globaux et les paramètres numérotés commencent par un nombre, exemple: 31 a une portée globale. RS274/NGC utilise une 'portée lexicale', dans un sous-programme, seules sont locales les variables qui y sont définies et toutes les variables globales y sont visibles. Les variables locales à un appel de procédure, ne sont pas visibles dans la procédure appelée.

source: Behavior of uninitialized parameters:: . unitialized global parameters, and unused subroutine parameters return the value zero when used in an expression. . unitialized named parameters signal an error when used in an expression.
fr: Le comportement des paramètres non encore initialisés:: . Les paramètres globaux non initialisés et les paramètres de sous-programmes inutilisés, retournent la valeur zéro quand ils sont utilisés dans une expression. . Les paramètres nommés signalent une erreur quand ils sont utilisés dans une expression.

source: Mode:: Most parameters are read/write and may be assigned to within an assignment statement. However, for many predefined parameters this does not make sense, so they are are read-only - they may appear in expressions, but not on the left-hand side of an assignment statement.
fr: Le mode:: La plupart des paramètres sont en lecture/écriture et peuvent être assignés dans une instruction d'affectation. Cependant, pour beaucoup de paramètres prédéfinis, cela n'a pas de sens, ils sont alors en lecture seule. Ils peuvent apparaître dans les expressions, mais pas sur le côté gauche d'une instruction d'affectation.

source: Persistence:: When LinuxCNC is shut down, volatile parameters lose their values. All parameters except numbered parameters in the current persistent range footnoteref:[persistent_range,The range of persistent parameters may change as development progresses. This range is currently 5161- 5390. It is defined in the '_required_parameters array' in file the src/emc/rs274ngc/interp_array.cc .] are volatile. Persistent parameters are saved in the .var file and restored to their previous values when LinuxCNC is started again. Volatile numbered parameters are reset to zero.
fr: La persistance:: Quand LinuxCNC s'arrête, les paramètres volatiles perdent leurs valeurs. Tous les paramètres sont volatiles, excepté les paramètres numérotés dans l'étendue courante de persistance footnote:[L'étendue de persistance courante des paramètres évolue en même temps qu'évolue le développement. Cette étendue est actuellement de 5161 à 5390. Elle est définie par '_required_parameters array' dans le fichier src/linuxcnc/rs274ngc/interp_array.cc .]. Les paramètres persistants sont enregistrés dans un fichier '.var' et restaurés à leurs valeurs précédentes quand LinuxCNC est relancé. Les paramètres numérotés volatiles sont remis à zéro.

source: Intended Use:: . user parameters:: numbered parameters in the range 31..5000, and named global and local parameters except predefined parameters. These are available for general-purpose storage of floating-point values, like intermediate results, flags etc, throughout program execution. They are read/write (can be assigned a value). . <<sub:subroutine-parameters,subroutine parameters>> - these are used to hold the actual parameters passed to a subroutine. . <<sub:numbered-parameters,numbered parameters>> - most of these are used to access offsets of coordinate systems. . <<sub:system-parameters,system parameters>> - used to determine the current running version. They are read-only.
fr: Utilisation prévue:: . Paramètres utilisateur:: paramètres numérotés dans l'étendue 31 à 5000, paramètres nommés globaux et locaux excepté les paramètres prédéfinis. Sont disponibles pour une utilisation générale de stockage de valeurs flottantes, comme des résultats intermédiaires, des drapeaux, etc. durant l'exécution d'un programme. Ils sont en lecture/écriture (une valeur peut leur être attribuée). . <<sec:Parametres-sous-programme, Paramètres de sous-programme>> - Ils sont utilisés pour conserver les paramètres actuels passés à un sous-programme. . <<sec:Parametres-Numerotes,paramètres numérotés>> - la plupart de ces paramètres sont utilisés pour accéder aux offsets des systèmes de coordonnées. . <<sec:Predefined-Named-Parameters, paramètres nommés prédéfinis>> - utilisés pour déterminer l'état de l'interpréteur et de la machine, par exemple '#<_relative>' retourne 1 si G91 est actif et 0 si G90 est activé. Ils sont en lecture seule.

source: === Numbered Parameters[[sub:numbered-parameters]]
fr: === Les paramètres numérotés[[sec:Parametres-Numerotes]]

source: A numbered parameter is the pound character '#' followed by an integer between 1 and (currently) 5602 footnote:[The RS274/NGC interpreter maintains an array of numbered parameters. Its size is defined by the symbol `RS274NGC_MAX_PARAMETERS` in the file src/emc/rs274ngc/interp_internal.hh). This number of numerical parameters may also increase as development adds support for new parameters. ]. The parameter is referred to by this integer, and its value is whatever number is stored in the parameter.
fr: Un paramètre numéroté commence par le caractère '#' suivi par un entier compris entre 1 et (actuellement) 5602. Le paramètre est référencé par cet entier, sa valeur est celle stockée dans le paramètre.

source: A value is stored in a parameter with the = operator; for example: ----
fr: Une valeur est stockée dans un paramètre avec l'opérateur = par exemple: ----

source: #3 = 15 (set parameter 3 to 15) ----
fr: #3 = 15 (la valeur 15 est stockée dans le paramètre numéro 3) ----
