Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/rs274ngc.*.po
Languages: fr

source: :lang en
fr: :lang: fr

source: = RS274/NGC Differences
fr: = Différences avec RS274/NGC

source: [[cha:rs274ngc-programs]] (((RS274/NGC Programs)))
fr: [[cha:Programmation-rs274ngc]] (((Programmation RS274/NGC)))

source: == Changes from RS274/NGC
fr: == Changements entre RS274/NGC et LinuxCNC

source: .Differences that change the meaning of RS274/NGC programs
fr: .Différences qui changent le déroulement des programmes de RS274/NGC

source: Location after a tool change::
fr: Position après un changement d'outil::

source: In LinuxCNC, the machine does not return to its original position after a tool change. This change was made because the new tool might be longer than the old tool, and the move to the original machine position could therefore leave the tool tip too low.
fr: Avec LinuxCNC, le mobile ne retourne pas sur la position de départ après un changement d'outil. Ce mode de fonctionnement est nécessaire, car un outil peut être plus long que l'outil précédent et dans ce cas un mouvement sur la position précédente placerait l'outil trop bas.

source: Offset parameters are ini file units::
fr: Les paramètres de décalage sont dans l'unité du fichier ini::

source: In LinuxCNC, the values stored in parameters for the G28 and G30 home locations, the P1...P9 coordinate systems, and the G92 offset are in "ini file units". This change was made because otherwise the meaning of a location changed depending on whether G20 or G21 was active when G28, G30, G10 L2, or G92.3 is programmed.
fr: Dans LinuxCNC, les valeurs mémorisées dans les paramètres pour les positions d'origine des commandes G28 et G30, les systèmes de coordonnées P1 à P9 et le décalage G92 sont dans l'unité du fichier ini. Ce changement a été fait car la position d'un point change selon que G20 ou G21 était actif lors de la programmation d'un G28, G30, G10 L2 ou G92.3.

source: Tool table lengths/diameters are in ini file units::
fr: Table d'outils, longueur et diamètre sont dans l'unité du fichier ini::

source: In LinuxCNC, the tool lengths (offsets) and diameters in the tool table are specified in ini file units only. This change was made because otherwise the length of a tool and its diameter would change based on whether G20 or G21 was active when initiating G43, G41, G42 modes. This made it impossible to run G code in the machine's non-native units, even when the G code was simple and well-formed (starting with G20 or G21, and didn't change units throughout the program), without changing the tool table.
fr: Dans LinuxCNC, les longueurs d'outil (compensation) et les diamètres sont spécifiés seulement dans l'unité du fichier ini. Cela est nécessaire, car la longueur et le diamètre de l'outil changent selon que G20 ou G21 étaient actifs à l'initialisation des modes G43, G41, G42. Il était donc impossible de lancer un G-code avec des unités machines non natives, ceci même lorsque le G-code est simple et bien formé (débutant par G20 ou G21 et sans changement d'unité tout au long du programme) sans changer la table d'outils.

source: G84, G87 not implemented::
fr: G84, G87 ne sont pas implémentés::

source: G84 and G87 are not currently implemented, but may be added to a future release of LinuxCNC.
fr: G84 et G87 ne sont pour le moment pas implémentés. Ils le seront dans une version futur de LinuxCNC.

source: G28, G30 with axis words::
fr: G28, G30 avec des mots d'axe::

source: When G28 or G30 is programmed with only some axis words present, LinuxCNC only moves the named axes. This is common on other machine controls. To move some axes to an intermediate point and then move all axes to the predefined point, write two lines of G code: + G0 X- Y- (axes to move to intermediate point) G28 (move all axes to predefined point)
fr: Lorsqu'un G28 ou un G30 est programmé avec seulement quelques mots d'axe présents, LinuxCNC déplace seulement les axes nommés. Ce comportement est commun aux contrôleurs de machine. Pour déplacer certains axes à un point intermédiaire, puis déplacer tous les axes à un point prédéfini, écrire deux lignes de G-code: G0 X- Y- (déplace les axes au point intermédiaire) G28 (déplace tous les axes au point prédéfini)

source: == Additions to RS274/NGC
fr: == Ajouts à RS274/NGC

source: .Differences that do not change the meaning of RS274/NGC programs
fr: .Différences qui ne changent pas le déroulement des programmes en RS274/NGC.

source: G33, G76 threading codes::
fr: Codes de filetage G33 et G76::

source: These codes are not defined in RS274/NGC.
fr: Ces codes ne sont pas définis dans RS274/NGC.

source: The probe tip is not retracted after a G38.2 movement. This retraction move may be added in a future release of LinuxCNC.
fr: La pointe de la sonde n'est pas rétractée après un mouvement G38.2.

source: G38.3...G38.5::
fr: G38.3 à G38.5::

source: These codes are not defined in RS274/NGC
fr: Ces codes ne sont pas définis dans RS274/NGC.

source: O-codes::
fr: Les O-codes::

source: M50...M53 overrides::
fr: M50 à M53 Correcteurs de vitesse::

source: M61..M66::
fr: M61 à M66::

source: 'Negative Tool Lengths' + The RS274/NGC spec says "it is expected that" all tool lengths will be positive. However, G43 works for negative tool lengths. + 'Lathe tools' + G43 tool length compensation can offset the tool in both the X and Z dimensions. This feature is primarily useful on lathes. + 'Dynamic tool lengths' + LinuxCNC allows specification of a computed tool length through G43.1 I K.
fr: 'Longueurs d'outil négatives' Les spécifications RS274/NGC précisent "il est prévu que" toutes les longueurs d'outils soient positives.Cependant, G43 fonctionne avec des longueurs d'outil négatives. 'Outils de tournage' La compensation de longueur d'outil G43 peut compenser l'outil à la fois en X et en Z. Cette fonctionnalité est surtout utile sur les tours. 'Longueurs d'Outil dynamiques' LinuxCNC permet la spécification d'une longueur d'outil calculée par G43.1 I K.

source: G41.1, G42.1::
fr: G41.1, G42.1 Compensation dynamique::

source: LinuxCNC allows specification of a tool diameter and, if in lathe mode, orientation in the G code. The format is G41.1/G42.1 D L, where D is diameter and L (if specified) is the lathe tool orientation.
fr: LinuxCNC permet dans le G-code, la spécification d'un diamètre d'outil et en mode tour, l'orientation est également spécifiée. Le format est G41.1/G42.1 D L, où D est le diamètre et L (si spécifié) est l'orientation de l'outil de tournage.

source: G43 without H word::
fr: G43 sans le mot H::

source: In ngc, this is not allowed. In LinuxCNC, it sets length offsets for the currently loaded tool. If no tool is currently loaded, it is an error. This change was made so the user doesn't have to specify the tool number in two places for each tool change, and because it's consistent with the way G41/G42 work when the D word is not specified.
fr: Ce code n'est pas permis en NGC. Dans LinuxCNC, il fixe la compensation de longueur pour l'outil actuellement chargé. Si aucun outil n'est actuellement chargé, c'est une erreur. Ceci a été fait afin que l'utilisateur n'ait pas à spécifier, pour chaque changement d'outil, le numéro d'outil à deux endroits et c'est cohérent avec la manière de fonctionner de G41/G42 quand le mot D n'est pas spécifié.

source: U, V, and W axes::
fr: U, V et W axes::

source: LinuxCNC allows machines with up to 9 axes by defining an additional set of 3 linear axes known as U, V and W
fr: LinuxCNC admet des machines ayant jusqu'à 9 axes en définissant un ensemble supplémentaire de 3 axes linéaires, connus comme U, V et W.
