Repository: 0000duck/linuxcnc
Catalog: docs/src/gcode/tool_compensation.*.po
Languages: fr

source: Any move that is long enough to perform the compensation will work as the entry move. The minimum length is the cutter radius. This can be a rapid move above the work piece. If several rapid moves are issued after a G41/42 only the last one will move the tool to the compensated position.
fr: Tout mouvement suffisamment long pour arriver en position compensée, sera un mouvement d'entrée valide. La longueur minimale équivaut au rayon de l'outil. Ça peut être un mouvement en vitesse rapide au dessus de la pièce. Si plusieurs mouvements en vitesse rapide sont prévus après un G41/G42, seul le dernier placera l'outil en position compensée.

source: In the following figure you can see that the entry move is compensated to the right of the line. This puts the center of the tool to the right of X0 in this case. If you were to program a profile and the end is at X0 the resulting profile would leave a bump due to the offset of the entry move.
fr: Dans la figure suivante, on voit que le mouvement d'entrée est compensé à droite du profil. Ce qui aura pour effet, lors du mouvement d'entrée, de déplacer le centre de l'outil, d'un rayon d'outil à droite de X0. Dans ce cas, le mouvement d'entrée laissera un petit plot de matière en raison du décalage de compensation et de l'arrondi de l'outil.

source: .Entry Move[[cap:Entry-Move]]
fr: .Mouvement d'entrée[[cap:Entry-Move]]

source: .Z Motion
fr: .Mouvement en Z

source: Z axis motion may take place while the contour is being followed in the XY plane. Portions of the contour may be skipped by retracting the Z axis above the part and by extending the Z-axis at the next start point.
fr: Un mouvement en Z est possible pendant que le contour est suivi dans le plan XY. Des portions du contour peuvent être sautées en rétractant l'axe Z au dessus du bloc et en amenant Z au dessus du prochain point de départ.

source: .Rapid Moves
fr: .Mouvements en vitesse rapide

source: Rapid moves may be programed while compensation is turned on.
fr: Des mouvements en vitesse rapide peuvent être programmés avec les compensations d'outil activées.

source: .Good Practices
fr: .Bonne pratique

source: Start a program with G40 to make sure compensation is off.
fr: Débuter tout programme avec un G40 pour être sûr que la compensation est désactivée.

source: === Examples
fr: === Exemples de profils

source: .Outside Profile
fr: .Profil extérieur

source: .Outside Profile[[cap:Outside-Profile]]
fr: .Profil extérieur[[cap:Outside-Profile]]

source: image::images/outside-comp.png[]
fr: image::images/outside-comp_fr.png[]

source: .Inside Profile
fr: .Profil intérieur

source: .Inside Profile[[cap:Inside-Profile]]
fr: .Profil intérieur[[cap:Inside-Profile]]

source: image::images/inside-comp.png[]
fr: image::images/inside-comp_fr.png[]
