Repository: 0000duck/linuxcnc
Catalog: docs/src/getting-started/About-LinuxCNC.*.po
Languages: fr

source: :lang: en
fr: ﻿:lang: fr

source: = About LinuxCNC
fr: = À propos du logiciel LinuxCNC

source: == The Software
fr: == Le logiciel LinuxCNC

source: LinuxCNC (the Enhanced Machine Control) is a software system for computer control of machine tools such as milling machines and lathes, robots such as puma and scara and other computer controlled machines up to 9 axes.
fr: LinuxCNC (the Enhanced Machine Control) est un logiciel de contrôle de machines-outils telles que fraiseuses, tours, robots Puma , Scara et autres machines numériques comportant jusqu'à 9 axes.

source: LinuxCNC is free software with open source code. Current versions of LinuxCNC are entirely licensed under the GNU General Public License and Lesser GNU General Public License (GPL and LGPL)
fr: LinuxCNC est un logiciel libre avec code source ouvert. Les versions actuelles de LinuxCNC sont entièrement sous licence GNU Lesser General Public et de GNU General Public License (GPL et LGPL)

source: * LinuxCNC provides: ** a graphical user interface (actually several interfaces to choose from) ** an interpreter for 'G-code' (the RS-274 machine tool programming language) ** a realtime motion planning system with look-ahead ** operation of low-level machine electronics such as sensors and motor drives ** an easy to use 'breadboard' layer for quickly creating a unique configuration for your machine ** a software PLC programmable with ladder diagrams ** easy installation with a Live-CD * It does not provide drawing (CAD - Computer Aided Design) or G-code generation from the drawing (CAM - Computer Automated Manufacturing) functions. * It can simultaneously move up to 9 axes and supports a variety of interfaces. * The control can operate true servos (analog or PWM) with the feedback loop closed by the LinuxCNC software at the computer, or open loop with step-servos or stepper motors. * Motion control features include: cutter radius and length compensation, path deviation limited to a specified tolerance, lathe threading, synchronized axis motion, adaptive feedrate, operator feed override, and constant velocity control. * Support for non-Cartesian motion systems is provided via custom kinematics modules. Available architectures include hexapods (Stewart platforms and similar concepts) and systems with rotary joints to provide motion such as PUMA or SCARA robots. * LinuxCNC runs on Linux using real time extensions.
fr: * LinuxCNC propose: ** Une interface graphique (et plusieurs interfaces au choix). ** Un interpréteur de 'G-code' (RS-274, langage de programmation des machines-outils). ** Un système prédictif de planification de trajectoire temps réel. ** La gestion du fonctionnement de l'électronique machine de bas niveau, comme que les capteurs et les pilotes de moteurs. ** Un assistant de configuration simple à utiliser pour créer rapidement une configuration spécifique à la machine. ** Un logiciel d'automate programmable pour schémas à contacts (Ladder). ** Une installation facile à partir d'un DVD live. * Il ne fournit pas directement de logiciel de dessin (DAO) ni de générateur de G-code. * Il peut piloter simultanément jusqu'à 9 axes et supporte une grande variété d'interfaces. * Le contrôleur peut fonctionner avec de vrais servomoteurs (analogiques ou PWM) en boucle fermée ou avec des moteurs pas à pas en boucle ouverte ou en step-servos. * Le contrôleur de mouvement assure: les compensations de rayon et/ou de longueur d'outil, la déviation de trajectoire d'usinage contrôlée par une tolérance spécifiée, le filetage sur tour, le taraudage rigide, les mouvements avec axes synchronisés, la vitesse d'avance adaptative, la correction de vitesse par l'opérateur, le contrôle de vitesse de coupe constante etc. * Il supporte les systèmes à mouvements non cartésiens grâce aux modules de cinématique personnalisée. Les architectures disponibles incluent les hexapodes (plate-forme de Stewart et concepts similaires) et les systèmes à articulations rotatives pour assurer les mouvements de robots tels que PUMA ou SCARA. * LinuxCNC fonctionne sous Linux en utilisant ses extensions temps réel.

source: == The Operating System
fr: == Le système d'exploitation

source: LinuxCNC is available as ready-to-use packages for the Ubuntu and Debian distributions.
fr: LinuxCNC est disponible en paquets prêts à utiliser pour les distributions Ubuntu ou Debian.

source: == Getting Help
fr: == Trouver de l'aide

source: === IRC
fr: === Les salons IRC

source: IRC stands for Internet Relay Chat. It is a live connection to other LinuxCNC users. The LinuxCNC IRC channel is #linuxcnc on freenode.
fr: IRC signifie Internet Relay Chat. Il s'agit d'une connexion en direct avec d'autres utilisateurs LinuxCNC. Le canal LinuxCNC sur IRC est: #linuxcnc sur freenode.net.

source: The simplest way to get on the IRC is to use the embedded java client on this http://www.linuxcnc.org/index.php/english/community[page].
fr: La manière la plus simple d'aller sur IRC est d'utiliser le client embarqué sur cette page: http://webchat.freenode.net/?channels=linuxcnc

source: Some IRC etiquette::
fr: Un peu d'éthique sur l'IRC::

source: Ask specific questions... Avoid questions like "Can someone help me?".
fr: Posez des questions précises... Évitez le "quelqu'un peut m'aider?".

source: If you're really new to all this, think a bit about your question before typing it. Make sure you give enough information so someone can solve your question.
fr: Si vous êtes vraiment nouveau dans tout cela, réfléchissez à votre question avant de la poser. Assurez-vous de donner suffisamment d'informations pour que quelqu'un puisse résoudre votre problème.

source: Have some patience when waiting for an answer, sometimes it takes a while to formulate an answer or everyone might be busy working or something.
fr: Faites preuve de patience quand vous attendez une réponse, il faut parfois du temps pour formuler une réponse. Tout les participants peuvent être occupés, à travailler par exemple :-) ou à autre chose.

source: Set up your IRC account with your unique name so people will know who you are. If you use the java client, use the same name every time you log in. This helps people remember who you are and if you have been on before many will remember the past discussions which saves time on both ends.
fr: Configurez votre compte IRC avec un pseudo unique afin que les participants sachent qui vous êtes. Si vous utilisez le client java, utilisez le même pseudo à chaque fois que vous vous connecter, cela aidera les participants à se rappeler qui vous êtes, ainsi, si vous êtes déjà venu avant, beaucoup se souviendront des discussions passées, ce qui fait gagner du temps à tout le monde.

source: Sharing Files:: The most common way to share files on the IRC is to upload the file to one of the following or a similar service and paste the link:
fr: Partage de fichiers sur IRC:: La façon la plus courante de partager des fichiers sur IRC est de charger le fichier sur un des services suivants ou service similaire, puis coller le lien vers le fichier, sur l'IRC:

source: 'For text' - http://pastebin.com/ , http://pastie.org/, https://gist.github.com/
fr: 'Pour le texte' - http://pastebin.com/, http://pastie.org/, https://gist.github.com/

source: 'For pictures' - http://imagebin.org/ , http://imgur.com/ , http://bayimg.com/
fr: 'Pour les photos' - http://imagebin.org/, http://imgur.com/, http://bayimg.com/

source: 'For files' - https://filedropper.com/ , http://filefactory.com/ , http://1fichier.com/
fr: 'Pour les fichiers' - https://filedropper.com/, http://filefactory.com/, http://1fichier.com/

source: === Mailing List
fr: === Les listes de diffusion

source: An Internet Mailing List is a way to put questions out for everyone on that list to see and answer at their convenience. You get better exposure to your questions on a mailing list than on the IRC but answers take longer. In a nutshell you e-mail a message to the list and either get daily digests or individual replies back depending on how you set up your account.
fr: Une liste de diffusion sur Internet est un moyen de poser des questions, tout les abonnés à cette liste pourrons lire et répondre à leur convenance. Vous obtiendrez une meilleurs visibilité de vos questions sur une liste de diffusion plutôt que sur l'IRC et vous aurez plus de réponses. En quelques mots, vous envoyez un e-mail à la liste et selon comment vous avez configuré votre compte, vous aurez les réponses soit, regroupées quotidiennement, soit individuellement.

source: You can subscribe to the emc-users mailing list at: https://lists.sourceforge.net/lists/listinfo/emc-users
fr: Inscription sur la liste de diffusion des utilisateurs de LinuxCNC sur: https://lists.sourceforge.net/lists/listinfo/linuxcnc-users

source: === LinuxCNC Wiki
fr: === Le Wiki de LinuxCNC

source: A Wiki site is a user maintained web site that anyone can add to or edit.
fr: Un site Wiki est un site web maintenu et enrichi par les utilisateurs, n'importe qui peut ajouter ou modifier les pages.

source: The user maintained LinuxCNC Wiki site contains a wealth of information and tips at:
fr: Le Wiki de LinuxCNC est également maintenu par les utilisateurs, il contient un grand nombre d'informations et d'astuces sur:
