Repository: 0000duck/linuxcnc
Catalog: docs/src/getting-started/Getting-LinuxCNC.*.po
Languages: fr

source: :lang en
fr: :lang: fr

source: = Getting LinuxCNC
fr: = Se procurer LinuxCNC[[cha:se_procurer_linuxcnc]]

source: This section describes the recommended way to download and make a fresh install of LinuxCNC. There are also <<sec:alternate_install_methods,Alternate Install Methods>> for the adventurous. If you have an existing install that you want to upgrade, go to the <<cha:updating_linuxcnc,Updating LinuxCNC>> section instead.
fr: Cette section décrit la voie recommandée pour télécharger et faire une nouvelle installation de LinuxCNC. Il existe également des méthodes d'installation <<sec:install_alt,alternatives>> pour les aventuriers. Si l'installation est déjà existante, mais doit juste être mise à niveau, aller à la section <<sec:maj_linuxcnc,Mise à jour>> de LinuxCNC.

source: Fresh installs of LinuxCNC are most easily created using the Live/Install Image. This is a hybrid ISO filesystem image that can be written to a USB storage device or a DVD and used to boot a computer. At boot time you will be given a choice of booting the "Live" system (to run LinuxCNC without making any permanent changes to your computer) or booting the Installer (to install LinuxCNC and its operating system onto your computer's hard drive).
fr: Les nouvelles installations de LinuxCNC sont facilement réalisées en utilisant l'image ISO du DVD live. Il s'agit d'une image ISO hybride dont le système de fichiers peut être écrit sur une clé USB ou gravé sur un DVD et utilisé pour démarrer le PC. Au moment du boot, un choix est fourni permettant de démarrer le système en "Live" (ce qui permet de lancer et d'évaluer LinuxCNC sans modifier quoi que ce soit sur l'ordinateur) ou de démarrer l'installateur pour installer LinuxCNC et son système d'exploitation sur le disque dur de l'ordinateur.

source: The outline of the process looks like this:
fr: Le processus dans ses grandes lignes ressemble à cela:

source: Download the Live/Install Image.
fr: Télécharger l'image ISO.

source: Write the image to a USB storage device or DVD.
fr: Écrire cette image sur une clé USB ou la graver sur un DVD.

source: Boot the Live system to test out LinuxCNC.
fr: Démarrer sur le support choisi pour tester simplement LinuxCNC.

source: Boot the Installer to install LinuxCNC.
fr: Démarrer sur le support choisi pour installer LinuxCNC.

source: == Download the image
fr: == Télécharger une image

source: This section describes some methods for downloading the Live/Install Image.
fr: Cette section décrit les différentes méthodes de téléchargement de l'image ISO du DVD live.

source: === Normal Download
fr: === Téléchargement standard[[sec:telechargement_standard,standard]]

source: Download the Live/Install CD by clicking here:
fr: Télécharger l'image ISO disponible ici:

source: === Download using zsync
fr: === Télécharger l'image à l'aide de zsync

source: zsync is a download application that efficiently resumes interrupted downloads and efficiently transfers large files with small modifications (if you have an older local copy). Use zsync if you have trouble downloading the image using the normal_download method.
fr: zsync est une application de téléchargement très efficace, elle permet la reprise en cas de transfert interrompu elle est également efficace dans les transferts de gros fichiers avec de petites modifications (à condition d'avoir localement l'ancienne copie). Utiliser zsync si la méthode de téléchargement <<sec:telechargement_standard,standard>> pose problème.

source: zsync in Linux:: Install zsync using your favourite package management application such as Synaptic or, by running `sudo apt-get install zsync` in a terminal. Then run this command to download (in a terminal): `zsync http://www.linuxcnc.org/linuxcnc-2.7-wheezy.iso.zsync`
fr: zsync sous Linux:: Installer zsync avec le gestionnaire de paquets Synaptic ou, en lançant la commande `sudo apt-get install zsync` dans une console. Puis, pour télécharger l'image ISO, toujours dans une console, lancer: `zsync http://www.linuxcnc.org/linuxcnc-2.7-wheezy.iso.zsync`

source: zsync in Windows:: There is a Windows port of zsync. It works as a console application, just like the Linux version, so get out that Command Prompt. It can be downloaded from: https://www.assembla.com/spaces/zsync-windows/documents
fr: zsync sous Windows:: Zsync a été porté sous Windows. Il fonctionne en ligne de commande dans la console, comme sous Linux. Il peut être téléchargé depuis: https://www.assembla.com/spaces/zsync-windows/documents

source: === Verify the image
fr: === Vérifier l'intégrité de l'image ISO

source: After downloading, verify the checksum of the image to ensure integrity. In a terminal, run `md5sum linuxcnc-2.7-wheezy.iso` or `sha256sum linuxcnc-2.7-wheezy.iso`, and compare to these checksums:
fr: Avant de graver un CD, il est fortement recommandé de vérifier la somme de contrôle 'md5sum' ou 'sha256sum' de l'image ISO pour s'assurer de son intégrité. Ouvrir une console dans le répertoire de téléchargement, puis lancer: 'd5sum linuxcnc-2.7-wheezy.iso` ou `sha256sum linuxcnc-2.7-wheezy.iso` et comparer le résultat avec ces sommes de contrôle:

source: Verify md5sum on Windows or Mac:: + Windows and Mac OS X do not come with an md5sum program, but there are alternatives. More information can be found at: + https://help.ubuntu.com/community/HowToMD5SUM
fr: Vérifier la somme md5 sous Windows ou Mac:: + Windows et Mac OS X ne disposent pas, d'origine, de programme de contrôle de la somme md5, mais il existe des alternatives. D'autres informations sont ici: + https://help.ubuntu.com/community/HowToMD5SUM

source: == Write the image to a bootable device
fr: == Écrire l'image sur un support bootable

source: The LinuxCNC Live/Install Image is a hybrid ISO image which can be written directly to a USB storage device (flash drive) or a DVD and used to boot a computer. The image is too large to fit on a CD.
fr: L'image ISO du live DVD de LinuxCNC est une image ISO hybride, elle peut être directement écrite sur un support de stockage USB bootable, tel qu'une clé, une carte flash ou un disque dur, ou, gravée sur un DVD. Le support choisi est ensuite utilisé pour booter l'ordinateur. L'image actuelle est trop grande pour tenir sur un CD.

source: Writing the image to a USB storage device in Linux:: * Connect a USB storage device (for example a flash drive or thumb drive type device). * Determine the device file corresponding to the USB flash drive. This information can be found in the output of `dmesg` after connecting the device. `/proc/partitions` may also be helpful. * Use the `dd` command to write the image to your USB storage device. For example, if your storage device showed up as `/dev/sde`, then use this command: + -----
fr: Écrire l'image sur une support de stockage USB sous Linux:: * Connecter un support de stockage USB (par exemple un flash disque ou une clé). * Déterminer le port USB correspondant au support. Cette information est disponible dans `dmesg` après la connection au port. `/proc/partitions` peut aussi être utile. * Utiliser la commande `dd` pour écrire l'image sur le support de stockage USB. Par exemple, Si le support de stockage est sur `/dev/sde`, alors utiliser cette commande: + -----

source: Writing the image to a DVD in Linux::
fr: Graver l'image sur un DVD sous Linux::

source: . Insert a blank DVD into your burner. A 'CD/DVD Creator' or 'Choose Disc Type' window will pop up. Close this, as we will not be using it. . Browse to the downloaded image in the file browser. . Right click on the ISO image file and choose Write to Disc. . Select the write speed. It is recommended that you write at the lowest possible speed. . Start the burning process. . If a 'choose a file name for the disc image' window pops up, just pick OK.
fr: . Insérer un DVD vierge dans lr graveur. Une fenêtre surgissante 'CD/DVD Creator' ou 'Choisissez le type de disque' va s'ouvrir, la fermer, elle ne sera pas utilisée. . Naviguer jusqu'au répertoire contenant l'image ISO. . Faire un clic droit sur le fichier de l'image ISO et choisir 'Graver le Disque'. . Sélectionner la vitesse de gravure. Il est recommandé de graver à la vitesse la plus lente possible pour éviter toute erreur de gravure. . Lancer la gravure. . Si le choix d'un nom de fichier est demandé pour l'image disque, cliquer juste 'OK'.

source: Writing the image to a DVD in Windows::
fr: Graver l'image sur un DVD sous Windows::

source: . Download and install Infra Recorder, a free and open source image burning program: http://infrarecorder.org/ . Insert a blank CD in the drive and select Do nothing or Cancel if an auto-run dialog pops up. . Open Infra Recorder, and select the 'Actions' menu, then 'Burn image'.
fr: . Si Windows n'intègre pas un logiciel de gravure d'image il est possible de télécharger Infra Recorder, un logiciel de gravure d'images gratuit et open source sur http://infrarecorder.org/ . Insérer un DVD vierge dans le graveur, sélectionner 'Quitter' ou 'Abandonner' si un auto-run démarre. . Cliquer droit sur le fichier ISO et sélectionne le menu 'Graver l'image disque' ou lancer 'Infra Recorder' et choisir le menu 'Actions', puis 'Graver l'image'.

source: == Testing LinuxCNC
fr: == Tester LinuxCNC

source: With the USB storage device plugged in or the DVD in the DVD drive, the shut down the computer then turn the computer back on. This will boot the computer from the Live/Install Image and choose the Live boot option. Once the computer has booted up you can try out LinuxCNC without installing it. You can not create custom configurations or modify most system settings like screen resolution unless you install LinuxCNC.
fr: Avec le support de stockage USB connecté ou le DVD Live de LinuxCNC dans le graveur de CD/DVD, redémarrer l'ordinateur de sorte qu'il démarre sur le support choisi. Quand l'ordinateur a redémarré, choisir soit, d'évaluer LinuxCNC sans installer quoi que ce soit, ou de l'installer avec son système d'exploitation. Il n'est pas possible de créer de configuration personnalisée ni de modifier les réglages du système comme la résolution de l'écran sans installer LinuxCNC.

source: To try out LinuxCNC from the Applications/CNC menu pick LinuxCNC. Then select a sim configuration to try out.
fr: Pour évaluer LinuxCNC, aller dans le menu Applications/CNC et choisir 'LinuxCNC'. Puis sélectionnez une configuration en sim (simulation) et essayez la.

source: To see if your computer is suitable for software step pulse generation run the Latency Test as shown <<latency-test,here>>.
fr: Pour savoir si votre ordinateur est utilisable par le générateur logiciel d'impulsions de pas, lancer un test de latence comme indiqué <<cha:test-de-latence, dans ce chapitre>>.

source: == Installing LinuxCNC
fr: == Installer LinuxCNC

source: To install LinuxCNC from the LiveCD select 'Install (Graphical)' at bootup.
fr: Pour installer LinuxCNC depuis le Live DVD, sélectionner 'Installation graphique' dans le menu du boot.

source: == Updates to LinuxCNC (((Updates to LinuxCNC)))
fr: == Mise à jour de LinuxCNC[[sec:maj_linuxcnc,Mise à jour]]

source: With the normal install the Update Manager will notify you of updates to LinuxCNC when you go on line and allow you to easily upgrade with no Linux knowledge needed. It is OK to upgrade everything except the operating system when asked to.
fr: Avec l'installation standard, le gestionnaire de mise à jour avertira des mises à jour de LinuxCNC disponibles en ligne et permettra de mettre à jour facilement sans connaissance particulière de Linux. Il est possible de faire toutes les mises à jour proposées, excepté celles du système d'exploitation.

source: WARNING: Do not upgrade the operating system if promped to do so.
fr: WARNING: [red]#Ne jamais mettre à jour vers une nouvelle distribution, même si elle est proposée.#

source: == Install Problems
fr: == Problèmes d'installation

source: In rare cases you might have to reset the BIOS to default settings if during the Live CD install it cannot recognize the hard drive during the boot up.
fr: Dans de rares cas, le BIOS devra être réinitialisé à ses réglages par défaut si lors de l'installation du Live CD, le disque dur n'est plus reconnu pendant le démarrage.

source: [[sec:alternate_install_methods,Alternate Install Methods]] == Alternate Install Methods
fr: == Méthodes d'installation alternatives[[sec:install_alt,alternatives]]

source: The easiest, preferred way to install LinuxCNC is to use the Live/Install Image as described above. That method is as simple and reliable as we can make it, and is suitable for novice users and experienced users alike.
fr: La manière préférable d'installer LinuxCNC, c'est d'utiliser l'image Live/Install comme décrit précédemment. Cette méthode est aussi simple et fiable que nous ayons pu faire. Elle est accessible aux novices comme aux utilisateurs expérimentés.

source: In addition, for experienced users who are familiar with Debian system administration (finding install images, manipulating apt sources, changing kernel flavors, etc), new installs are supported on following platforms:
fr: En plus, pour les utilisateurs expérimentés, familier de l'administration des systèmes Debian (trouver les images d'installation, manipuler les sources apt, changer les options du kernel etc), de nouvelles installations sont prises en charge sur les plate-formes suivantes:

source: [options="header"] |=================================================================== | Distribution | Architecture | kernel | Typical use | Debian Wheezy | i386 | RTAI | machine control & simulation | Debian Wheezy | amd64 & i386 | Preempt-RT | machine control & simulation | Debian Wheezy | amd64 & i386 | vanilla | simulation only | Ubuntu Precise | i386 | RTAI | machine control & simulation | Ubuntu Precise | amd64 & i386 | vanilla | simulation only | Ubuntu Lucid | i386 | RTAI | machine control & simulation | Ubuntu Lucid | amd64 & i386 | vanilla | simulation only |===================================================================
fr: [options="header"] |=========================================================================== | Distribution | Architecture | kernel | Utilisation typique | Debian Wheezy | i386 | RTAI | contrôle machine & simulation | Debian Wheezy | amd64 & i386 | Preempt-RT | contrôle machine & simulation | Debian Wheezy | amd64 & i386 | vanilla | simulation seule | Ubuntu Precise | i386 | RTAI | contrôle machine & simulation | Ubuntu Precise | amd64 & i386 | vanilla | simulation seule | Ubuntu Lucid | i386 | RTAI | contrôle machine & simulation | Ubuntu Lucid | amd64 & i386 | vanilla | simulation seule |============================================================================

source: The RTAI kernels are available for download from the linuxcnc.org debian archive. The apt source is:
fr: Les kernels RTAI sont disponibles au téléchargement depuis les archives linuxcnc.org de Debian. Les sources apt sont:

source: The Preempt-RT kernels are available from the regular debian.org archive, as part of Debian Wheezy. No special apt source is needed. The packages are called `linux-image-rt-amd64` and `linux-image-rt-686-pae`.
fr: Les kernels Preempt-RT sont disponibles dans les archives courantes de debian.org, comme parties de Debian Wheezy. Aucune source apt spéciale n'est nécessaire. Les paquets sont nommés `linux-image-rt-amd64` et `linux-image-rt-686-pae`.

source: === Installing on Debian Wheezy (with Preempt-RT kernel)
fr: === Installation sous Debian Wheezy (avec kernel Preempt-RT)

source: Install Debian Wheezy (Debian version 7), either i386 or amd64. You can download the installer here: https://www.debian.org/CD/http-ftp/#stable
fr: Installer Debian Wheezy (Debian version 7), soit i386, soit amd64. L'installateur est téléchargeable ici: https://www.debian.org/CD/http-ftp/#stable

source: Run `sudo apt-get update` followed by `sudo apt-get dist-upgrade` to bring the machine up to date with the latest packages in Debian Wheezy.
fr: Faire un `sudo apt-get update` suivi d'un `sudo apt-get dist-upgrade` pour mettre la machine à jour avec les derniers paquets de Debian Wheezy.

source: Install the Preempt-RT kernel and modules by running: `sudo apt-get install linux-image-rt-amd64` or `sudo apt-get install linux-image-rt-686-pae`.
fr: Installer le kernel Preempt-RT et ses modules par un: `sudo apt-get install linux-image-rt-amd64` ou: `sudo apt-get install linux-image-rt-686-pae`.

source: Reboot, and make sure you boot into the Preempt-RT kernel. When you log in, verify that `uname -r` says 3.2.0-4-rt-686-pae.
fr: Rebooter, et vérifier que la machine boot bien sur le kernel Preempt-RT. Au login, vérifier que `uname -r` donne bien 3.2.0-4-rt-686-pae.

source: Add the LinuxCNC Archive Signing Key to your apt keyring by running `sudo apt-key adv --keyserver hkp://keys.gnupg.net --recv-key 8f374fef`
fr: Ajouter la clé de signature des archives LinuxCNC dans le apt keyring en faisant: `sudo apt-key adv --keyserver hkp://keys.gnupg.net --recv-key 8f374fef`

source: Add a new apt source that looks like this: `deb http://linuxcnc.org/ wheezy base 2.7-uspace`
fr: Ajouter une source apt telle que: `deb http://linuxcnc.org/ wheezy base 2.7-uspace`

source: Run `sudo apt-get update` again to fetch the package list from linuxcnc.org.
fr: Lancer `sudo apt-get update` encore une fois pour rafraîchir la liste depuis linuxcnc.org.

source: Run `sudo apt-get install linuxcnc-uspace`.
fr: Lancer `sudo apt-get install linuxcnc-uspace`.

source: Machine away!
fr: La machine est prête!

source: === Installing on Ubuntu Precise
fr: === Installation sous Ubuntu Precise

source: Install Ubuntu Precise 12.04 x86 (32-bit). Any flavor should work (regular Ubuntu, Xubuntu, Lubuntu, etc). 64-bit (AMD64) is currently not supported. You can download the installer here: http://releases.ubuntu.com/precise/
fr: Installer Ubuntu Precise 12.04 x86 (32-bit). N'importe quel environnement doit FONCTIONNER (Ubuntu standard, Xubuntu, Lubuntu etc). Le 64-bit (AMD64) n'est actuellement pas supporté. L'installateur est disponible au téléchargement ici: http://releases.ubuntu.com/precise/

source: Run `sudo apt-get update` followed by `sudo apt-get dist-upgrade` to bring the machine up to date with the latest packages in Ubuntu Precise.
fr: Faire un `sudo apt-get update` suivi d'un `sudo apt-get dist-upgrade` pour mettre la machine à jour avec les derniers paquets de Ubuntu Precise.

source: Add a new apt source that looks like this: `deb http://linuxcnc.org/ precise base 2.7-rtai`
fr: Ajouter la nouvelle source apt avec: `deb http://linuxcnc.org/precise base 2.7-rtai`

source: Install the RTAI kernel and modules by running: `sudo apt-get install linux-image-3.4-9-rtai-686-pae rtai-modules-3.4-9-rtai-686-pae`
fr: Installer le kernel RTAI et ses modules avec un: `sudo apt-get install linux-image-3.4-9-rtai-686-pae rtai-modules-3.4-9-rtai-686-pae`

source: If you want to be able to build LinuxCNC from source using the git repo, also run `sudo apt-get install linux-headers-3.4-9-rtai-686-pae`
fr: Pour compiler LinuxCNC à partir de ses sources, en utilisant le dépôt git, lancer `sudo apt-get install linux-headers-3.4-9-rtai-686-pae`

source: Reboot, and make sure you boot into the rtai kernel. When you log in, verify that `uname -r` says 3.4-9-rtai-686-pae.
fr: Redémarrer puis s'assurer que le kernel est bien le kernel rtai. Au login, vérifier que `uname -r` donne bien 3.4-9-rtai-686-pae.

source: Run `sudo apt-get install linuxcnc`.
fr: Lancer `sudo apt-get install linuxcnc`.
