Repository: 0000duck/linuxcnc
Catalog: docs/src/getting-started/Linux_FAQ.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = Linux FAQ
fr: = Petite FAQ Linux

source: [[cha:linux-faq]] (((Linux FAQ)))
fr: [[cha:faq-linux]] (((FAQ Linux)))

source: These are some basic Linux commands and techniques for new to Linux users. More complete information can be found on the web or by using the man pages.
fr: Voici quelques commandes et techniques de base pour l'utilisateur débutant sous Linux. Beaucoup d'autres informations peuvent être trouvées sur le web ou dans les man pages.

source: == Automatic Login (((Automatic Login)))
fr: == Login automatique (((Login automatique)))

source: When you install LinuxCNC with the Ubuntu LiveCD the default is to have to log in each time you turn the computer on. To enable automatic login go to 'System > Administration > Login Window'. If it is a fresh install the Login Window might take a second or three to pop up. You will have to have your password that you used for the install to gain access to the Login Window Preferences window. In the Security tab check off Enable Automatic Login and pick a user name from the list (that would be you).
fr: Quand LinuxCNC est installé avec le CD-Live Ubuntu, par défaut il faut passer par la fenêtre de connexion à chaque démarrage du PC. Pour activer le login automatique ouvrir le menu 'Système → Administration → Fenêtre de connexion'. Si l'installation est nouvelle, la fenêtre de connexion peut prendre quelques secondes pour s'ouvrir. Entrer le mot de passe utilisé pendant l'installation pour accéder à la fenêtre des préférences. Dans l'onglet Sécurité, décocher la case Activer les connexions automatiques et saisir le nom d'utilisateur ou en choisir un dans la liste déroulante.

source: == Automatic Startup (((Automatic Startup)))
fr: == Démarrage automatique (((Démarrage automatique)))

source: To have LinuxCNC start automatically with your config after turning on the computer go to 'System > Preferences > Sessions > Startup Applications', click Add. Browse to your config and select the .ini file. When the file picker dialog closes, add emc and a space in front of the path to your .ini file.
fr: Pour que LinuxCNC démarre automatiquement avec sa configuration après le démarrage de l'ordinateur, aller dans 'Système > Sessions > Applications à démarrer', cliquer sur Ajouter. Naviguer vers la bonne configuration puis sélectionner le fichier .ini. Quand la recherche de fichiers se ferme, ajouter linuxcnc et un espace devant le chemin du bon fichier ini.

source: Example:
fr: Exemple:

source: emc /home/mill/emc2/config/mill/mill.ini ----
fr: linuxcnc /home/mill/linuxcnc/config/mill/mill.ini ----

source: == Man Pages[[sec:Man-Pages]]
fr: == Pages de manuel[[sec:Pages-man]]

source: (((Man Pages)))
fr: (((Pages man)))

source: Man pages are automatically generated manual pages in most cases. Man pages are usually available for most programs and commands in Linux.
fr: Les Man pages sont des pages de manuel générées automatiquement le plus souvent. Les Man pages existent pour quasiment tous les programmes et les commandes de Linux.

source: To view a man page open up a terminal window by going to 'Applications > Accessories > Terminal'. For example if you wanted to find out something about the find command in the terminal window type:
fr: Pour visualiser une man page ouvrir un terminal depuis 'Applications → Accessoires → Terminal'. Par exemple pour trouver quelques choses concernant la commande 'find', taper alors dans une console:

source: Use the Page Up and Page Down keys to view the man page and the Q key to quit viewing.
fr: Utiliser les touches 'Vers le haut' et 'Vers le bas' pour faire défiler le texte et la touche Q pour quitter.

source: == List Modules
fr: == Lister les modules du noyau

source: Sometimes when troubleshooting you need to get a list of modules that are loaded. In a terminal window type:
fr: En cas de problème il est parfois utile de connaître la liste des modules du noyau qui sont chargés. Ouvrir une console et taper:

source: If you want to send the output from lsmod to a text file in a terminal window type:
fr: Pour consulter tranquillement le résultat d'une commande en l'envoyant dans un fichier, la taper sous cette forme:

source: lsmod > mymod.txt ----
fr: lsmod > mesmodules.txt ----

source: The resulting text file will be located in the home directory if you did not change directories when you opened up the terminal window and it will be named mymod.txt or what ever you named it.
fr: Le fichier mes_modules.txt résultant, se trouvera alors dans le répertoire home si c'est de là qu'a été ouverte la console.

source: == Editing a Root File[[sec:Editing-a-Root-File]]
fr: == Éditer un fichier en root[[sec:Editer-un-fichier-en-root]]

source: (((Editing a Root File)))
fr: (((Éditer un fichier en root)))

source: When you open the file browser and you see the Owner of the file is root you must do extra steps to edit that file. Editing some root files can have bad results. Be careful when editing root files. Generally, you can open and view most root files, but they will open in 'read only' mode.
fr: Lorsque le navigateur de fichiers et ouvert et que le propriétaire des fichiers est le root, certaines précautions sont indispensables. Éditer certains fichiers du système en root peut donner des résultats inattendus! Il faut être très vigilant quand on édite en root, une erreur peut compromettre tout le système et l'empêcher de redémarrer. Il est possible d'ouvrir et de lire de nombreux fichiers systèmes appartenant au root, mais ils sont en mode lecture seule.

source: === The Command Line Way
fr: === A la ligne de commande

source: Open up 'Applications > Accessories > Terminal'.
fr: Ouvrir une console depuis 'Applications → Accessoires → Terminal'.

source: In the terminal window type
fr: Dans ce terminal, taper:

source: Open the file with File > Open > Edit
fr: Ouvrir un fichier depuis 'Fichiers → Ouvrir → Éditer'.

source: === The GUI Way
fr: === En mode graphique

source: . Right click on the desktop and select Create Launcher . Type a name in like sudo edit . Type 'gksudo "gnome-open %u"' as the command and save the launcher to your desktop . Drag a file onto your launcher to open and edit
fr: . Faire un clic droit sur le bureau et choisir 'Créer un lanceur..' . Taper un nom tel que 'éditeur', dans la zone 'Nom'. . Entrer 'gksudo "gnome-open %u"' dans la zone 'Commande' et valider. . Glisser un fichier et le déposer le lanceur, le fichier s'ouvrira alors directement dans l'éditeur.

source: === Root Access
fr: === Accès en root

source: In Ubuntu you can become root by typing in "sudo -i" in a terminal window then typing in your password. Be careful, because you can really foul things up as root if you don't know what you're doing.
fr: Dans Ubuntu il est possible de devenir root en tapant la commande "sudo -i" dans une console, puis en donnant son mot de passe. Il faut être prudent car, quand on est root, il est alors possible de corrompre tout le système sur une simple erreur de frappe.

source: == Terminal Commands[[sec:Terminal-Commands]]
fr: == Commandes du terminal[[sec:Commandes-Terminal]]

source: (((Terminal Commands)))
fr: (((Commandes en console)))

source: === Working Directory (((Working Directory)))(((pwd)))
fr: === Répertoire de travail (((Répertoire de travail)))(((pwd)))

source: To find out the path to the present working directory in the terminal window type:
fr: Pour afficher le chemin du répertoire courant dans le terminal taper:

source: === Changing Directories
fr: === Changer de répertoire

source: (((Changing Directories)))(((cd)))
fr: (((Changer de répertoire))) (((cd)))

source: To move up one level in the terminal window type:
fr: Pour remonter d'un niveau dans le répertoire précédent, taper dans le terminal:

source: To move up two levels in the terminal window type:
fr: Pour remonter de deux niveaux dans les répertoires précédents, taper dans le terminal:

source: To move down to the emc2/configs subdirectory in the terminal window type:
fr: Pour aller directement dans le sous-répertoire linuxcnc/configs taper:

source: cd emc2/configs ----
fr: cd linuxcnc/configs ----

source: === Listing files in a directory
fr: === Lister les fichiers du répertoire courant

source: (((Listing files in a directory)))(((dir)))(((ls)))
fr: (((Lister le répertoire courant)))(((dir)))(((ls)))

source: To view a list of all the files and subdirectories in the terminal window type:
fr: Pour voir le contenu du répertoire courant taper:

source: or
fr: ou

source: === Finding a File
fr: === Trouver un fichier

source: (((Finding a File)))(((find)))
fr: (((Trouver un fichier)))(((find)))

source: The find command can be a bit confusing to a new Linux user. The basic syntax is:
fr: La commande 'find' peut être un peu déroutante pour le nouvel utilisateur de Linux. La syntaxe de base est:

source: find starting-directory parameters actions ----
fr: find répertoire_de_départ <paramètres> <actions> ----

source: For example to find all the .ini files in your emc2 directory you first need to use the pwd command to find out the directory. + Open a new terminal window and type:
fr: Par exemple, pour trouver tous les fichiers .ini dans le répertoire linuxcnc utiliser d'abord la commande 'pwd' pour trouver le répertoire courant. Ouvrir un nouveau terminal et taper:

source: And pwd might return the following result:
fr: La commande pwd retourne par exemple le résultat suivant:

source: /home/joe ----
fr: /home/robert ----

source: With this information put the command together like this:
fr: Avec cette information il est possible de taper, par exemple, la commande:

source: find /home/joe/linuxcnc -name \*.ini -print ----
fr: find /home/robert/linuxcnc -name \*.ini -print ----

source: The -name is the name of the file your looking for and the -print tells it to print out the result to the terminal window. The \*.ini tells find to return all files that have the .ini extension. The backslash is needed to escape the shell meta-characters. See the find man page for more information on find.
fr: Le -name est le nom du fichier recherché et le -print indique à find d'afficher le résultat dans la console. Le *.ini indique à find de retourner tous les fichiers portant l'extension .ini. L'anti-slash est nécessaire pour échapper les méta-caractères du shell. Voir à ce propos les pages man de la commande find.

source: === Searching for Text
fr: === Rechercher un texte

source: (((Searching for Text)))(((grep)))
fr: (((Rechercher un texte)))(((grep)))

source: grep -irl 'text to search for' * ----
fr: grep -lir 'texte a rechercher' * ----

source: This will find all the files that contain the 'text to search for' in the current directory and all the subdirectories below it, while ignoring the case. The -i is for ignore case and the -r is for recursive (include all subdirectories in the search). The -l option will return a list of the file names, if you leave the -l off you will also get the text where each occourance of the "text to search for" is found. The * is a wild card for search all files. See the grep man page for more information.
fr: Pour trouver tous les fichiers contenant le texte 'texte à rechercher' dans le répertoire courant, tous ses sous-répertoires et en ignorant la casse. Le paramètre -l demande de ne pas afficher les résultats normalement mais à la place, d'indiquer le nom des fichiers pour lesquels des résultats auraient été affichés. Le paramètre -i demande d'ignorer la casse. Le paramètre -r demande une recherche récursive (qui inclus tous les sous-répertoires dans la recherche). Le caractère * est un jocker indiquant de rechercher tous les fichiers. Voir la page de man pour la commande grep.

source: === Bootup Messages
fr: === Messages de boot

source: To view the bootup messages use "dmesg" from the command window. To save the bootup messages to a file use the redirection operator, like this:
fr: Pour visualiser les messages de boot utiliser la commande 'dmesg' depuis une console. Pour enregistrer ces messages dans un fichier, les rediriger avec:

source: dmesg > bootmsg.txt ----
fr: dmesg > dmesg.txt ----

source: The contents of this file can be copied and pasted on line to share with people trying to help you diagnose your problem.
fr: Le contenu de ce fichier pourra alors être copié et collé à destination des personnes en ligne qui vous aideront à diagnostiquer votre problème.

source: To clear the message buffer type this:
fr: Pour nettoyer le tampon des messages taper cette commande:

source: This can be helpful to do just before launching LinuxCNC, so that there will only be a record of information related to the current launch of LinuxCNC.
fr: C'est utile avant de lancer LinuxCNC, pour que ne soit enregistrés que les messages relatifs à son fonctionnement courant.

source: To find the built in parallel port address use grep to filter the information out of dmesg.
fr: Pour trouver les adresses des ports parallèles de la machine, utiliser la commande grep pour filtrer les informations contenues dans dmesg.

source: After boot up open a terminal and type:
fr: Juste après le boot, ouvrir une console et taper:

source: == Convenience Items
fr: == Items de commodité

source: === Terminal Launcher
fr: === Lanceur de terminal

source: If you want to add a terminal launcher to the panel bar on top of the screen you typically can right click on the panel at the top of the screen and select "Add to Panel". Select Custom Application Launcher and Add. Give it a name and put gnome-terminal in the command box.
fr: Si vous voulez ajouter un lanceur de terminal à la barre du haut de l'écran, vous pouvez généralement faire un clic droit sur cette barre et sélectionner 'Ajouter au Panel'. Sélectionner 'Lanceur d'application personnalisé' et Ajouter. Lui donner un nom et mettre 'gnome-terminal' dans la boîte de dialogue.

source: == Hardware Problems
fr: == Problèmes matériels

source: === Hardware Info
fr: === Informations sur le matériel

source: To find out what hardware is connected to your motherboard in a terminal window type:
fr: Pour voir la liste du matériel installé sur les ports PCI de votre carte mère, taper la commande suivante dans un terminal:

source: === Monitor Resolution
fr: === Résolution du moniteur

source: During installation Ubuntu attempts to detect the monitor settings. If this fails you are left with a generic monitor with a maximum resolution of 800x600.
fr: Lors de l'installation d'Ubuntu les réglages du moniteur sont automatiquement détectés. Il peut arriver que la détection fonctionne mal et que la résolution ne soit que celle d'un moniteur générique en 800x600.

source: Instructions for fixing this are located here:
fr: Pour résoudre ce cas, suivre les instructions données ici:

source: == Paths
fr: == Chemins

source: .Relative Paths Relative paths are based on the startup directory which is the directory containing the ini file. Using relative paths can facilitate relocation of configurations but requires a good understanding of linux path specifiers.
fr: .Chemins relatifs Les chemins relatifs sont basés sur le répertoire de départ qui est le répertoire contenant le fichier ini. L'utilisation des chemins relatifs peut faciliter la réinstallation des configurations mais nécessite une bonne compréhension des spécificités des chemins dans linux.

source: .... ./f0 is the same as f0, e.g., a file named f0 in the startup directory ../f1 refers to a file f1 in the parent directory ../../f2 refers to a file f2 in the parent of the parent directory ../../../f3 etc. ....
fr: .... ./f0 est le même que f0, ex: un fichier nommé f0 situé dans le répertoire de départ ../f1 se réfère au fichier f1 situé dans le répertoire parent ../../f2 se réfère au fichier f2 situé dans le répertoire parent du répertoire parent précédent ../../../f3 etc. ....
