Repository: 0000duck/linuxcnc
Catalog: docs/src/getting-started/pncconf.*.po
Languages: fr

source: MPG Jogging:: Allows you to use a Manual Pulse Generator to jog the machine's axis. + MPG's are often found on commercial grade machines. They output quadrature pulses that can be counted with a MESA encoder counter. PNCconf allows for an MPG per axis or one MPG shared with all axis. It allows for selection of jog speeds using switches or a single speed. + The selectable increments option uses the mux16 component. This component has options such as debounce and gray code to help filter the raw switch input.
fr: Manivelle de jog externe:: Permet d'utiliser un générateur d'impulsions manuel (MPG) pour faire du jog sur les axes de la machine. Les manivelles à impulsions (MPG) sont souvent présentes sur les machines de bonne qualité. Elles délivrent en sortie des impulsions en quadrature qui peuvent être comptées avec un codeur MESA. PNCconf gère une manivelle paraxe ou une manivelle partagée entre les axes. Il permet la sélection des vitesses de jog en utilisant un commutateur rotatif. L'option de sélection des incréments de jog utilise le composant mux16. Ce composant dispose d'options telles que l'anti-rebond et l'utilisation du code Gray pour filtrer l'entrée physique du commutateur.

source: Overrides:: PNCconf allows overrides of feedrates and/or spindle speed using a pulse generator (MPG) or switches (eg. rotary).
fr: Correcteurs de vitesses:: PNCconf permet de modifier les vitesses d'avances ou de broche en utilisant une manivelle à impulsions ou un commutateur rotatif.

source: == GUI Configuration
fr: == Configuration des GUI

source: Here you can set defaults for the display screens, add virtual control panels (VCP), and set some LinuxCNC options..
fr: Ici, il est possible de configurer l'interface graphique (GUI), lui ajouter des panneaux de commande virtuels (VCP) et définir certaines options de LinuxCNC.

source: .GUI Configuration
fr: .Configuration des GUI

source: image::images/pncconf-gui.png[]
fr: image::images/pncconf-gui_fr.png[]

source: Frontend GUI Options::
fr: Options des interfaces graphiques::

source: The default options allows general defaults to be chosen for any display screen. + AXIS defaults are options specific to AXIS. If you choose size , position or force maximize options then PNCconf will ask if it's alright to overwrite a preference file (.axisrc). Unless you have manually added commands to this file it is fine to allow it. Position and force max can be used to move AXIS to a second monitor if the system is capable. + Touchy defaults are options specific to Touchy. Most of Touchy's options can be changed while Touchy is running using the preference page. Touchy uses GTK to draw its screen, and GTK supports themes. Themes controls the basic look and feel of a program. You can download themes from the net or edit them yourself. There are a list of the current themes on the computer that you can pick from. To help some of the text to stand out PNCconf allows you to override the Themes's defaults. The position and force max options can be used to move Touchy to a second monitor if the system is capable.
fr: Valeurs communes par défaut, permet de fixer des valeurs générales par défaut, communes à toutes les interfaces graphiques. Les options par défaut spécifiques à d'AXIS. Si une des options 'Taille', 'Position' ou 'Forcer à maximiser' et choisie, PNCconf demandera si il peut écraser le fichier de préférences (.Axisrc). Ce qui écrasera les données qui aurait été ajoutées extérieurement dans ce fichier. 'Position' et 'force Max' peuvent être utilisés pour déplacer AXIS sur un second moniteur si le système le supporte. Les options par défaut spécifiques à Touchy. La plupart des options de Touchy peuvent être modifiées dans la page des préférences de l'application même quand elle est en marche. Touchy utilise GTK pour dessiner son écran, et supporte les thèmes GTK. Les thèmes GTK modifient l'apparence et l'ergonomie du programme. Il est possible de télécharger des thèmes depuis le net ou de les modifier soit-même. Il y a déjà une liste des thèmes GTK utilisables sur le système. PNCconf permet de modifier facilement le thème par défaut. Les options 'Position' et 'Force max' peuvent être utilisées pour déplacer Touchy sur un second écran, si le système le supporte.

source: VCP options::
fr: Panneaux de contrôle virtuels::

source: Virtual Control Panels allow one to add custom controls and displays to the screen. AXIS and Touchy can integrate these controls inside the screen in designated positions. There are two kinds of VCPs - pyVCP which uses 'Tkinter' to draw the screen and GLADE VCP that uses 'GTK' to draw the screen.
fr: Les panneaux de contrôle virtuels (VCP), permettent d'ajouter des contrôles et des afficheurs personnalisés. AXIS et Touchy peuvent intégrer ces contrôles dans une zone déterminée de leur écran. Il y a deux sortes de panneaux de contrôle (VCP), pyVCP qui utilise 'Tkinter' pour dessiner l'écran ou GLADE VCP qui utilise 'GTK'.

source: PyVCP:: PyVCPs screen XML file can only be hand built. PyVCPs fit naturally in with AXIS as they both use TKinter. + HAL pins are created for the user to connect to inside their custom HAL file. There is a sample spindle display panel for the user to use as-is or build on. You may select a blank file that you can later add your controls 'widgets' to or select a spindle display sample that will display spindle speed and indicate if the spindle is at requested speed. + PNCconf will connect the proper spindle display HAL pins for you. If you are using AXIS then the panel will be integrated on the right side. If not using AXIS then the panel will be separate 'stand-alone' from the frontend screen. + You can use the geometry options to size and move the panel, for instance to move it to a second screen if the system is capable. If you press the 'Display sample panel' button the size and placement options will be honoured.
fr: PyVCP:: PyVCP est un écran construit par un fichier XML qui ne peut pas être construit à la main. Les PyVCP s'intègrent naturellement avec AXIS car ils utilisent tous les deux Tkinter. Des 'HAL pins' sont créées pour que l'utilisateur puisse les connecter dans son fichier HAL personnalisé. Ce sont des organes de panneau de contrôle que l'utilisateur peut utiliser tel quel ou les reconstruire à son goût. Sélectionner un fichier vide dans lequel les contrôles (widgets) personnels seront enregistrés ou sélectionner un des modèles d'affichage prêts à l'emploi. PCCcong établira alors lui-même les bonnes connexions avec HAL. Si AXIS est utilisé, le panneau sera intégré sur le côté droit. Si AXIS n'est pas utilisé, le panneau sera autonome et distinct de l'écran frontal. Il est possible d'utiliser les options de géométrie et de dimensions et de déplacer le panneau vers un second écran si le système le permet. Si le bouton 'Ouvrir un panneau simple' est pressé, les données de géométrie et de dimensions seront utilisées et le panneau affiché.

source: GLADE VCP:: GLADE VCPs fit naturally inside of TOUCHY screen as they both use GTK to draw them, but by changing GLADE VCP's theme it can be made to blend pretty well in AXIS. (try Redmond) + It uses a graphical editor to build its XML files. HAL pins are created for the user to connect to, inside of their custom HAL file. + GLADE VCP also allows much more sophisticated (and complicated) programming interaction, which PNCconf currently doesn't leverage. (see GLADE VCP in the manual) + PNCconf has sample panels for the user to use as-is or build on. With GLADE VCP PNCconf will allow you to select different options on your sample display. + Under 'sample options' select which ones you would like. The zero buttons use HALUI commands which you could edit later in the HALUI section. + Auto Z touch-off also requires the classicladder touch-off program and a probe input selected. It requires a conductive touch-off plate and a grounded conductive tool. For an idea on how it works see: + http://wiki.linuxcnc.org/cgi-bin/wiki.pl?ClassicLadderExamples#Single_button_probe_touchoff + Under 'Display Options', size, position, and force max can be used on a 'stand-alone' panel for such things as placing the screen on a second monitor if the system is capable. + You can select a GTK theme which sets the basic look and feel of the panel. You Usually want this to match the frontend screen. These options will be used if you press the 'Display sample button'. With GLADE VCP depending on the frontend screen, you can select where the panel will display. + You can force it to be stand-alone or with AXIS it can be in the center or on the right side, with Touchy it can be in the center.
fr: GLADE VCP:: Glade VCP s'intègre naturellement à l'intérieur de l'écran TOUCHY car ils utilisent tous les deux GTK pour leurs interfaces, mais en modifiant le thème de GladeVCP il se fond très bien dans AXIS 'essayer Redmond). Il utilise un éditeur graphique pour créer ses fichiers XML. Des 'HAL pins' sont créées, que l'utilisateur pourra connecter dans son fichier HAL personnalisé. GladeVCP permet aussi une interaction de programmation beaucoup plus sophistiquée et complexe, ce qui n'est actuellement pas possible par PNCconf. Voir le chapitre sur: <<cha:GladeVCP, la création d'interfaces graphiques>> PNCconf propose des exemples de panneaux à utiliser tel quel ou à reconstruire. Avec PNCconf, GladeVCP permettra de sélectionner différentes options d'affichage sur le modèle. Sous 'Echantillon d'options' sélectionner les options souhaitées. Les boutons zéro utilisent des commandes HALUI qui pourront être éditées ultérieurement dans la section HALUI. Le bouton 'Toucher Z automatique' nécessite le programme 'Touch-off' de classicladder et que l'entrée de palpeur soit sélectionnée. Il faut aussi un palpeur qui peut être réalisé avec une plaque conductrice reliée à la masse. Pour avoir une idée sur la façon dont cela fonctionne, voir ici: http://wiki.linuxcnc.org/cgi-bin/wiki.pl?ClassicLadderExamples#Single_button_probe_touchoff Sous 'Options d'affichage', les options de géométrie et de dimensions permettent de déplacer le panneau, par exemple vers un second écran, si le système le permet. Sélectionner un thème GTK pour définir l'aspect du panneaux.En général, on le souhaite identique à l'aspect de l'écran frontal. Le panneau créé et ses options seront visibles en appuyant sur le bouton 'Ouvrir un panneau simple'. GladeVCP placé sur l'écran frontal permet de sélectionner la position du panneau sur celui-ci. Il peut fonctionner de manière autonome ou avec AXIS, il peut être au centre ou sur le côté droit, avec Touchy il peut être au centre.

source: Defaults and Options::
fr: Défauts et options::

source: * Require homing before MDI / Running ** If you want to be able to move the machine before homing uncheck this checkbox.
fr: * Prise d'origine requise avant tout mouvement ** Pour pouvoir déplacer la machine sans passer par une recherche du point d'origine machine, décocher la case. Dans ce cas la plus grande vigilance est nécessaire pour ne pas percuter une limite physique.

source: * Popup Tool Prompt ** Choose between an on screen prompt for tool changes or export standard signal names for a User supplied custom tool changer Hal file
fr: * Dialogue pour le changement d'outil ** Permet le choix entre l'utilisation d'un dialogue de changement d'outil et l'exportation d'un signal standard pour utiliser un changeur d'outils automatique externe et la table d'outils.

source: * Leave spindle on during tool change: ** Used for lathes
fr: * Laisser tourner la broche pendant le changement d'outil ** Utilisé sur les tours.

source: Force individual manual homing
fr: Forcer la prise d'origine individuelle en manuel

source: Move spindle up before tool change
fr: Relever la broche avant le changement d'outil

source: * Restore joint position after shutdown ** Used for non-trivial kinematics machines
fr: * Restaurer la position de la jointure après arrêt ** Utilisé pour les machines a cinématique complexe.

source: Random position toolchangers** Used for toolchangers that do not return the tool to the same pocket. You will need to add custom HAL code to support toolchangers.
fr: * Changeur d'outil à position aléatoire ** Utilisé pour les changeurs d'outils qui ne reçoivent pas toujours les outils au mêmes emplacements. Des codes HAL doivent être ajoutés pour le support de ces changeurs d'outils.

source: == Mesa Configuration The Mesa configuration pages allow one to utilize different firmwares. On the basic page you selected a Mesa card here you pick the available firmware and select what and how many components are available.
fr: == Configuration Mesa Les pages de configuration Mesa permettent d'utiliser les différents micros logiciels. Sur la page de configuration de base, si une carte Mesa a été sélectionnée, s'effectue le choix du micro logiciel parmi ceux disponibles, puis le choix et le paramétrage des composants nécessaires à la machine.

source: .Mesa Configuration
fr: .Configuration Mesa

source: image::images/pncconf-mesa-config.png[]
fr: image::images/pncconf-mesa-config_fr.png[]

source: Parport address is used only with Mesa parport card, the 7i43. An onboard parallel port usually uses 0x278 or 0x378 though you should be able to find the address from the BIOS page. The 7i43 requires the parallel port to use the EPP mode, again set in the BIOS page. If using a PCI parallel port the address can be searched for by using the search button on the basic page.
fr: Adresse du port parallèle MESA. Un port parallèle est utilisé seulement avec la carte Mesa 7i43. Les ports parallèles sur la carte mère ont généralement les adresses 0x378 et 0x278, il est possible de trouver l'adresse sur la page du BIOS. La 7i43 nécessite de programmer le port parallèle dans le mode EPP, encore une fois cela se configure dans la page du BIOS. Si un port parallèle sur carte PCI est utilisé, les adresses peuvent être recherchées en utilisant le bouton de recherche sur la page de base de PNCconf.

source: [NOTE] Many PCI cards do not support the EPP protocol properly.
fr: [NOTE] Noter que beaucoup de cartes PCI ne prennent pas en charge le protocole EPP correctement.

source: PDM PWM and 3PWM base frequency sets the balance between ripple and linearity. If using Mesa daughter boards the docs for the board should give recommendations
fr: Fréquence de base PWM, PDM et 3PWM règle l'équilibrage entre entraînement et linéarité. Si des cartes filles Mesa sont utilisées, les documents de celles-ci devraient donner des recommandations.

source: [IMPORTANT] It's important to follow these to avoid damage and get the best performance.
fr: [IMPORTANT] Il est important de les suivre pour éviter des dommages et obtenir les meilleures performances.

source: .... The 7i33 requires PDM and a PDM base frequency of 6 mHz The 7i29 requires PWM and a PWM base frequency of 20 Khz The 7i30 requires PWM and a PWM base frequency of 20 Khz The 7i40 requires PWM and a PWM base frequency of 50 Khz The 7i48 requires UDM and a PWM base frequency of 24 Khz ....
fr: .... La carte 7i33 demande un PDM et une fréquence de base de 6 mHz. La carte 7i29 demande un PWM et une fréquence de base de 20 Khz. La carte 7i30 demande un PWM et une fréquence de base de 20 Khz. La carte 7i40 demande un PWM et une fréquence de base de 50 Khz. La carte 7i48 demande un PWM et une fréquence de base de 24 Khz. ....

source: Watchdog time out is used to set how long the MESA board will wait before killing outputs if communication is interrupted from the computer. Please remember Mesa uses 'active low' outputs meaning that when the output pin is on, it is low (approx 0 volts) and if it's off the output in high (approx 5 volts) make sure your equipment is safe when in the off (watchdog bitten) state.
fr: Délai du chien de garde. Définit le délai durant lequel la carte Mesa va attendre avant de déconnecter les sorties si la communication est interrompue avec l'ordinateur. Les carte Mesa utilisent sur ce contact un niveau actif bas ce qui signifie que lorsque la sortie est activée son niveau logique est à 0 et si la sortie est inactive son niveau logique est à 1 soit environ 5 volts. S'assurer que l'équipement est en sécurité quand le chien de garde est déclenché.

source: You may choose the number of available components by deselecting unused ones. Not all component types are available with all firmware.
fr: Il est possible de choisir les composants en dé-sélectionnant ceux qui sont inutilisés. Les types de composants disponibles varient selon le micro logiciel et les cartes installées.

source: Choosing less then the maximum number of components allows one to gain more GPIO pins. If using daughter boards keep in mind you must not deselect pins that the card uses. For instance some firmware supports two 7i33 cards, If you only have one you may deselect enough components to utilize the connector that supported the second 7i33. Components are deselected numerically by the highest number first then down with out skipping a number. If by doing this the components are not where you want them then you must use a different firmware. The firmware dictates where, what and the max amounts of the components. Custom firmware is possible, ask nicely when contacting the LinuxCNC developers and Mesa. Using custom firmware in PNCconf requires special procedures and is not always possible - Though I try to make PNCconf as flexible as possible.
fr: Si des composants ne sont pas sélectionnés, des broches GPIO seront gagnées. Si des cartes filles sont utilisées, garder à l'esprit que les pins que les cartes utilisent ne doivent pas être dé-sélectionnées. Par exemple, certain micros logiciels supportent deux cartes 7i33, si une seule est installée, il est possible de dé-sélectionner assez de composants non nécessaires pour utiliser le connecteur qui était prévus pour la seconde 7i33. Les composants sont dé-sélectionnés numériquement en commençant par le plus grand chiffre d'abord, puis en descendant sans en sauter. Si en faisant cela, les composants ne sont pas là où il devraient, alors il faut utiliser un micro logiciel différent. Le micro logiciel impose où, quoi et combien au maximum de composants. Un micro logiciel personnalisé est possible en le demandant gentiment aux développeurs LinuxCNC et Mesa. Les micros logiciels dans PNCconf nécessitent des procédures spéciales et ce n'est pas toujours possible, bien que nous essayons de rendre PNCconf aussi souple que possible.

source: After choosing all these options press the 'Accept Component Changes' button and PNCconf will update the I/O setup pages. Only I/O tabs will be shown for available connectors, depending on the Mesa board.
fr: Après avoir choisi toutes les options, appuyer sur le bouton 'Accepter le changement de composants' et PNCconf mettra à jour les pages de configuration des E/S. Seuls les onglets nécessaires seront affichés pour les connexions disponibles, selon les cartes Mesa.

source: == Mesa I/O Setup The tabs are used to configure the input and output pins of the Mesa boards. PNCconf allows one to create custom signal names for use in custom HAL files.
fr: == Réglages des E/S Mesa Les onglets sont utilisés pour configurer les broches d'entrée et de sortie des cartes Mesa. PNCconf permet de créer des noms de signaux personnalisés à utiliser dans les fichiers de HAL personnalisés.

source: .Mesa I/O C2
fr: .Réglages des E/S Mesa C2

source: image::images/pncconf-mesa-io2.png[]
fr: image::images/pncconf-mesa-io2_fr.png[]

source: On this tab with this firmware the components are setup for a 7i33 daughter board, usually used with closed loop servos. Note the component numbers of the encoder counters and PWM drivers are not in numerical order. This follows the daughter board requirements.
fr: Sur cet onglet, avec ce micro logiciel, les composants sont liés à l'installation d'une carte fille 7i33, généralement utilisée avec des servomoteurs en boucle fermée. Noter que les numéros de composant des codeurs et des pilotes PWM ne sont pas dans l'ordre numérique. Cela fait suite aux exigences de l'architecture des cartes filles.

source: .Mesa I/O C3
fr: .Réglages des E/S Mesa C3

source: image::images/pncconf-mesa-io3.png[]
fr: image::images/pncconf-mesa-io3_fr.png[]

source: On this tab all the pins are GPIO. Note the 3 digit numbers - they will match the HAL pin number. GPIO pins can be selected as input or output and can be inverted.
fr: Sur cet onglet, il n'y a que des broches GPIO. Noter les numéros à trois chiffres, ils correspondent au numéros des 'HAL pins'. Les broches GPIO peuvent être sélectionnées comme des entrées ou des sorties et elles peuvent être inversées.

source: .Mesa I/O C4
fr: .Réglages des E/S Mesa C4

source: image::images/pncconf-mesa-io4.png[]
fr: image::images/pncconf-mesa-io4_fr.png[]

source: On this tab there are a mix of step generators and GPIO. Step generators output and direction pins can be inverted. Note that inverting a Step Gen-A pin (the step output pin) changes the step timing. It should match what your controller expects.
fr: Sur cet onglet, il y a un mélange entre des broches GPIO et des générateurs de pas. Les sorties générateur de pas et de direction peuvent être inversées. Noter que l'inversion d'un signal Step Gen modifie les délais de pas, il doivent correspondre à ce que le contrôleur attend.

source: == Parport configuration
fr: == Configuration des ports parallèles

source: image::images/pncconf-parport.png[]
fr: image::images/pncconf-parport_fr.png[]

source: The parallel port can be used for simple I/O similar to Mesa's GPIO pins.
fr: Les ports parallèles peuvent être utilisés pour de simples E/S similaires aux broches GPIO Mesa.

source: == Axis Configuration
fr: == Configuration des axes

source: .Axis Drive Configuration
fr: .Configuration des axes

source: image::images/pncconf-axis-drive.png[]
fr: image::images/pncconf-axis-drive_fr.png[]

source: This page allows configuring and testing of the motor and/or encoder combination . If using a servo motor an open loop test is available, if using a stepper a tuning test is available.
fr: Cette page permet de configurer et tester un moteur combiné ou non à un codeur. Si un servomoteur est utilisé, un test en boucle ouverte est disponible. si un moteur pas à pas est utilisé, un test de réglage est disponible.
