Repository: 0000duck/linuxcnc
Catalog: docs/src/getting-started/pncconf.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = Mesa Configuration Wizard
fr: = Assistant de configuration Mesa

source: [[cha:PNCconf-wizard]] (((Point n Click Configuration Wizard))) (((Mesa Configuration Wizard)))
fr: [[cha:Assistant-graphique-PNCconf]] (((Assistant graphique de configuration Mesa PNCconf)))

source: PNCconf is made to help build configurations that utilize specific Mesa 'Anything I/O' products.
fr: L'assistant de configuration PNCconf couvre toute la gamme des produits Mesa,quel que soit le nombre d'entrées/sorties.

source: It can configure closed loop servo systems or hardware stepper systems. It uses a similar 'wizard' approach as Stepconf (used for software stepping, parallel port driven systems).
fr: Il est destiné à la configuration de systèmes à servomoteurs en boucle fermée ou de systèmes à moteurs pas à pas avec pilotage matériel externe. Il utilise assistant similaire à celui de StepConf (utilisé pour configurer le pilotage logiciel des moteurs pas à pas).

source: PNCconf is still in a development stage (Beta) so there are some bugs and lacking features. Please report bugs and suggestions to the LinuxCNC forum page or mail-list.
fr: PNCconf en est encore au stade du développement (Beta) il peut exister quelques bogues et manques de fonctionnalités. Merci de rapporter les bogues et les suggestions sur le forum ou par courriel à la liste de diffusion.

source: There are two trains of thought when using PNCconf:
fr: Il y a deux manières d'utiliser PNCconf:

source: One is to use PNCconf to always configure your system - if you decide to change options, reload PNCconf and allow it to configure the new options. This will work well if your machine is fairly standard and you can use custom files to add non standard features. PNCconf tries to work with you in this regard.
fr: La première consiste à l'utiliser pour configurer le système et si, par la suite, certaines options doivent être modifiées, il suffira alors de recharger PNCconf et d'apporter les modifications. Cela fonctionne bien si la machine est assez standard et il est possible d'ajouter à la main des fonctionnalités non standard. PNCconf tente de travailler avec vous en ce sens.

source: The other is to use PNCconf to build a config that is close to what you want and then hand edit everything to tailor it to your needs. This would be the choice if you need extensive modifications beyond PNCconf's scope or just want to tinker with / learn about LinuxCNC
fr: La seconde consiste à l'utiliser pour construire une configuration la plus proche possible de ce qui est souhaité, puis de la modifier à la main pour l'adapter aux besoins. C'est le bon choix si les besoins de modifications vont au-delà des possibilités de PNCconf ou pour expérimenter et en apprendre plus sur LinuxCNC.

source: You navigate the wizard pages with the forward, back, and cancel buttons there is also a help button that gives some help information about the pages, diagrams and an output page.
fr: Il est possible de naviguer dans l'assistant, revenir sur des pages, annuler des choix, obtenir de l'aide et des diagrammes puis enfin, de valider la configuration par la page de sortie du programme.

source: TIP: PNCconf's help page should have the most up to date info and has additional details.
fr: TIP: La page d'aide de PNCconf contient les dernières informations et des détails additionnels.

source: == Step by Step Instructions
fr: == Instructions pas à pas

source: .PnCConf Splash
fr: .Écran d'accueil

source: image::images/pncconf-splash.png[]
fr: image::images/pncconf-splash_fr.png[]

source: == Create or Edit
fr: == Créer ou éditer

source: This allows you to select a previously saved configuration or create a new one. If you pick 'Modify a configuration' and then press next a file selection box will show. Pncconf preselects your last saved file. Choose the the config you wish to edit. It also allows you to select desktop shortcut / launcher options. A desktop shortcut will place a folder icon on the desktop that points to your new configuration files. Otherwise you would have to look in your home folder under linuxcnc/configs.
fr: Il est possible de créer une nouvelle configuration ou d'en modifier une existante. Si 'Modifier une configuration existante' est choisi, suivi d'un clic sur 'Suivant', un sélecteur de fichier apparaît pour choisir la configuration à modifier. Par défaut, PNCconf présélectionne le dernier fichier enregistré. Il est possible de cocher les options 'Créer un lien sur le bureau', qui créera un raccourci sur le bureau pointant sur cette nouvelle configuration, ou sur 'Créer un lanceur', qui créera un lien et une icône de dossier sur le bureau, ce lien lancera LinucCNC avec cette configuration. Autrement, le nouveau fichier de configuration se trouvera dans le dossier '~/linuxcnc/configs'.

source: A Desktop launcher will add an icon to the desktop for starting your config directly. You can also launch it under Applications/CNC/LinuxCNC and selecting your config name.
fr: Il est toujours possible de lancer LinuxCNC normalement puis de sélectionner la configuration souhaitée dans la liste.

source: == Basic Machine Information
fr: == Informations machine

source: .PnCConf Basic
fr: .Informations machine

source: image::images/pncconf-basic.png[]
fr: image::images/pncconf-basic_fr.png[]

source: Machine Basics:: If you use a name with spaces PNCconf will replace the spaces with underscore (as a loose rule Linux doesn't like spaces in names) Pick an axis configuration - this selects what type of machine you are building and what axes are available. The Machine units selector allows data entry of metric or imperial units in the following pages.
fr: Nom de la machine:: Préciser ici le nom de la machine à configurer, les espaces dans les noms seront remplacés par des *'_'* (en règle générale, Linux n'aime pas les espaces dans les noms de fichiers). Choisir une configuration d'axes - Cette liste déroulante précise le type de machine et le nombre d'axes. Le sélecteur d'unités machine définit quelle unité sera utilisée dans les pages suivantes et par la machine, pouce ou millimètre.

source: TIP: Defaults are not converted when using metric so make sure they are sane values!
fr: TIP: Les valeurs introduites dans cet assistant ne sont pas converties automatiquement dans l'unité choisie ici, bien vérifier toutes ces valeurs.

source: Computer Response Time::
fr: Temps de réponse de l'ordinateur::

source: The servo period sets the heart beat of the system. Latency refers to the amount of time the computer can be longer then that period. Just like a railroad, LinuxCNC requires everything on a very tight and consistent time line or bad things happen. LinuxCNC requires and uses a 'real time' operating system, which just means it has a low latency ( lateness ) response time when LinuxCNC requires its calculations and when doing LinuxCNCs calculations it cannot be interrupted by lower priority requests (such as user input to screen buttons or drawing etc). + Testing the latency is very important and a key thing to check early. Luckily by using the Mesa card to do the work that requires the fastest response time (encoder counting and PWM generation) we can endure a lot more latency then if we used the parallel port for these things. The standard test in LinuxCNC is checking the BASE period latency (even though we are not using a base period). If you press the 'test base period jitter' button, this launches the latency test window ( you can also load this directly from the applications/cnc panel ). The test mentions to run it for a few minutes but the longer the better. consider 15 minutes a bare minimum and overnight even better. At this time use the computer to load things, use the net, use USB etc we want to know the worst case latency and to find out if any particular activity hurts our latency. We need to look at base period jitter. Anything under 20000 is excellent - you could even do fast software stepping with the machine 20000 - 50000 is still good for software stepping and fine for us. 50000 - 100000 is really not that great but could still be used with hardware cards doing the fast response stuff. So anything under 100000 is useable to us. If the latency is disappointing or you get a bad hiccup periodically you may still be able to improve it.
fr: La période servo règle l'horloge du système. La latence donne la variation de cette horloge. LinuxCNC demande une chronologie serrée et cohérente, sinon des problèmes surviendront. LinuxCNC requiert et utilise un système d'exploitation temps réel, ce qui signifie qu'il a une latence très faible et un temps de réponse très court. Les événements arrivent avec précision dans le temps quand LinuxCNC nécessite pour ses calculs, de ne pas être interrompu par des demandes de priorité inférieure (interruptions) comme des saisies au clavier ou des demandes d'affichage. Le test de latence est très important, il est un élément clef qui doit être effectué au plus tôt. Heureusement les cartes Mesa se chargent des tâches critiques en temps de réponse, comme le comptage d'impulsions, la génération de PWM et cela leur permet de supporter une latence supérieure à celle d'un système utilisant les ports parallèles de la carte mère. Le test standard dans LinuxCNC, consiste à vérifier la latence de base du PC. Un appui sur le bouton 'Test de latence' lancera le test de latence, il est également possible de le lancer depuis le menu 'application → cnc → latency test'. Une fenêtre s'ouvre dans laquelle s'affichent les temps mesurés. Ce test doit fonctionner plusieurs minutes, en fait, le plus longtemps possible. 15 minutes est un minimum. Pendant le test, essayer d'utiliser le plus possible l'ordinateur, le réseau, le port USB, les disques durs, l'affichage. Observer et noter si une action particulière dégrade le temps de latence. A la fin, la latence de base, la valeur 'base period jitter', sera affichée. Une valeur en dessous de 20000 est excellente et permet une génération rapide des impulsions de pas avec cette machine. 20000 à 50000 est assez bon pour la génération de pas. 50000 à 100000 ce n'est pas très bon mais la machine peu encore servir pour la génération de pas avec une carte ayant des temps de réponse courts. Plus grand que 100000, disqualifie la machine pour cette fonction, une carte extérieure est alors indispensable. Si la latence est médiocre ou si des problèmes intermittents surviennent régulièrement il sera toujours possible de l'améliorer.

source: TIP: There is a user compiled list of equipment and the latency obtained on the LinuxCNC wiki : http://wiki.linuxcnc.org/cgi-bin/wiki.pl?Latency-Test Please consider adding your info to the list. Also on that page are links to info about fixing some latency problems.
fr: TIP: Il y a une liste d'équipements et de leurs temps de latence sur le wiki. http://wiki.linuxcnc.org/cgi-bin/wiki.pl?Latency-Test SVP, pensez à ajouter vos infos à la liste. Sur cette page il y a des liens vers des informations pour résoudre certains problèmes de latence.

source: Now we are happy with the latency and must pick a servo period. In most cases a servo period of 1000000 ns is fine ( that gives a 1 kHz servo calculation rate - 1000 calculations a second) if you are building a closed loop servo system that controls torque (current) rather then velocity (voltage) a faster rate would be better - something like 200000 (5 kHz calculation rate). The problem with lowering the servo rate is that it leaves less time available for the computer to do other things besides LinuxCNC's calculations. Typically the display (GUI) becomes less responsive. You must decide on a balance. Keep in mind that if you tune your closed loop servo system then change the servo period you probably will need to tune them again.
fr: Maintenant que nous avons un temps de latence acceptable nous devons choisir une période d'asservissement (Période servo actuelle). Dans la plupart des cas une période d'asservissement de 1000000ns est bonne, cela donne un taux de calcul de 1 kHz soit 1000 calculs par seconde. Si le système d'asservissement est construit en boucle fermée avec contrôle de couple (intensité) plutôt que de vitesse (tension) le taux sera meilleur, quelque chose comme 5000 calculs par seconde (5 kHz). Le problème avec l'abaissement de la période, c'est qu'elle laisse moins de temps disponible à l'ordinateur pour faire d'autres choses. Typiquement la réponse de l'affichage (GUI) est moins bonne. Il faut choisir un équilibre. Garder à l'esprit que sur un mécanisme en boucle fermée, une modification de la période d'asservissement nécessitera de réajuster l'ensemble des paramètres de la boucle.

source: I/O Control Ports/Boards:: PNCconf is capable of configuring machines that have up to two Mesa boards and three parallel ports. Parallel ports can only be used for simple low speed (servo rate) I/O.
fr: Ports et cartes d'entrées/sorties:: PNCconf est capable de configurer une machines avec deux cartes Mesa et trois ports parallèles. Les ports parallèles ne sont utilisables que pour des actions simples et peu rapide.

source: Mesa:: You must choose at least one Mesa board as PNCconf will not configure the parallel ports to count encoders or output step or PWM signals. The mesa cards available in the selection box are based on what PNCconf finds for firmware on the systems. There are options to add custom firmware and/or 'blacklist' (ignore) some firmware or boards using a preference file. If no firmware is found PNCconf will show a warning and use internal sample firmware - no testing will be possible. One point to note is that if you choose two PCI Mesa cards there currently is no way to predict which card is 0 and which is 1 - you must test - moving the cards could change their order. If you configure with two cards both cards must be installed for tests to function.
fr: Mesa:: Au moins une carte Mesa doit être choisie. PNCconf ne peut pas configurer les ports parallèles pour des codeurs, des signaux de pas ou pour la génération de signaux PWM. La liste de sélection des cartes Mesa présentes dans la liste de sélection est construite selon les micros logiciels des cartes trouvées sur le système. Il existe des options permettant d'ajouter des micros logiciels personnalisés ou pour ignorer (blacklister) certaines versions de micros logiciels ou certaines cartes, en utilisant un fichier de préférences. Si aucune carte n'est détectée PNCconf affichera un avertissement et utilisera des valeurs par défaut mais aucun test ne sera possible. Il faut noter que, si plusieurs cartes Mesa sont utilisées, il n'existe aucun moyen de déterminer laquelle sera la carte N°0 ou N°1 et il sera indispensable de le tester. Déplacer les cartes dans les ports PCI, peut changer leur ordre. Si la configuration est créée pour deux cartes, elles doivent être installées pour que les tests fonctionnent.

source: Parallel Port:: Up to 3 parallel ports (referred to as parports) can be used as simple I/O. You must set the address of the parport. You can either enter the Linux parallel port numbering system (0,1,or 2) or enter the actual address. The address for an on board parport is often 0x0278 or 0x0378 (written in hexadecimal) but can be found in the BIOS page. The BIOS page is found when you first start your computer you must press a key to enter it (such as F2). On the BIOS page you can find the parallel port address and set the mode such as SPP, EPP, etc on some computers this info is displayed for a few seconds during start up. For PCI parallel port cards the address can be found by pressing the 'parport address search' button. This pops up the help output page with a list of all the PCI devices that can be found. In there should be a reference to a parallel port device with a list of addresses. One of those addresses should work. Not all PCI parallel ports work properly. Either type can be selected as 'in' (maximum amount of input pins) or 'out' (maximum amount of output pins)
fr: Ports parallèles:: Jusqu'à 3 ports parallèles, appelés parports par Mesa, peuvent être utilisés comme de simples entrées/sorties. L'adresse du port parallèle doit être définie. Il est possible soit d'entrer le N° du port parallèle selon le système de numérotation de Linux 0, 1, 2 ou, d'entrer l'adresse réelle en hexadécimal. Les adresses des ports parallèles intégrés à la carte mère son le plus souvent aux adresses 0x0378 et 0x0278, elles peuvent être trouvées dans la configuration du BIOS. Le Bios s'ouvre en enfonçant une touche du clavier au tout début du cycle de démarrage de l'ordinateur, souvent (Del ou F2) se reporter au document de la carte mère. Sur une des pages du BIOS, il est possible de choisir l'adresse des ports parallèles et de définir leurs modes de fonctionnement comme SPP, EPP, etc, sur certains ordinateurs cette information est affichée pendant quelques secondes lors du démarrage du PC. Pour les ports parallèles sur carte PCI les adresses sont trouvées en cliquant sur le bouton 'Outil d'aide à la recherche d'adresse de ports parallèles' qui affichera la liste des périphériques PCI découverts. Dans cette liste, se trouvera une référence aux ports parallèles avec une liste d'adresses. Une de ces adresses doit fonctionner. Noter que tous les ports parallèles PCI ne fonctionnent pas correctement en EPP. Chaque port peut être sélectionné comme 'Entrée' pour augmenter le nombre d'entrées sur ce port ou 'Sortie' pour un maximum de sorties. Par défaut, les ports parallèles sont configurés avec leurs broches 2 à 9 en 'Sortie'.

source: GUI Frontend list:: This specifies the graphical display screens LinuxCNC will use. Each one has different option.
fr: Liste des interfaces graphiques:: Spécifie les interfaces graphiques que LinuxCNC peut utiliser. Chacune dispose d'options particulières.

source: fully supports lathes.
fr: Supporte les tours.

source: is the most developed and used frontend
fr: C'est l'interface la plus utilisée et la plus développée.

source: is designed to be used with mouse and keyboard
fr: Elle est conçue pour être utilisée à la souris est avec un clavier.

source: * is tkinter based so integrates PYVCP (python based virtual control panels) naturally. * has a 3D graphical window. * allows VCP integrated on the side or in center tab
fr: * Elle est basée sur tkinter et intègre donc PYVCP (contrôle visuel python). * Elle dispose d'un affichage graphique en 3D. * Elle est intégrable sur les barres de tâches ou sur le bureau.

source: * Touchy was designed to be used with a touchscreen, some minimal physical switches and a MPG wheel. * requires cycle-start, abort, and single-step signals and buttons * It also requires shared axis MPG jogging to be selected. * is GTK based so integrates GLADE VCP (virtual control panels) naturally. * allows VCP panels integrated in the center Tab * has no graphical window * look can be changed with custom themes
fr: * Touchy est une interface conçue pour les écrans tactiles, quelques interrupteurs et une manivelle de jog. * Elle nécessite les boutons et voyants 'Départ cycle', 'Abandon', 'Marche par pas'. * Elle nécessite également un sélecteur d'axe sur la manivelle. * Elle est basée sur GTK et intègre naturellement GladeVCP (création de panneaux de contrôle). * Elle permet d'intégrer les panneaux de contrôle virtuels (VCP). * Elle n'a pas de fenêtre graphique. * L'aspect peut être modifié avec des thèmes personnalisés.

source: standard on OEM Sherline machines
fr: Est fourni en standard sur les machines Sherline.

source: does not use Estop
fr: N'utilise pas d'arrêt d'urgence (ESTOP).

source: no VCP integration
fr: Pas de possibilité d'intégrer un panneau de contrôle.

source: hi contrast bright blue screen
fr: Contraste élevé grâce à un fond bleu.

source: separate graphics window
fr: Fenêtre graphique séparée.

source: == External Configuration
fr: == Contrôles externes

source: This page allows you to select external controls such as for jogging or overrides.
fr: Cette page permet de sélectionner des contrôles externes pour la commande manuelle de déplacement des axes (jog) ou des curseurs pour les correcteurs de vitesse.

source: .GUI External
fr: .Contrôles externes

source: image::images/pncconf-external.png[]
fr: image::images/pncconf-external_fr.png[]

source: If you select a Joystick for jogging, You will need it always connected for LinuxCNC to load. To use the analog sticks for useful jogging you probably need to add some custom HAL code. MPG jogging requires a pulse generator connected to a MESA encoder counter. Override controls can either use a pulse generator (MPG) or switches (such as a rotary dial). External buttons might be used with a switch based OEM joystick.
fr: Si une manette de jeu externe est sélectionnée pour le jog, il faudra toujours la connecter à LinuxCNC avant de démarrer celui-ci. Si la manette est analogique il faudra probablement ajouter du code personnalisé à HAL. Les manivelles de jog à vernier et micro impulsion nécessitent d'être connectées à une carte Mesa sur un compteur de codeur. Pour les correcteurs de vitesses externe il est possible d'utiliser un mécanisme à générateur d'impulsions ou à commutation comme un commutateur rotatif. Les boutons externes peuvent être ceux d'une manette de jeu.

source: Joystick jogging:: Requires a custom 'device rule' to be installed in the system. This is a file that LinuxCNC uses to connect to LINUX's device list. PNCconf will help to make this file. + 'Search for device rule' will search the system for rules, you can use this to find the name of devices you have already built with PNCconf. + 'Add a device rule' will allow you to configure a new device by following the prompts. You will need your device available. + 'test device' allows you to load a device, see its pin names and check its functions with halmeter. + joystick jogging uses HALUI and hal_input components.
fr: Joystick USB pour le jog:: Demande des réglages spécifiques personnalisés pour être installé dans le système. Il s’agit d'un fichier qui est utilisé par LinuxCNC pour se connecter à la liste des périphériques Linux. PNCconf aidera à la construction de ce fichier. 'Rechercher règles pour le dispositif', va rechercher les règles dans le système, utilisable pour trouver le nom des périphériques déjà construits avec PNCconf. 'Ajouter règle dispositif', s'utilise pour configurer un nouveau périphérique en suivant les instructions. Le périphérique doit être branché et disponible. 'test dispositif', permet de charger un périphérique, d'afficher les noms de ses broches et de visualiser ses fonctions avec l’outil halmeter. Les manettes de jeu utilisées en jog utilisent HALUI et les composants hal_input.

source: External buttons:: allows jogging the axis with simple buttons at a specified jog rate. Probably best for rapid jogging.
fr: Boutons de jog externes:: Permet de déplacer les axes avec de simples boutons à une vitesse spécifiée. Probablement mieux adapté pour le jog en vitesse rapide.
