Repository: 0000duck/linuxcnc
Catalog: docs/src/getting-started/pncconf.*.po
Languages: fr

source: Open Loop Test:: An open loop test is important as it confirms the direction of the motor and encoder. The motor should move the axis in the positive direction when the positive button is pushed and also the encoder should count in the postie direction. The axis movement should follow the Machinery's Handbook footnote:["axis nomenclature" in the chapter "Numerical Control" in the "Machinery's Handbook" published by Industrial Press.] standards or AXIS graphical display will not make much sense. Hopefully the help page and diagrams can help figure this out. Note that axis directions are based on TOOL movement not table movement. There is no acceleration ramping with the open loop test so start with lower DAC numbers. By moving the axis a known distance one can confirm the encoder scaling. The encoder should count even without the amp enabled depending on how power is supplied to the encoder. + WARNING: If the motor and encoder do not agree on counting direction then the servo will run away when using PID control. + Since at the moment PID settings can not be tested in PNCconf the settings are really for when you re-edit a config - enter your tested PID settings. + DAC scaling, max output and offset are used to tailor the DAC output.
fr: Test en boucle ouverte:: Le test en boucle ouverte est important car il confirme la bonne direction du moteur et du codeur. Le moteur doit se déplacer dans le sens positif sur l'axe lorsque le bouton est pressé dans le sens positifs et aussi le codeur doit compter dans le même sens. Le mouvement de l'axe doit suivre les normes conventionnelles des machine-outil, sinon l'affichage graphique de l'axe n'aura pas de sens. Espérons que la page d'aide et le diagramme vous aideront à comprendre cela. Noter que les directions des axes sont celles du mouvement de l'outil et non celle du mouvement de la table. Il n'y a pas de rampe d'accélération lors du test en boucle ouverte, il convient donc de commencer avec une valeur faible du DAC. Déplacer l'axe sur une distance connue, confirmera la bonne mise à l'échelle du codeur. Le codeur doit compter dans le même sens, même sans la puissance sur le moteur, mais cela dépend de la manière dont le codeur est alimenté. WARNING: Si le moteur et le codeur ne comptent pas dans le même sens, le servomoteur sera incontrôlable et s'emballera lors de l'utilisation en boucle fermée sous régulation PID. Pour le moment les paramètres PID ne peuvent pas être testés dans PNCconf, ces réglages sont vraiment, pour quand vous rééditerez une configuration pour y mettre vos paramètres PID testés... Échelle du DAC, deux valeurs de mise à l'échelle, 'Max Output' et 'Offset' sont utilisées pour linéariser le DAC.

source: Compute DAC:: These two values are the scale and offset factors for the axis output to the motor amplifiers. The second value (offset) is subtracted from the computed output (in volts), and divided by the first value (scale factor), before being written to the D/A converters. The units on the scale value are in true volts per DAC output volts. The units on the offset value are in volts. These can be used to linearize a DAC. + Specifically, when writing outputs, the LinuxCNC first converts the desired output in quasi-SI units to raw actuator values, e.g., volts for an amplifier DAC. This scaling looks like: The value for scale can be obtained analytically by doing a unit analysis, i.e., units are [output SI units]/[actuator units]. For example, on a machine with a velocity mode amplifier such that 1 volt results in 250 mm/sec velocity, Note that the units of the offset are in machine units, e.g., mm/sec, and they are pre-subtracted from the sensor readings. The value for this offset is obtained by finding the value of your output which yields 0.0 for the actuator output. If the DAC is linearized, this offset is normally 0.0. + The scale and offset can be used to linearize the DAC as well, resulting in values that reflect the combined effects of amplifier gain, DAC non-linearity, DAC units, etc. To do this, follow this procedure:
fr: Calcul du DAC:: Les deux valeurs sont les facteurs d'échelle et d'offset de la sortie vers l’amplificateur moteur de l'axe. La deuxième valeur, l'offset, est soustraite de la sortie calculée (en Volts) et divisée par la première valeur (le facteur d'échelle), avant d'être écrite dans le DAC. La valeur d'échelle (Scale) s'exprime en Volts/Volts de sortie du DAC. Le décalage (offset) s'exprime en Volts. Elles peuvent être utilisées pour linéariser le DAC. Plus précisément, lors de l'écriture des sorties, LinuxCNC convertit d'abord la valeur effective de la sortie concernée, qui est en quasi-unités SI, en valeurs brute d'actionneur. Par exemple, des Volts pour un amplificateur DAC. La valeur de l'échelle peut être obtenue en analysant l'unité, c'est-à-dire en déterminant le rapport [sortie unités SI]/[unités actionneur]. Par exemple, sur une machine avec un amplificateur en mode vitesse, qui fourni 1 Volt pour une vitesse résultante de 250 mm/s. Noter que les unités de l'offset sont en unités machine, ici des mm/s et qu'elles sont pré-soustraites des lectures capteur. La valeur de cet offset est obtenue en trouvant la valeur de sortie qui donne 0,0 sur la sortie de l'actionneur. Si le DAC est linéarisé, cet offset est normalement de 0,0. L'échelle et l'offset peuvent être utilisés pour linéariser le DAC, il en résultera des valeurs qui refléteront les effets combinés du gain de l'amplificateur, de la non-linéarité du DAC, des unités du DAC, etc. Pour faire cela, suivre cette procédure:

source: * Build a calibration table for the output, driving the DAC with a desired voltage and measuring the result:
fr: * Construire une table de calibration pour la sortie, piloter le DAC avec la tension souhaitée et mesurer le résultat:

source: .Output Voltage Measurements
fr: .Mesure des tensions de sortie

source: [cols="^,^",width="50%"] |================== |*Raw* | *Measured* |-10 | *-9.93* | -9 | *-8.83* | 0 | *-0.96* | 1 | *-0.03* | 9 | *9.87* | 10 | *10.07* |==================
fr: [width="50%"] |======================================== |*Sortie brute* | *Mesure* |-10 | *-9.93* | -9 | *-8.83* | 0 | *-0.96* | 1 | *-0.03* | 9 | *9.87* | 10 | *10.07* |========================================

source: Do a least-squares linear fit to get coefficients a, b such that meas=a*raw+b
fr: Par la méthode des moindres carrés, déterminer les coefficients *+a+*, *+b+* tels que *+Mesure=a*Sortiebrute+b+*

source: * Note that we want raw output such that our measured result is identical to the commanded output. This means ** cmd=a*raw+b ** raw=(cmd-b)/a * As a result, the a and b coefficients from the linear fit can be used as the scale and offset for the controller directly.
fr: * Noter que nous voulons une sortie effective telle que la valeur mesurée soit identique à la consigne. Cela signifie ** *+consigne=a*Sortiebrute+b+* ** *+Sortiebrute=(consigne-b)/a+* * Par conséquent, les coefficients *+a+* et *+b+* de l'ajustement linéaire peuvent être utilisés directement comme échelle et offset pour le contrôleur.

source: MAX OUTPUT: The maximum value for the output of the PID compensation that is written to the motor amplifier, in volts. The computed output value is clamped to this limit. The limit is applied before scaling to raw output units. The value is applied symmetrically to both the plus and the minus side.
fr: Valeur maximale de sortie: La valeur maximale pour la sortie de régulation PID qui est écrite sur l'ampli moteur, exprimée en volts. La valeur de sortie calculée est alignée sur cette limite. La limite est appliquée avant la mise à l'échelle des unités de sortie brute. La valeur est appliquée de manière symétrique aux deux limites, positive et négative.

source: *Tuning Test* The tuning test unfortunately only works with stepper based systems. Again confirm the directions on the axis is correct. Then test the system by running the axis back and forth, If the acceleration or max speed is too high you will lose steps. While jogging, Keep in mind it can take a while for an axis with low acceleration to stop. Limit switches are not functional during this test. You can set a pause time so each end of the test movement. This would allow you to set up and read a dial indicator to see if you are loosing steps.
fr: *Test de réglage* Le test de réglage ne fonctionne, malheureusement, qu'avec les systèmes à moteur pas à pas. Encore une fois vérifier que les directions de déplacements sur l'axe sont correctes. Puis tester le système en déplaçant l'axe d’avant en arrière, si l'accélération ou la vitesse maximum sont trop élevées, des pas seront perdus. Attention: Au cours de ce déplacement manuel, garder à l'esprit que la distance d’arrêt est inversement proportionnelle à l’accélération et qu'avec une accélération faible il faut du temps et de la distance pour arrêter l’axe. Les fins de course ne sont pas fonctionnels pendant ce test. Un temps de pause peut être défini entre chaque mouvement d'essai. Cela permet de vérifier la position de l’axe et de voir si des pas sont perdus.

source: *Stepper Timing* Stepper timing needs to be tailored to the step controller's requirements. Pncconf supplies some default controller timing or allows custom timing settings . See http://wiki.linuxcnc.org/cgi-bin/wiki.pl?Stepper_Drive_Timing for some more known timing numbers (feel free to add ones you have figured out). If in doubt use large numbers such as 5000 this will only limit max speed.
fr: *Timing des moteur pas à pas* La séquence de signaux des sorties pas a pas, doit être adaptée aux exigences du pilote des moteurs. PNCconf propose par défaut, certaines de ces séquences et il est possible de les personnaliser. . Voir http://wiki.linuxcnc.org/cgi-bin/wiki.pl?Stepper_Drive_Timing pour y trouver des séquences pour le matériel le plus commun (n'hésitez pas à ajouter celles que vous avez expérimenté). En cas de doute utiliser une valeur élevée comme 5000, cela ne fera que limiter la vitesse maximale.

source: *Brushless Motor Control* These options are used to allow low level control of brushless motors using special firmware and daughter boards. It also allows conversion of HALL sensors from one manufacturer to another. It is only partially supported and will require one to finish the HAL connections. Contact the mail-list or forum for more help.
fr: *Contrôle de moteur Brushless* Ces options sont utilisées pour permettre le contrôle bas niveau des moteurs brushless avec un micro logiciel spécial et des cartes filles. Elles permettent également la conversion des capteurs à effet Hall d'un fabricant à l'autre. Ce n'est que partiellement pris en charge et aura besoin d’une intervention pour terminer les connexions de HAL. Contacter la liste de diffusion ou un le forum pour avoir de l'aide.

source: .Axis Scale Calculation
fr: .Calcul de l'échelle d'axe

source: image::images/pncconf-scale-calc.png[]
fr: image::images/pncconf-scale-calc_fr.png[]

source: The scale settings can be directly entered or one can use the 'calculate scale' button to assist. Use the check boxes to select appropriate calculations. Note that 'pulley teeth' requires the number of teeth not the gear ratio. Worm turn ratio is just the opposite it requires the gear ratio. If your happy with the scale press apply otherwise push cancel and enter the scale directly.
fr: Les paramètres d'échelle peuvent être saisis directement ou, on peut utiliser le bouton 'calculer échelle' pour être assisté. Utiliser alors les cases à cocher pour sélectionner les calculs appropriés. Noter que 'Dents des poulies' exige le nombre de dents et non le rapport de réduction. 'Rapport de réduction', le rapport de réduction est exactement le contraire, il exige le rapport entre poulie menante et poulie menée (Entrée/Sortie). Si l'échelle à déjà été calculée manuellement, il est possible de la saisir directement sans passer par l'assistant.

source: .Axis Configuration
fr: .Configuration des axes

source: image::images/pncconf-axis-config.png[]
fr: image::images/pncconf-axis-config_fr.png[]

source: Also refer to the diagram tab for two examples of home and limit switches. These are two examples of many different ways to set homing and limits.
fr: Se référer également à l'onglet diagramme pour deux exemples de disposition des contacts de fin de course d'origine machine et de limites. Ce sont deux exemples parmi les nombreuses façons différentes de placer ces contacts.

source: IMPORTANT: It is very important to start with the axis moving in the right direction or else getting homing right is very difficult!
fr: IMPORTANT: Il est très important de commencer avec l'axe se déplaçant dans la bonne direction sinon l’acquisition du point d'origine est impossible !

source: Remember positive and negative directions refer to the TOOL not the table as per the Machinists handbook.
fr: Se souvenir que les directions positives et négatives se référent toujours à l'outil et jamais à la table.

source: .On a typical knee or bed mill * when the TABLE moves out that is the positive Y direction * when the TABLE moves left that is the positive X direction * when the TABLE moves down that is the positive Z direction * when the HEAD moves up that is the positive Z direction
fr: .Sur une fraiseuse classique * Lorsque l'outil se déplace vers l'opérateur, c'est la direction positive de l'axe Y. * Lorsque l'outil se déplace vers la gauche, c'est la direction négative de l'axe X. * Lorsque la table se déplace vers le bas, c'est la direction positive de l'axe Z. * Lorsque la tête se déplace vers le haut, c'est la direction négative de l'axe Z.

source: .On a typical lathe * when the TOOL moves right, away from the chuck * that is the positive Z direction * when the TOOL moves toward the operator * that is the positive X direction. Some lathes have X * opposite (eg tool on back side), that will work fine but * AXIS graphical display can not be made to reflect this.
fr: .Sur un tour classique * Lorsque l'outil se déplace vers la droite, en s'éloignant du mandrin, c'est le sens positif de l'axe Z. * Lorsque l'outil se déplace vers l'opérateur, c’est le sens positif de l'axe X. * Certains tours ont un axe X opposé, dans ce cas l'outil est à l'arrière, cela fonctionne bien, mais l'affichage graphique d'AXIS ne peut pas refléter cette configuration.

source: When using homing and / or limit switches LinuxCNC expects the HAL signals to be true when the switch is being pressed / tripped. If the signal is wrong for a limit switch then LinuxCNC will think the machine is on end of limit all the time. If the home switch search logic is wrong LinuxCNC will seem to home in the wrong direction. What it actually is doing is trying to BACK off the home switch.
fr: Lorsque des contacts d'origine machine et/ou des contacts de limite sont utilisés, LinuxCNC attend des signaux de HAL au niveaux haut lorsque le contact est actionné. Si le signal d'un fin de course est inversé, LinuxCNC détectera en permanence que la machine est en bout de course. Si la logique de recherche du contact d'origine machine est mauvaise (fichier ini), LinuxCNC lancera la séquence de recherche d'origine machine de l'axe dans la mauvaise direction.

source: Decide on limit switch location.
fr: Décider de l'emplacement des fins de courses.

source: Limit switches are the back up for software limits in case something electrical goes wrong eg. servo runaway. Limit switches should be placed so that the machine does not hit the physical end of the axis movement. Remember the axis will coast past the contact point if moving fast. Limit switches should be 'active low' on the machine. eg. power runs through the switches all the time - a loss of power (open switch) trips. While one could wire them the other way, this is fail safe. This may need to be inverted so that the HAL signal in LinuxCNC in 'active high' - a TRUE means the switch was tripped. When starting LinuxCNC if you get an on-limit warning, and axis is NOT tripping the switch, inverting the signal is probably the solution. (use HALMETER to check the corresponding HAL signal eg. axis.0.pos-lim-sw-in X axis positive limit switch)
fr: Les fins de course de limite d'axe sont au delà des limites logicielles, ils protègent la machine en cas de problème électrique, par exemple, l'emballement d'un servomoteur. Les fins de course doivent être placés de manière à ce que l'axe ne puisse pas percuter une butée mécanique. Attention: si la distance d'activation du contact de fin de course est trop faible, avec l'inertie du mobile il pourra le dépasser. Les fins de course des limites d'axes, doivent être actifs à l'état bas et ils doivent aussi couper la puissance sur l'axe concerné. Le contact doit s'ouvrir à l'activation du fin de course. Utiliser un autre câblage est possible mais il est moins sécurisé. Il peut être nécessaire d'inverser le signal de HAL dans LinuxCNC pour avoir un état actif haut, TRUE signifie que le contact a été activé. Lorsqu'au démarrage de LinuxCNC un avertissement de limite et affiché même si l'axe n'est pas sur un des fins de course, le signal est probablement inversé. Utiliser HALMETER pour vérifier l'état du signal de HAL correspondant, par exemple, axis.0.pos-lim-sw-in, fin de course positif de l'axe X.

source: Decide on the home switch location.
fr: Décider de l'emplacement des contacts d'origine machine.

source: If you are using limit switches You may as well use one as a home switch. A separate home switch is useful if you have a long axis that in use is usually a long way from the limit switches or moving the axis to the ends presents problems of interference with material. eg a long shaft in a lathe makes it hard to home to limits with out the tool hitting the shaft, so a separate home switch closer to the middle may be better. If you have an encoder with index then the home switch acts as a course home and the index will be the actual home location.
fr: Si des fins de course de limite d'axe sont utilisés, il est possible d'en utiliser également un par axe comme contacts d'origine machine. Un contact d'origine machine séparé est utile si les axes sont longs et que le déplacement vers un fin de course dure trop longtemps pour un usage normale ou que le déplacement vers une extrémité présente des problèmes d'interférences avec le porte-pièce ou la pièce. Par exemple sur un tour, le déplacement en bout de banc n'est pas efficace pour un point d'origine machine et un contact placé vers le centre est certainement meilleur. Si des codeurs avec un index sont utilisés, le contact agit comme point de référence et l'index suivant sera le point d'origine machine effectif.

source: Decide on the MACHINE ORIGIN position.
fr: Décider de la position du contact d'ORIGINE MACHINE.

source: MACHINE ORIGIN is what LinuxCNC uses to reference all user coordinate systems from. I can think of little reason it would need to be in any particular spot. There are only a few G codes that can access the MACHINE COORDINATE system.( G53, G30 and G28 ) If using tool-change-at-G30 option having the Origin at the tool change position may be convenient. By convention, it may be easiest to have the ORIGIN at the home switch.
fr: L'origine machine dans LinuxCNC sert de référence à tous les systèmes de coordonnées utilisateur. Il n'y a pas d'emplacement particulier pour ce contact. Seuls quelques G-codes accèdent au système de coordonnées machine (G53, G30 et G28). Si l'option de changement d'outil sur G30 est utilisée, placer l'origine machine à cet endroit peut être commode. Mais, par convention, il est plus simple d'avoir l'origine machine sur le contact d'origine.

source: Decide on the (final) HOME POSITION.
fr: Décider de la position finale de l'ORIGINE MACHINE.

source: this just places the carriage at a consistent and convenient position after LinuxCNC figures out where the ORIGIN is.
fr: Consiste simplement à placer le mobile ou la broche à la position la plus commode *après* que LinuxCNC soit initialisé et que les points d'origines machine de chacun des axes lui soit connus.

source: Measure / calculate the positive / negative axis travel distances.
fr: Définition des côtés positifs/négatifs et des longueurs de courses maximales.

source: Move the axis to the origin. Mark a reference on the movable slide and the non-moveable support (so they are in line) move the machine to the end of limits. Measure between the marks that is one of the travel distances. Move the table to the other end of travel. Measure the marks again. That is the other travel distance. If the ORIGIN is at one of the limits then that travel distance will be zero.
fr: Placer l'axe à l'origine. Faire un repère sur le mobile et un autre sur la partie fixe. Déplacer la machine jusqu'au contact de limite d'axe. Mesurer la distance entre les deux repères pour obtenir la longueur de déplacement maximale dans ce sens. Déplacer dans l'autre sens, sur le contact de limite de l'autre côté. Mesurer de nouveau les repères pour obtenir la longueur de déplacement maximale dans l'autre sens. Si l'origine machine est située sur une des limites d'axe, alors cette distance de déplacement sera évidemment de zéro.

source: (machine) ORIGIN:: The Origin is the MACHINE zero point. (not the zero point you set your cutter / material at). LinuxCNC uses this point to reference everything else from. It should be inside the software limits. LinuxCNC uses the home switch location to calculate the origin position (when using home switches or must be manually set if not using home switches.
fr: ORIGINE machine:: Ce point est le point de référence de la machine. (Ne pas confondre avec le point zéro de l'outil ou de la pièce). LinuxCNC référence tout à partir de ce point. Il doit être à l'intérieur des limites logicielles sinon la machine ne pourrait jamais l'atteindre. LinuxCNC utilise la position du contact d'origine machine pour calculer la position d'origine. Si la machine ne dispose pas de contact il faudra la positionner manuellement sur les points d'origine et les valider.

source: Travel distance:: This is the maximum distance the axis can travel in each direction. This may or may not be able to be measured directly from origin to limit switch. The positive and negative travel distances should add up to the total travel distance.
fr: Course de la table:: C'est la distance maximale que l'axe peut parcourir dans chaque direction. Ceci peut ou ne peut pas être mesuré directement de l'origine aux contacts de fin de course. Le cumul des courses positives et négatives sera égal à la longueur de course totale.

source: POSITIVE TRAVEL DISTANCE:: This is the distance the Axis travels from the Origin to the positive travel distance or the total travel minus the negative travel distance. You would set this to zero if the origin is positioned at the positive limit. The will always be zero or a positive number.
fr: Course positive:: C'est la distance depuis l'origine de l'axe, jusqu'au fin de course de limite du côté positif. Si l'origine de l'axe est placée sur le fin de course de limite positive, cette valeur est égale à zéro. Les valeurs possibles sont positives ou égales à zéro.
