Repository: 0000duck/linuxcnc
Catalog: docs/src/getting-started/pncconf.*.po
Languages: fr

source: NEGATIVE TRAVEL DISTANCE:: This is the distance the Axis travels from the Origin to the negative travel distance. or the total travel minus the positive travel distance. You would set this to zero if the origin is positioned at the negative limit. This will always be zero or a negative number. If you forget to make this negative PNCconf will do it internally.
fr: Course négative:: C'est la distance depuis l'origine de l'axe, jusqu'au fin de course de limite du coté négatif. Ou la course totale moins la course positive. Si l'origine de l'axe est placée sur le fin de course de limite négative, cette valeur est de zéro. Les valeurs possibles sont négatives ou égales à zéro. Si la valeur entrée dans PNCconf n'est pas négative, elle sera déduite des autres valeurs.

source: (Final) HOME POSITION:: This is the position the home sequence will finish at. It is referenced from the Origin so can be negative or positive depending on what side of the Origin it is located. When at the (final) home position if you must move in the Positive direction to get to the Origin, then the number will be negative.
fr: Position finale de l'origine:: C'est la position ou se termine la séquence de prise d'origine machine. Elle est référencée par rapport à l'origine et peut être positive, si cette position finale est du coté positif ou négative, si cette position finale est du coté négatif.

source: HOME SWITCH LOCATION:: This is the distance from the home switch to the Origin. It could be negative or positive depending on what side of the Origin it is located. When at the home switch location if you must move in the Positive direction to get to the Origin, then the number will be negative. If you set this to zero then the Origin will be at the location of the limit switch (plus distance to find index if used)
fr: Position du contact d'origine machine:: C'est la distance depuis le contact d'origine jusqu'à la position de l'origine. Il peut être négatif ou positif selon de quel côté de l'origine il est placé. Depuis ce point, si l'axe doit être déplacé dans la direction positive pour arriver à l'origine, alors la valeur sera négative, sinon elle sera positive. Si il est mis à zéro, l'origine sera à l'emplacement du contact (plus la distance éventuelle pour attendre l'index suivant, si une règle de mesure, ou un codeur de position avec index sont utilisés).

source: Home Search Velocity:: Course home search velocity in units per minute.
fr: Vitesse de recherche du contact d'origine machine:: Vitesse utilisée pendant le déplacement vers le contact d'origine machine en unités par minute.

source: Home Search Direction:: Sets the home switch search direction either negative (ie. towards negative limit switch) or positive (ie. towards positive limit switch)
fr: Direction de recherche du contact d'origine machine:: Direction de la recherche de l'origine machine. Négatif ou Positif selon le coté de l'axe où se trouve le contact d'origine machine.

source: Home Latch Velocity:: Fine Home search velocity in units per minute
fr: Vitesse d'acquisition du contact d'origine machine:: Vitesse lente de détection du contact d'origine machine, en unités par minute.

source: Home Final Velocity:: Velocity used from latch position to (final) home position in units per minute. Set to 0 for max rapid speed
fr: Vitesse vers la position de l'origine:: Vitesse utilisée pour déplacer le mobile de la position d'acquisition du contact d'origine machine, vers la position finale de l'origine, en unités par minute. Si réglée à 0 c'est la vitesse de déplacement rapide qui sera utilisée.

source: Home latch Direction:: Allows setting of the latch direction to the same or opposite of the search direction.
fr: Direction d'acquisition du contact d'origine machine:: Direction d'acquisition de l'origine machine, peut être dans la même direction que la recherche, ou à l'opposé.

source: Use Encoder Index For Home:: LinuxCNC will search for an encoder index pulse while in the latch stage of homing.
fr: Origine machine sur l'index du codeur:: LinuxCNC attendra l'impulsion d'index du codeur après l’acquisition du contact d'origine machine.

source: Use Compensation File:: Allows specifying a Comp filename and type. Allows sophisticated compensation. See Manual.
fr: Utiliser un fichier de compensation de jeu:: Permet de spécifier le nom et le type d'un fichier de compensation de jeu. Permet une compensation sophistiquée. Voir le manuel.

source: Use Backlash Compensation:: Allows setting of simple backlash compensation. Can not be used with Compensation File. See Manual.
fr: Utiliser la compensation de jeu:: Permet de régler la compensation du jeu de la vis, ne peut pas être utilisé en même temps qu'un fichier de compensation. Voir le manuel.

source: .AXIS Help Diagram
fr: .Dessin d'aide à l'identification des axes et fins de course

source: image::images/pncconf-diagram-lathe.png[]
fr: image::images/pncconf-diagram-lathe_fr.png[]

source: The diagrams should help to demonstrate an example of limit switches and standard axis movement directions. In this example the Z axis was two limit switches, the positive switch is shared as a home switch. The MACHINE ORIGIN (zero point) is located at the negative limit. The left edge of the carriage is the negative trip pin and the right the positive trip pin. We wish the FINAL HOME POSITION to be 4 inches away from the ORIGIN on the positive side. If the carriage was moved to the positive limit we would measure 10 inches between the negative limit and the negative trip pin.
fr: Ce dessin devrait aider à comprendre un exemple de positionnement des contacts de limite et les directions standards sur un tour. Sur ce tour, l'axe Z a deux contacts de limite, le contact positif est utilisé également comme contact de prise d'origine machine. La position du zéro machine (origine machine de l'axe) est placée à la limite négative. Le bord gauche du chariot est la came qui active le fin de course de la limite négative et le côté droit, la came qui active le fin de course de la limite positive. Nous voyons que la position finale de l'origine se trouve à 4 pouces de distance de l'origine de l'axe, du côté positif. Si le chariot était déplacé jusqu'à la limite positive, nous mesurerions 10 pouces entre la limite négative et la came du côté négatif du chariot (fin de course bord gauche du chariot).

source: == Spindle Configuration
fr: == Configuration de la broche

source: If you select spindle signals then this page is available to configure spindle control.
fr: Si un signal de contrôle de la broche est présent, cette page permet de le configurer.

source: TIP: Many of the option on this page will not show unless the proper option was selected on previous pages!
fr: TIP: Beaucoup d'options de cette page ne sont visibles que si les sélections appropriées ont été choisies dans les pages précédentes. Si des signaux de broche ont été sélectionnés, alors cette page est disponible pour les configurer.

source: .Spindle Configuration
fr: .Configuration de la broche

source: image::images/pncconf-spindle-config.png[]
fr: image::images/pncconf-spindle-config_fr.png[]

source: This page is similar to the axis motor configuration page.
fr: Cette page est semblable à la page de configuration des moteurs d'axe.

source: There are some differences:
fr: Mais il y a quelques différences:

source: * Unless one has chosen a stepper driven spindle there is no acceleration or velocity limiting. * There is no support for gear changes or ranges. * If you picked a VCP spindle display option then spindle-at-speed scale and filter settings may be shown. * Spindle-at-speed allows LinuxCNC to wait till the spindle is at the requested speed before moving the axis. This is particularly handy on lathes with constant surface feed and large speed diameter changes. It requires either encoder feedback or a digital spindle-at-speed signal typically connected to a VFD drive. * If using encoder feedback, you may select a spindle-at-speed scale setting that specifies how close the actual speed must be to the requested speed to be considered at-speed. * If using encoder feedback, the VCP speed display can be erratic - the filter setting can be used to smooth out the display. The encoder scale must be set for the encoder count / gearing used. * If you are using a single input for a spindle encoder you must add the line: setp hm2_7i43.0.encoder.00.counter-mode 1 (changing the board name and encoder number to your requirements) into a custom HAL file. See the Hostmot2 section on encoders for more info about counter mode.
fr: * À moins que l'on ait choisi un moteur pas à pas pour la conduite de la broche il n'y a pas d'accélération ni de limitation de vitesse. * Il n'y a pas de support pour les changements de vitesse ni pour les gammes de vitesses. * Si une option VCP d'affichage de vitesse broche est choisie, alors la 'Vitesse broche atteinte', 'l'échelle', 'la vitesse' et 'les réglages des filtres' seront visibles. * L’information sur la vitesse de broche permet à LinuxCNC d'attendre que celle-ci ait atteint la vitesse de consigne, avant de déplacer les axes. C'est particulièrement pratique sur les tours, lors de l'utilisation d'une vitesse de coupe constante avec de grands changements de diamètre. Il exige un retour d'information par codeur ou par un signal de vitesse broche numérique, typiquement connecté à un variateur de vitesse (VFD). * En utilisant le retour d'information d'un codeur, il est possible de choisir une plage de 'vitesse broche atteinte' comme tolérance de vitesse, au delà de laquelle, la vitesse broche sera admise comme étant à la vitesse de consigne. * En utilisant le retour d'information d'un codeur, l'affichage de vitesse VCP peut être irrégulier, des filtres peuvent dans ce cas, être utilisés pour corriger l'affichage. L'échelle du codeur doit être réglée à la valeur 'comptage codeur/rapport de réduction utilisé'. * Si une seule entrée est utilisée pour le codeur de broche, la ligne suivante doit être ajoutée: setp hm2_7i43.0.encoder.00.counter-mode 1 (Changer le nom de la carte et le numéro de codeur selon besoins) dans le fichier HAL personnalisé. Lire la section codeurs dans Hostmot2 pour plus d'information sur les modes de comptage.

source: == Advanced Options
fr: == Options avancées

source: This allows setting of HALUI commands and loading of classicladder and sample ladder programs. If you selected GLADE VCP options such as for zeroing axis, there will be commands showing. See the manual about info on HALUI for using custom halcmds. There are several ladder program options. The Estop program allows an external ESTOP switch or the GUI frontend to throw an Estop. It also has a timed lube pump signal. The Z auto touch-off is with a touch-off plate, the GLADE VCP touch-off button and special HALUI commands to set the current user origin to zero and rapid clear. The serial modbus program is basically a blank template program that sets up classicladder for serial modbus. See the classicladder section in the manual.
fr: Cette page permet de régler les commandes HALUI, de charger classicladder. Elle propose des exemples de programmes en Ladder. Si l'option GladeVCP a été choisie, comme pour la mise à zéro de l'axe sur l'origine pièce. Les commandes nécessaires s'afficheront. Voir le manuel à propos d'HALUI pour utiliser des commandes halcmds personnalisées. Parmi les exemples de programmes ladder: Le programme Estop permet de gérer un contact externe d'arrêt d'urgence ou permet à l'interface graphique de déclencher l'arrêt d'urgence. La commande périodique de la pompe du graissage centralisé est disponible. Le contact de mise au zéro pièce de l'axe Z (longueur d'outil) s'utilise avec une plaque conductrice de référence, le contact (touch-off) de GladeVCP et les commandes spéciales HALUI sont là pour permettre rapidement, une recherche de l'origine pièce. Le programme série 'modbus' est un squelette de programme, vierge, préréglé pour l'utilisation de classicladder avec le protocole série modbus. Voir la section classicladder dans le manuel.

source: .Advanced Options
fr: .Options avancées

source: image::images/pncconf-advanced.png[]
fr: image::images/pncconf-advanced_fr.png[]

source: == HAL Components
fr: == Composants de HAL

source: On this page you can add additional HAL components you might need for custom HAL files. In this way one should not have to hand edit the main HAL file, while still allowing user needed components.
fr: Cette page permet d'ajouter des composants de HAL supplémentaires qui seront utilisés dans les fichiers HAL personnalisés. De cette manière il n'est pas nécessaire d'éditer le fichier HAL principal en permettant malgré tout à l'utilisateur de définir ses propres composants.

source: .HAL Components
fr: .Composants de HAL

source: image::images/pncconf-hal.png[]
fr: image::images/pncconf-hal_fr.png[]

source: The first selection is components that pncconf uses internally. You may configure pncconf to load extra instances of the components for your custom HAL file.
fr: La première sélection est prévue pour les composants que PNCconf utilise en interne. Il est possible de configurer PNCconf pour qu'il charge les instances additionnelles pour votre fichier HAL personnalisé.

source: Select the number of instances your custom file will need, pncconf will add what it needs after them.
fr: Sélectionner le nombres d'instances dont aura besoin le fichier de personnalisation et PNCconf ajoutera ce qui est nécessaire.

source: Meaning if you need 2 and pncconf needs 1 pncconf will load 3 instances and use the last one.
fr: Si 2 composants sont nécessaires et que PNCconf à besoin d'un composant interne, il chargera 3 composants et utilisera le dernier.

source: Custom Component Commands::
fr: Composants de commande personnalisés::

source: This selection will allow you to load HAL components that pncconf does not use. Add the loadrt or loadusr command, under the heading 'loading command' Add the addf command under the heading 'Thread command'. The components will be added to the thread between reading of inputs and writing of outputs, in the order you write them in the 'thread command'.
fr: Cette sélection permettra de charger des composants de HAL que PNCconf n'utilise pas. Ajoute les commandes loadrt ou loadusr dans l'entête 'loading command'. Ajoute la commande addf dans l'entête 'Thread command'. Les composants seront ajoutés au thread entre la lecture des entrées et l'écriture des sorties, dans l'ordre ou ils sont écrits dans 'thread command'.

source: == Advanced Usage Of PNCconf
fr: == Utilisation avancée de PNCconf

source: PNCconf does its best to allow flexible customization by the user. PNCconf has support for custom signal names, custom loading of components, custom HAL files and custom firmware.
fr: PNCconf fait de son mieux pour permettre un personnalisation souple à l'utilisateur, il supporte les noms de signaux personnalisés, le chargement de composants personnalisés comme la personnalisation des fichiers de HAL et des microprogrammes.

source: There are also signal names that PNCconf always provides regardless of options selected, for user's custom HAL files With some thought most customizations should work regardless if you later select different options in PNCconf.
fr: Il y a aussi les noms de signaux que PNCconf fournit, indépendamment des options choisies, pour les fichiers HAL personnalisés. Avec une conception réfléchie, la plupart des personnalisations devraient fonctionner, même si des options doivent être modifiées par la suite dans PNCconf.

source: Eventually if the customizations are beyond the scope of PNCconf's frame work you can use PNCconf to build a base config or use one of LinuxCNC's sample configurations and just hand edit it to what ever you want.
fr: Finalement, si les personnalisations vont au-delà du périmètre de travail de PNCconf, il sera possible d'utiliser PNCconf pour construire une configuration de base, ou d'utiliser une des configurations fournies en standards par LinuxCNC et de l'éditer pour obtenir ce que est souhaité.

source: Custom Signal Names::
fr: Nom de signaux personnalisés::

source: If you wish to connect a component to something in a custom HAL file write a unique signal name in the combo entry box. Certain components will add endings to your custom signal name:
fr: Si un composant doit être connecté à quelque chose dans un fichier HAL personnalisé, écrire un nom de signal unique dans la boîte de dialogue. Certains composants ajouteront des suffixes au nom du signal personnalisé.

source: Encoders will add < customname > +:
fr: Les codeurs ajoutent < Nom personnalisé > +:

source: Steppers add:
fr: Les contrôles de moteurs pas à pas ajoutent:

source: PWM add:
fr: Les PWM ajoutent:

source: GPIO pins will just have the entered signal name connected to it
fr: Les broches GPIO auront juste le nom du signal d'entrée qui leur est connecté.

source: In this way one can connect to these signals in the custom HAL files and still have the option to move them around later.
fr: De cette façon on peut établir des connexions à ces signaux dans les fichiers personnalisés de HAL et avoir toujours la possibilité de les déplacer plus tard.

source: The Hal Components page can be used to load components needed by a user for customization.
fr: La page des composants de Hal peut être utilisée pour charger les composants nécessaires à l'utilisateur pour les personnaliser.

source: Loading Custom Firmware::
fr: Charger un microprogramme personnalisé::

source: PNCconf searches for firmware on the system and then looks for the XML file that it can convert to what it understands. These XML files are only supplied for officially released firmware from the LinuxCNC team. To utilize custom firmware one must convert it to an array that PNCconf understands and add its filepath to PNCconf's preference file. By default this path searches the desktop for a folder named custom_firmware and a file named firmware.py.
fr: PNCconf cherche le microprogramme sur le système et cherche ensuite le fichier XML qu'il peut convertir et qu'il comprend. Ces fichiers XML sont seulement fournis pour les microprogrammes officiellement délivrés par l'équipe LinuxCNC. Pour utiliser un microprogramme personnalisé, il faut le convertir en tableau que PNCconf comprend et ajouter son chemin dans le fichier de préférences de PNCconf. Par défaut le chemin recherché est sur le bureau, dans un dossier nommé 'custom_firmware' contenant un fichier nommé firmware.py.

source: The hidden preference file is in the user's home file, is named .pncconf-preferences and require one to select 'show hidden files' to see and edit it. The contents of this file can be seen when you first load PNCconf - press the help button and look at the output page.
fr: Le fichier caché des préférence est dans le dossier home de l'utilisateur et se nomme .pncconf-preferences, pour l'éditer il faut sélectionner 'Afficher les fichiers cachés'. On peut voir le contenu de ce fichier au premier démarrage de PNCconf. Presser le bouton d'aide et regarder la page de sortie.

source: Ask on the LinuxCNC mail-list or forum for info about converting custom firmware. Not all firmware can be utilized with PNCconf.
fr: Demander sur la liste de diffusion LinuxCNC ou sur le forum pour des renseignements pour convertir un microprogramme personnalisé. Tous les microprogrammes ne peuvent pas être utilisés avec PNCconf.

source: Custom HAL Files::
fr: Fichiers HAL Personnalisés::

source: There are four custom files that you can use to add HAL commands to:
fr: Il y a quatre fichiers personnalisés utilisables pour leur ajouter des commandes HAL:

source: * custom.hal is for HAL commands that don't have to be run after the GUI frontend loads. It is run after the configuration-named HAL file. * custom_postgui.hal is for commands that must be run after AXIS loads or a standalone PYVCP display loads. * custom_gvcp.hal is for commands that must be run after glade VCP is loaded. * shutdown.hal is for commands to run when LinuxCNC shuts down in a controlled manner.
fr: * custom.hal est prévu pour les commandes HAL utilisées avant le chargement de l'interface graphique. Il est exécuté après le fichier HAL de configuration nomm: non-de-la-configuration.hal * custom_postgui.hal est prévu pour les commandes qui doivent être exécutées après le chargement de l'interface graphique Axis ou PYVCP autonomes. * custom_gvcp.hal est prévu pour les commandes qui doivent être exécutées après le chargement de GLADE VCP. * shutdown.hal est prévu pour des commandes exécutées quand LinuxCNC se ferme de manière contrôlée.
