Repository: 0000duck/linuxcnc
Catalog: docs/src/getting-started/stepconf.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = Stepper Configuration Wizard
fr: = Assistant graphique de configuration StepConf

source: [[cha:stepconf-wizard]] (((Stepconf Wizard)))
fr: [[cha:Assistant-graphique-StepConf]] (((Assistant stepconf)))

source: LinuxCNC is capable of controlling a wide range of machinery using many different hardware interfaces.
fr: LinuxCNC est capable de contrôler un large éventail de machines utilisant de nombreuses interfaces matérielles différentes.

source: Stepconf is a program that generates configuration files for LinuxCNC for a specific class of CNC machine: those that are controlled via a 'standard parallel port', and controlled by signals of type 'step & direction'.
fr: Stepconf est un programme qui génère des fichiers de configuration LinuxCNC pour une classe spécifique de machine CNC: celles qui sont pilotées via un, ou plusieurs ports parallèles standards et contrôlées par des signaux de type 'pas & direction' (step/dir).

source: Stepconf is installed when you install LinuxCNC and is in the CNC menu.
fr: Stepconf est installé en même temps que LinuxCNC et un lanceur se trouve dans le menu Application → CNC → LinuxCNC → StepConf.

source: Stepconf places a file in the linuxcnc/config directory to store the choices for each configuration you create. When you change something, you need to pick the file that matches your configuration name. The file extension is .stepconf.
fr: Stepconf place un fichier dans le répertoire ~/linuxcnc/config pour y stocker les paramètres de chaque configuration créée. Lorsque quelque chose doit être modifié, il faut choisir le fichier correspondant au nom de la configuration et portant l'extension .stepconf.

source: The Stepconf Wizard works best with at least 800 x 600 screen resolution.
fr: L'Assistant Stepconf a besoin, au minimum, d'une résolution de 800 x 600 pour que les boutons sur le bas des pages soient apparents.

source: == Start Page[[sec:Entry-Page]]
fr: == Page d'accueil[[sec:page_accueil]]

source: .Entry Page[[cap:Entry-Page]]
fr: .La page d'accueil[[cap:page_accueil]]

source: image::images/stepconf-config.png[align="center"]
fr: image::images/stepconf-config_fr.png[align="left"]

source: 'Create New' - Creates a fresh configuration.
fr: * 'Créer une nouvelle configuration' - Créera une nouvelle configuration.

source: * 'Modify' - Modify an existing configuration. After selecting this a file picker pops up so you can select the .stepconf file for modification. If you made any modifications to the main .hal or the .ini file these will be lost. Modifications to custom.hal and custom_postgui.hal will not be changed by the Stepconf Wizard. Stepconf will highlight the lastconf that was built.
fr: * 'Modifier' - Modifiera une configuration existante. Après la sélection de celle-ci un sélecteur de fichier s'ouvre pour y choisir le fichier .stepconf à modifier. Si des modifications ont été faites aux fichiers .hal et .ini avec un autre éditeur, elles seront perdues. Les modifications de custom.hal et de custom_postgui.hal, par contre, sont conservées par Stepconf.

source: These next options wiil be recorded in a preference file for the next run of Stepconf.
fr: Les options suivantes seront conservées dans un fichier de préférences pour le prochain lancement de stepconf.

source: * 'Create Desktop Shortcut' - This will place a link on your desktop to the files.
fr: * 'Créer un lien' - Placera un raccourci sur le bureau, pointant sur le dossier des fichiers de configuration.

source: * 'Create Desktop Launcher' - This will place a launcher on your desktop to start your application.
fr: * 'Créer un lanceur' - Placera un lanceur sur le bureau pour démarrer l'application avec sa configuration.

source: * 'Create Simulated Hardware' - This allows you to build a config for testing, even if you don't have the actual hardware.
fr: * 'Créer une simulation' - Permet de construire une configuration de test, ceci même sans aucun matériel raccordé.

source: == Basic Information[[sec:Basic-Information]]
fr: == Informations machine[[sec:Informations-machine]]

source: .Basic Information Page[[cap:Basic-Information-Page]]
fr: .Page d'informations sur la machine[[cap:page-information-machine]]

source: image::images/stepconf-basic.png[align="center"]
fr: image::images/stepconf-basic_fr.png[align="left"]

source: * 'Machine Name' - Choose a name for your machine. Use only uppercase letters, lowercase letters, digits, - and _.
fr: * 'Nom de la machine' - Choisir un nom pour la machine. Utiliser uniquement des lettres majuscules, minuscules, des chiffres ou - et _.

source: 'Axis Configuration' - Choose XYZ (Mill), XYZA (4-axis mill) or XZ (Lathe).
fr: * 'Configuration des axes' - Choisir les axes XYZ (fraiseuse 3 axes), XYZA (fraiseuse 4 axes) ou XZ (tour).

source: * 'Machine Units' - Choose Inch or mm. All subsequent entries will be in the chosen units. Changing this also changes the default values in the Axes section. If you change this after selecting values in any of the axes sections, they will be over-written by the default values of the selected units.
fr: * 'Unité machine' - Choisir entre le pouce et le millimètre. Toutes les questions suivantes (telles que la longueur des courses, le pas de la vis, etc) devront obtenir des réponses dans l'unité choisie ici. Si ce paramètre change après avoir sélectionné des valeurs dans les sections d'axe, celles-ci seront écrasées par les valeurs par défaut des unités sélectionnées.

source: * 'Driver Type' - If you have one of the stepper drivers listed in the pull down box, choose it. Otherwise, select 'Other' and find the timing values in your driver's data sheet and enter them as 'nano seconds' in the 'Driver Timing Settings'. If the data sheet gives a value in microseconds, multiply by 1000. For example, enter 4.5us as 4500ns.
fr: * 'Caractéristiques du pilote' - Si un des pilotes énumérés dans la liste déroulante peut être utilisé, cliquer sur son nom. Sinon, choisir 'Autres' et trouver les 4 valeurs de timing dans la fiche de caractéristiques fournie par le fabricant du pilote et les saisir. Si la fiche donne des valeursen microsecondes, les multiplier par 1000 pour les convertir en nanosecondes. Par exemple, pour 4.5µs saisir 4500ns.

source: A list of some popular drives, along with their timing values, is on the LinuxCNC.org Wiki under http://wiki.linuxcnc.org/cgi-bin/wiki.pl?Stepper_Drive_Timing[Stepper Drive Timing].
fr: Une liste des pilotes pas à pas les plus populaires, avec leurs valeurs caractéristiques de timing, se trouve sur le wiki de LinuxCNC.org à la page http://wiki.linuxcnc.org/cgi-bin/wiki.pl?Stepper_Drive_Timing[Timming des pilotes].

source: Additional signal conditioning or isolation such as optocouplers and RC filters on break out boards can impose timing constraints of their own, in addition to those of the driver. You may find it necessary to add some time to the drive requirements to allow for this.
fr: D'éventuels traitements des signaux, une opto-isolation ou des filtres RC, peuvent imposer des contraintes de temps supplémentaires aux signaux, il convient alors de les ajouter à celles du pilote.

source: The LinuxCNC Configuration Selector has configs for Sherline already configured.
fr: Le sélecteur de configuration de LinuxCNC contient des configurations pour Sherline déjà pré-configurées.

source: * 'Step Time' - How long the step pulse is 'on' in nano seconds. If your not sure about this setting a value of 20,000 will work with most drives.
fr: * 'Step Time' - Durée de la largeur de l'impulsion de pas à l'état 'on', en nanosecondes. En cas de doutes, mettre cette valeur à 20000, elle fonctionnera avec la majorité des pilotes.

source: * 'Step Space' - Minimum time between step pulses in nano seconds. If your not sure about this setting a value of 20,000 will work with most drives.
fr: * 'Valeur Space d'un pas' - Temps entre deux impulsions de pas, en nanosecondes. En cas de doutes, mettre cette valeur à 20000, elle fonctionnera avec la majorité des pilotes.

source: * 'Direction Hold' - How long the direction pin is held after a change of direction in nanoseconds. If your not sure about this setting a value of 20,000 will work with most drives.
fr: * 'Direction Hold' - Durée de maintien du signal après un changement de direction, en nanosecondes. En cas de doutes, mettre cette valeur à 20000, elle fonctionnera avec la majorité des pilotes.

source: * 'Direction Setup' - How long before a direction change after the last step pulse in nanoseconds. If your not sure about this setting a value of 20,000 will work with most drives.
fr: * 'Réglage direction' - Délai avant le changement de direction après la dernière impulsion de pas, en nanosecondes. En cas de doutes, mettre cette valeur à 20000, elle fonctionnera avec la majorité des pilotes.

source: 'One / Two Parport' - Select how many parallel port are to be configured.
fr: * 'Un ou deux Parport' - Choix du nombre de ports parallèles.

source: * 'Base Period Maximum Jitter' - Enter the result of the Latency Test here. To run a latency test press the 'Test Base Period Jitter' button. See the <<latency-test,Latency Test>> section for more details.
fr: * 'Base Period Maximum Jitter' - Entrer ici la valeur obtenue à la fin du test de latence. Pour exécuter directement un test de latence cliquer sur le bouton 'Test de latence'. Voir le chapitre sur le <<cha:test-de-latence, sur le test de latence>> pour tous les détails concernant ce test.

source: * 'Max Step Rate' -Stepconf automatically calculates the Max Step Rate based on the driver characteristics entered and the latency test result.
fr: * 'Fréquence maxi des pas' - Stepconf calcule automatiquement la fréquence maximum des pas, en se basant sur les paramètres du pilote entrés dans cette configuration et les résultats du test de latence.

source: * 'Min Base Period' - Stepconf automatically determines the Min Base Period based on the driver characteristics entered and latency test result.
fr: * 'Période de base minimale' - Stepconf calcule automatiquement la période de base minimale, en se basant sur les paramètres du pilote, entrés dans cette configuration et les résultats du test de latence.

source: == Latency Test[[latency-test]](((Latency Test)))
fr: == Test de latence[[test-de-latence]](((Test de latence)))

source: While the test is running, you should 'abuse' the computer. Move windows around on the screen. Surf the web. Copy some large files around on the disk. Play some music. Run an OpenGL program such as glxgears. The idea is to put the PC through its paces while the latency test checks to see what the worst case numbers are. Run the test at least a few minutes. The longer you run the test the better it will be at catching events that might occour at less frequent intervals. This is a test for your computer only, so no hardware needs to be connected to run the test.
fr: Alors que le test est en cours d'exécution, il faut charger l'ordinateur au maximum. Déplacer les fenêtres sur l'écran. Surfer sur le Web. Écouter de la musique. Exécuter un programme OpenGL comme glxgears. L'idée est de charger le PC au maximum pour que le temps de latence soit mesuré dans le cas le plus défavorable et donc, connaître la latence maximale. Laisser le test se dérouler plusieurs minutes. Plus le test sera long, plus il aura de chance de capturer un événement se produisant peu fréquemment. Ce test concerne seulement l'ordinateur, aucun matériel ne doit être connecté pour lancer le test.

source: [WARNING] Do not attempt run LinuxCNC while the latency test is running.
fr: [WARNING] Ne pas exécuter LinuxCNC ou Stepconf pendant que latency-test est en cours d'exécution.

source: .Latency Test[[cap:Latency-Test]]
fr: .Latency Test[[cap:Test-de-latence]]

source: image::images/latency.png[align="center"]
fr: image::images/latency.png[align="left"]

source: Latency is how long it takes the PC to stop what it is doing and respond to an external request. In our case, the request is the periodic 'heartbeat' that serves as a timing reference for the step pulses. The lower the latency, the faster you can run the heartbeat, and the faster and smoother the step pulses will be.
fr: La latence correspond au temps pris par le PC pour stopper ce qui est en cours et répondre à une requête externe. Dans notre cas, la requête est 'horloge qui sert au cadencement des impulsions de pas. Plus faible est la latence, plus rapide sera l'horloge, plus rapides et plus douces seront les impulsions de pas.

source: Latency is far more important than CPU speed. The CPU isn't the only factor in determining latency. Motherboards, video cards, USB ports, SMI issues, and a number of other things can hurt the latency.
fr: La latence est de loin plus importante que la vitesse du CPU. Le CPU n'est pas le seul facteur déterminant le temps de latence. Les cartes mères, les cartes vidéo, les ports USB et de nombreuses autres choses peuvent détériorer le temps de latence.

source: .Troubleshooting SMI Issues (LinuxCNC.org Wiki) ************************************************************ Fixing Realtime problems caused by SMI on Ubuntu
fr: .Dépannage de problèmes SMI (LinuxCNC.org Wiki) ************************************************************ Des problèmes dûs au SMI arrivent parfois sur Ubuntu, il existe un correctif:

source: The important numbers are the 'max jitter'. In the example above 9075 nanoseconds, or 9.075 microseconds, is the highest jitter. Record this number, and enter it in the Base Period Maximum Jitter box.
fr: La colonne 'max jitter' à la ligne 'Base Thread' dans l'exemple ci-dessus donne '9075'. Ce qui représente 9075 nanosecondes, soit 9.075 microsecondes. Noter ce nombre pour l'entrer dans Stepconf comme période de base maximale.

source: If your Max Jitter number is less than about 15-20 microseconds (15000-20000 nanoseconds), the computer should give very nice results with software stepping. If the max latency is more like 30-50 microseconds, you can still get good results, but your maximum step rate might be a little disappointing, especially if you use microstepping or have very fine pitch leadscrews. If the numbers are 100 us or more (100,000 nanoseconds), then the PC is not a good candidate for software stepping. Numbers over 1 millisecond (1,000,000 nanoseconds) mean the PC is not a good candidate for LinuxCNC, regardless of whether you use software stepping or not.
fr: Si le résultat de Max Jitter est en dessous d'environ 15-20 µs (15000-20000 nanosecondes), l'ordinateur pourra donner d'excellents résultats pour la génération logicielle des pas. Si le temps de latence est à plus de 30-50 microsecondes, de bons résultats seront obtenus, mais la vitesse maximum sera un peu faible, spécialement si des micro-pas sont utilisés ou si le pas de la vis est fin. Si les résultats sont de 100µS ou plus (100,000 nanosecondes), alors le PC n'est pas un bon candidat à la génération des pas. Les résultats supérieurs à 1 milliseconde (1,000,000 nanosecondes) éliminent, dans tous les cas, ce PC pour faire tourner LinuxCNC, en utilisant des micro-pas ou pas.

source: == Parallel Port Setup[[sec:Parallel-Port-Setup]](((Parallel Port Setup)))
fr: == Réglage du port parallèle[[Reglage-du-port-parallele]]

source: .Parallel Port Setup Page[[cap:Parallel-Port-Setup]]
fr: .Page de réglage du port parallèle[[cap:Reglage-du-port-parallele]]

source: image::images/stepconf-pinout.png[align="center"] You may specify the address as a hexidecimal (often 0x378) or as linux's default port number (probably 0)
fr: image::images/stepconf-pinout_fr.png[align="left"] Il est possible de spécifier l'adresse en hexadécimal (par exemple:0x378) ou comme numéro de port par défaut de Linux (probablement 0).

source: For each pin, choose the signal which matches your parallel port pinout. Turn on the 'invert' check box if the signal is inverted (0V for true/active, 5V for false/inactive).
fr: Pour chacune des broches, choisir le signal correspondant au brochage entre le port parallèle et l'interface matérielle. Cocher la case 'inverser' si le signal est inversé (0V pour vrai/actif, 5V pour faux/inactif).

source: * 'Output pinout presets' - Automatically set pins 2 through 9 according to the Sherline standard (Direction on pins 2, 4, 6, 8) or the Xylotex standard (Direction on pins 3, 5, 7, 9).
fr: * 'Sorties présélectionnées' - Réglage automatique des pins 2 à 9 Direction sur les pins 2, 4, 6, 8, selon le standard Sherline Direction sur les pins 3, 5, 7, 9, selon le standard Xylotex

source: * 'Inputs and Outputs' - If the input or output is not used set the option to 'Unused'.
fr: * 'Entrées et sorties' - Les entrées ou les sorties non utilisées doivent être placées sur 'Inutilisé'.

source: * 'External E Stop' - This can be selected from an input pin drop down box. A typical E Stop chain uses all normally closed contacts.
fr: * 'Sortie arrêt d'urgence' - Sélectionnable dans la liste déroulante des sorties. Tous les contacts de la boucle d'arrêt d'urgence devraient être des contacts Normalement Fermés (NC).

source: * 'Homing & Limit Switches' - These can be selected from an input pin drop down box for most configurations.
fr: * 'Entrées OM & Limites' - Ces choix se font dans la liste déroulante des entrées.

source: * 'Charge Pump' - If your driver board requires a charge pump signal select Charge Pump from the drop down list for the output pin you wish to connect to your charge pump input. The charge pump output is connected to the base thread by Stepconf. The charge pump output will be about 1/2 of the maximum step rate shown on the Basic Machine Configuration page.
fr: * 'Pompe de charge' - Si la carte de contrôle requiert un signal de pompe de charge, dans la liste déroulante des sorties, sélectionner 'Pompe de charge' sur la sortie correspondant à l'entrée Pompe de charge de la carte de contrôle. La sortie pompe de charge est connectée en interne au base thread par Stepconf. Le signal de pompe de charge sera d'environ la moitié de la fréquence maxi des pas affichée sur la page des informations de base de la machine.

source: == Parallel Port 2 Setup[[sec:Parallel-Port-2-Setup]](((Parallel Port 2 Setup)))
fr: == Réglage du port parallèle 2[[Parallel-Port-2-Setup]]

source: .Parallel Port 2 Setup Page[[cap:Parallel-Port-2-Setup]]
fr: .Page de réglage du port parallèle 2[[cap:Parallel-Port-2-Setup]]

source: image::images/stepconf-parport2.png[align="center"]
fr: image::images/stepconf-parport2.png[align="left"]

source: The second Parallel port (if selected) can be configured and It's pins assigned on this page. + No step and direction signals can be selected. + You may select in or out to maximizes the number of input/output pins that are available. + You may specify the address as a hexidecimal (often 0x378) or as linux's default port number (probably 1).
fr: Si un second port parallèle est sélectionné, entrer son adresse ici. + Les signaux pas et direction ne peuvent pas être sélectionnés. + Il devront être sélectionnés in ou out pour optimiser le nombre de broches d'entrées/sorties qui seront disponibles. + L'adresse peut être spécifiée en hexadécimal (ex: 0x378) ou comme les ports par défaut sous Linux (probablement 1).

source: == Axis Configuration[[sec:Axis-Configuration]](((Axis Configuration)))
fr: == Configuration des axes[[sec:Configuration-des-axes]]

source: .Axis Configuration Page[[cap:Axis-Configuration-Page]]
fr: .Page de configuration des axes[[cap:Configuration-des-axes]]

source: image::images/stepconf-axis.png[align="center"]
fr: image::images/stepconf-axis_fr.png[align="left"]

source: * 'Motor Steps Per Revolution' - The number of full steps per motor revolution. If you know how many degrees per step the motor is (e.g., 1.8 degree), then divide 360 by the degrees per step to find the number of steps per motor revolution.
fr: * 'Nombre de pas moteur par tour' - Nombre de pas entiers par tour de moteur.Si l'angle d'un pas en degrés est connu (par exemple, 1.8 degrés), diviser 360 par cet angle pour obtenir le nombre de pas par tour du moteur.

source: * 'Driver Microstepping' - The amount of microstepping performed by the driver. Enter '2' for half-stepping.
fr: * 'Micro-pas du pilote' - Le nombre de micro-pas produits par le pilote. Entrer par exemple '2' pour le demi pas ou une des valeurs permises par le pilote du moteur.

source: * 'Pulley Ratio' - If your machine has pulleys between the motor and leadscrew, enter the ratio here. If not, enter '1:1'.
fr: * 'Dents des poulies' - Si entre le moteur et la vis un réducteur poulie/courroie est présent, entrer ici le nombre de dents de chacune des poulies. Pour un entraînement direct, entrer '1:1'.

source: * 'Leadscrew Pitch' - Enter the pitch of the leadscrew here. If you chose 'Inch' units, enter the number of threads per inch If you chose 'mm' units, enter the number of millimeters per revolution (e.g., enter 2 for 2mm/rev). If the machine travels in the wrong direction, enter a negative number here instead of a positive number, or invert the direction pin for the axis.
fr: * 'Pas de la vis' - Entrer ici le pas de la vis. Si le pouce a été choisi comme unité, entrer ici le nombre de filets par pouce. Si le mm a été choisi, entrer ici le pas du filet en millimètres. Déterminer de combien se déplace le mobile par tour de vis et entrer cette valeur ici (ex:entrer 2 pour 2mm par tour de vis). Si la machine se déplace dans la mauvaise direction, entrer une valeur négative au lieu d'une positive, et vice-versa.

source: * 'Maximum Velocity' -Enter the maximum velocity for the axis in units per second.
fr: * 'Vitesse maximale' - Entrer ici la vitesse de déplacement maximale de l'axe, en unités par seconde.

source: * 'Maximum Acceleration' - The correct values for these items can only be determined through experimentation. See <<finding-maximum-velocity,Finding Maximum Velocity>> to set the speed and <<finding-maximum-acceleration,Finding Maximum Acceleration>> to set the acceleration.
fr: * 'Accélération maximale' - Les valeurs correctes pour ces deux entrées ne peuvent être déterminées que par l'expérimentation. Consulter <<sec:Trouver-Vitesse-Maximale,le calcul de la vitesse>> pour trouver la vitesse et <<sec:Trouver-Acceleration-Maximale,le calcul de l'accélération>> pour trouver l'accélération maximale.

source: * 'Home Location' - The position the machine moves to after completing the homing procedure for this axis. For machines without home switches, this is the location the operator manually moves the machine to before pressing the Home button. If you combine the home and limit switches you must move off of the switch to the home position or you will get a joint limit error.
fr: * 'Emplacement de l'origine' - Position sur laquelle la machine se place après avoir terminé la procédure de prise d'origine de cet axe.Pour les machines sans contact placé au point d'origine, c'est la position à laquelle l'opérateur place la machine en manuel, avant de presser le bouton de 'POM des axes'. Si des fins de course de limites sont combinés avec ceux de prise d'origine, il est indispensable de programmer le dégagement des capteurs de prise d'origine. A défaut une erreur de dépassement de limite surviendrait.

source: * 'Table Travel' - The range of travel for that axis based on the machine origin. The home location must be inside the 'Table Travel' and not equal to one of the Table Travel values.
fr: * 'Course de la table' - Étendue de la course sur cet axe. L'emplacement de l'origine machine (vu précédemment) doit être situé à l'intérieur de cette course et non égal la valeur de la course de la table.
