Repository: 0000duck/linuxcnc
Catalog: docs/src/getting-started/stepper_quickstart.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = Stepper Quickstart
fr: = Configuration rapide pour moteurs pas à pas

source: [[cha:stepper-quickstart]] (((Stepper Quickstart)))
fr: [[cha:configuration_rapide_steppers]] (((Stepper Quickstart)))

source: This section assumes you have done a standard install from the Live CD. After installation it is recommended that you connect the computer to the Internet and wait for the update manager to pop up and get the latest updates for LinuxCNC and Ubuntu before continuing. For more complex installations see the Integrator Manual.
fr: Cette section suppose qu'une installation du logiciel à partir du CD Live a été faite. Après cette installation et avant de continuer, il est recommandé de connecter le PC sur Internet pour y faire les dernières mises à jour. Pour les installations plus complexes se référer au Manuel de l'intégrateur.

source: == Latency Test
fr: == Test de latence (Latency Test)

source: The Latency Test determines how late your computer processor is in responding to a request. Some hardware can interrupt the processing which could cause missed steps when running a CNC machine. This is the first thing you need to do. Follow the instructions <<latency-test,here>> to run the latency test.
fr: Le test de latence détermine la capacité du processeur à répondre aux requêtes qui lui sont faites. Certains matériels peuvent interrompre ce processus, causant des pertes de pas lorsque le PC pilote une machine CNC. Ce test est la toute première chose à faire pour valider un PC. Pour le lancer, suivre les instructions de la section <<cha:test-de-latence,sur le test de latence>>.

source: If you have a Sherline several predefined configurations are provided. This is on the main menu CNC/EMC then pick the Sherline configuration that matches yours and save a copy.
fr: Si la machine est une Sherline, plusieurs configurations prédéfinies sont fournies. Au premier démarrage de LinuxCNC, le sélecteur de configuration s'ouvre, sélectionner alors le modèle correspondant à la machine _Sherline_, puis accepter d'enregistrer une copie.

source: If you have a Xylotex you can skip the following sections and go straight to the <<cha:stepconf-wizard,Stepper Config Wizard>>. LinuxCNC has provided quick setup for the Xylotex machines.
fr: Si la machine est une Xylotex, utiliser l'assistant graphique de configuration fourni avec LinuxCNC pour créer rapidement une configuration personnalisée <<cha:Assistant-graphique-StepConf,avec l'assistant Stepconf>>.

source: == Machine Information
fr: == Informations relatives à la machine

source: Gather the information about each axis of your machine.
fr: But, regrouper les informations à propos des axes de la machine.

source: Drive timing is in nano seconds. If you're unsure about the timing many popular drives are included in the stepper configuration wizard. Note some newer Gecko drives have different timing than the original one. A http://wiki.linuxcnc.org/[list] is also on the user maintained LinuxCNC wiki site of more drives.
fr: Les timings des pilotes sont exprimés en nanosecondes. Si l'opérateur n'est pas sûr de lui à propos des timings de son interface, les caractéristiques les plus populaires sont incluses dans l'assistant graphique de configuration. Noter que les pilotes Gecko ont des timings différents les uns des autres. Une liste des caractéristiques courantes est également maintenue sur le Wiki: http://wiki.linuxcnc.org/cgi-bin/wiki.pl?Stepper_Drive_Timing[de linuxcnc.org].

source: [width="100%", options="header"] |==================================================================== |Axis | Drive Type | Step Time ns | Step Space ns | Dir. Hold ns | Dir. Setup ns |X | | | | | |Y | | | | | |Z | | | | | | | | | | | |====================================================================
fr: [width="90%", options="header"] |============================================================================= |Axes | Type de pilote | Step Time ns | Step Space ns | Dir. Hold ns | Dir. Setup ns |X | | | | | |Y | | | | | |Z | | | | | | | | | | | |=============================================================================

source: == Pinout Information
fr: == Informations relatives au brochage

source: Gather the information about the connections from your machine to the PC parallel port.
fr: But, regrouper les informations à propos des différentes broches du port parallèle utilisé.

source: [width="100%", options="header"] |============================================================================== |Output Pin | Typ. Function | If Different | Input Pin | Typ. Function | If Different |1 | E-Stop Out | | 10 | X Limit/Home | |2 | X Step | | 11 | Y Limit/Home | |3 | X Direction | | 12 | Z Limit/Home | |4 | Y Step | | 13 | A Limit/Home | |5 | Y Direction | | 15 | Probe In | |6 | Z Step | | | | |7 | Z Direction | | | | |8 | A Step | | | | |9 | A Direction | | | | |14 | Spindle CW | | | | |16 | Spindle PWM | | | | |17 | Amplifier Enable | | | | |==============================================================================
fr: [width="90%", options="header"] |============================================================================== |Pin de sortie|Fonction |Si différent|Pin d'entrée|Fonction |Si différent |1 |Sortie A/U | |10 |Limite et OM X | |2 |X Step | |11 |Limite et OM Y | |3 |X Direction | |12 |Limite et OM Z | |4 |Y Step | |13 |Limite et OM A | |5 |Y Direction | |15 |Entrée palpeur | |6 |Z Step | | | | |7 |Z Direction | | | | |8 |A Step | | | | |9 |A Direction | | | | |14 |Broche sens horaire| | | | |16 |PWM broche | | | | |17 |Valide puissance | | | | |==============================================================================

source: Note any pins not used should be set to Unused in the drop down box. These can always be changed later by running Stepconf again.
fr: Noter que toutes les broches inutilisées doivent être explicitement indiquées 'Inutilisé' dans le choix déroulant de l'assistant. Elles pourront être modifiées par la suite en relançant Stepconf.

source: == Mechanical Information
fr: == Informations relatives à la mécanique

source: Gather information on steps and gearing. The result of this is steps per user unit which is used for SCALE in the .ini file.
fr: But, regrouper les informations à propos des réducteurs. Utilisées pour définir la taille d'un pas dans l'unité utilisateur. La taille du pas est utilisée par SCALE dans le fichier .ini.

source: [width="100%", options="header"] |============================================================================== |Axis | Steps/Rev. | Micro Steps | Motor Teeth | Leadscrew Teeth | Leadscrew Pitch |X | | | | | |Y | | | | | |Z | | | | | | | | | | | |==============================================================================
fr: [width="90%", options="header"] |==================================================================== |Axes | Pas par tour | Micropas | Dents moteur | Dents vis | Pas de la vis |X | | | | | |Y | | | | | |Z | | | | | | | | | | | |====================================================================

source: * 'Steps per revolution' - is how many stepper-motor-steps it takes to turn the stepper motor one revolution. Typical is 200.
fr: * 'Pas par tour' - indique combien de pas moteur sont nécessaires pour que celui-ci fasse un tour. Valeur typique: 200.

source: * 'Micro Steps' - is how many steps the drive needs to move the stepper motor one full step. If microstepping is not used, this number will be 1. If microstepping is used the value will depend on the stepper drive hardware.
fr: * 'Micro-pas' - indique combien d'impulsions le pilote doit recevoir pour que le moteur tourne d'un angle équivalent à un pas. Si les micro-pas ne sont pas utilisés, cette valeur devra être mise à 1. Si les micro-pas sont utilisés, les valeurs dépendent du pilote matériel du moteur.

source: * 'Motor Teeth and Leadscrew Teeth' - is if you have some reduction (gears, chain, timing belt, etc.) between the motor and the leadscrew. If not, then set these both to 1.
fr: * 'Dents moteur et Dents vis' - Valeur de réduction si une réduction (poulies/courroie, chaine, pignons etc) entre le moteur et la vis est utilisée. Sinon mettre 1 pour les deux paramètres.

source: * 'Leadscrew Pitch' - is how much movement occurs (in user units) in one leadscrew turn. If you're setting up in inches then it is inches per turn. If you're setting up in millimeters then it is millimeters per turn.
fr: * 'Pas de la vis' - indique la longueur de déplacement du mobile pour un tour de la vis d’entraînement de l'axe.

source: The net result you're looking for is how many CNC-output-steps it takes to move one user unit (inches or mm).
fr: Le résultat qui est recherché, c'est combien de pas le pilote devra fournir pour que le mobile avance d'une unité utilisateur (pouces ou mm).

source: .Units inches ============================================
fr: .Unités en pouces ====

source: .... Stepper = 200 steps per revolution Drive = 10 micro steps per step Motor Teeth = 20 Leadscrew Teeth = 40 Leadscrew Pitch = 0.2000 inches per turn .... ============================================
fr: .... Moteur = 200 pas par tour Pilote = 10 micropas par pas Dents côté moteur = 20 Dents côté vis = 40 Pas de vis = 0.2000 pouces par tour .... ====

source: From the above information (inch):
fr: D'après l'exemple ci-dessus (pouces):

source: . the leadscrew moves 0.200 inches per turn. . The motor turns 2.000 times per 1 leadscrew turn. . The drive takes 10 microstep inputs to make the stepper step once. . The drive needs 2000 steps to turn the stepper one revolution.
fr: - le mobile se déplacera de 0.200 pouces pour 1 tour de vis. - Le pilote demandera 10 impulsions en entrée pour faire un pas entier. - Le moteur fera 2000 micro-pas par tour de vis. - Le pilote recevra 2000 impulsions de pas pour faire tourner le moteur d'un tour.

source: So the scale needed is (inch):
fr: Ainsi, l'échelle nécessaire sera (pouces):

source: image::images/step-calc-inch-math.png[align="center"]
fr: image::images/step-calc-inch-math.png[align="left"]

source: .Units mm ============================================
fr: .Unités en millimètres ====

source: .... Stepper = 200 steps per revolution Drive = 8 micro steps per step Motor Teeth = 30 Leadscrew Teeth = 90 Leadscrew Pitch = 5.00 mm per turn .... ============================================
fr: .... Pas par tour = 200 pas par tour Micropas = 8 micropas Dents côté moteur = 30 Dents côté vis = 90 Pas de la vis = 5.00 mm par tour .... ====

source: From the above information (mm):
fr: D'après l'exemple ci-dessus (mm):

source: . The leadscrew moves 5.00 mm per turn. . The motor turns 3.000 times per 1 leadscrew turn. . The drive takes 8 microstep inputs to make the stepper step once. . The drive needs 1600 steps to turn the stepper one revolution.
fr: - la vis déplacera le mobile de 5.00 mm par tour. - Le moteur fera 3 tours pour 1 tour de vis. (90/30) - Le pilote utilisera 8 micro-pas pour faire un pas. - Le pilote aura besoin de 1600 impulsions pour un tour moteur.

source: So the scale needed is (mm):
fr: Ainsi, l'échelle nécessaire sera (mm):

source: image::images/step-calc-mm-math.png[align="center"]
fr: image::images/step-calc-mm-math.png[align="left"]
