Repository: 0000duck/linuxcnc
Catalog: docs/src/getting-started/stepconf.*.po
Languages: fr

source: Before the 'limit switch' there is a 'soft limit'. This is a limit enforced in software after homing. If a MDI command or g code program would pass the soft limit, it is not executed. If a jog would pass the soft limit, it is terminated at the soft limit.
fr: Avant le contact de 'limite' se trouve une limite logicielle. Cette limite logicielle est introduite après la prise d'origine machine.Si une commande manuelle ou un programme G-code dépasse cette limite, ils ne seront pas exécutés. Si un mouvement en jog ou en manuel cherche à dépasser la limite logicielle, il sera interrompu sur cette limite.

source: The 'home switch' can be placed anywhere within the travel (between hard stops). As long as external hardware does not deactivate the motor amplifiers when the limit switch is reached, one of the limit switches can be used as a home switch.
fr: Le contact 'd'origine machine' peut être positionné n'importe où, le long d'une course entre les butées mécaniques. Si aucun mécanisme externe ne désactive la puissance moteur quand un contact de limite est enfoncé, un des contacts de limite peut être utilisé comme contact d'origine machine.

source: The 'zero position' is the location on the axis that is 0 in the machine coordinate system. Usually the 'zero position' will be within the 'soft limits'. On lathes, constant surface speed mode requires that machine 'X=0' correspond to the center of spindle rotation when no tool offset is in effect.
fr: La 'position zéro' correspond au 0 de l'axe dans le système de coordonnées pièce, après que la prise d'origine pièce de cette axe ait été faite. La position zéro doit se trouver entre les deux limites logicielles pour que l'usinage soit possible. Sur les tours, le mode vitesse à surface constante requiert que la coordonnée *X=0* corresponde au centre de rotation de la broche quand aucun correcteur d'outil n'est actif.

source: The 'home position' is the location within travel that the axis will be moved to at the end of the homing sequence. This value must be within the 'soft limits'. In particular, the 'home position' should never be exactly equal to a 'soft limit'.
fr: La position de l'origine est la position, située le long de l'axe, sur laquelle le mobile sera déplacé à la fin de la séquence de prise d'origine. Cette position doit se situer entre les limites logicielles. En particulier, la position de l'origine ne doit jamais être égale à une limite logicielle. On place habituellement cette position au point le plus facile pour réaliser le changement d'outil.

source: === Operating without Limit Switches[[sub:Operating-without-Limit]] (((Operating without Limit Switches)))
fr: === Exploitation sans fin de course[[sec:exploitation-sans-limite]]

source: A machine can be operated without limit switches. In this case, only the soft limits stop the machine from reaching the hard stop. Soft limits only operate after the machine has been homed.
fr: Une machine peut être utilisée sans contact de fin de course. Dans ce cas, seules les limites logicielles empêcheront la machine d'atteindre les butées mécaniques. Les limites logicielles n’opèrent qu'après que la POM (prise d'origine machine) soit faite sur la machine.

source: === Operating without Home Switches[[sub:Operating-without-Home]] (((Operating without Home Switches)))
fr: === Exploitation sans contact d'origine[[sec:exploitation-sans-origine]]

source: A machine can be operated without home switches. If the machine has limit switches, but no home switches, it is best to use a limit switch as the home switch (e.g., choose 'Minimum Limit + Home X' in the pinout). If the machine has no switches at all, or the limit switches cannot be used as home switches for another reason, then the machine must be homed 'by eye' or by using match marks. Homing by eye is not as repeatable as homing to switches, but it still allows the soft limits to be useful.
fr: Une machine peut être utilisée sans contact d'origine machine. Si la machine dispose de contacts de fin de course, mais pas de contact d'origine machine, il est préférable d'utiliser le contact de fin de course comme contact d'origine machine (exemple, choisir 'Limite mini + origine X' dans le réglage du port). Si la machine ne dispose d'aucun contact, ou que le contact de fin de course n'est pas utilisable pour une autre raison, alors la prise d'origine machine peut toujours être réalisée à la main. Faire la prise d'origine à la main n'est certes pas aussi reproductible que sur des contacts, mais elle permet tout de même aux limites logicielles d'être utilisables.

source: === Home and Limit Switch wiring options[[sub:Home-and-Limit]] (((Home and Limit Switch wiring options)))
fr: === Câblage des contacts de fin de course et d'origine machine[[sec:Contacts-Origine-et-Limites]]

source: The ideal wiring for external switches would be one input per switch. However, the PC parallel port only offers a total of 5 inputs, while there are as many as 9 switches on a 3-axis machine. Instead, multiple switches are wired together in various ways so that a smaller number of inputs are required.
fr: Le câblage idéal des contacts externes serait une entrée par contact. Toutefois, un seul port parallèle d'ordinateur offre un total de 5 entrées,alors qu'il n'y a pas moins de 9 contacts sur une machine 3 axes. Au lieu de cela, plusieurs contacts seront câblés ensembles, selon diverse combinaisons, afin de nécessiter un plus petit nombre d'entrées.

source: The figures below show the general idea of wiring multiple switches to a single input pin. In each case, when one switch is actuated, the value seen on INPUT goes from logic HIGH to LOW. However, LinuxCNC expects a TRUE value when a switch is closed, so the corresponding 'Invert' box must be checked on the pinout configuration page. The pull up resistor show in the diagrams pulls the input high until the connection to ground is made and then the input goes low. Otherwise the input might float between on and off when the circuit is open. Typically for a parallel port you might use 47k.
fr: Les figures ci-dessous montrent l'idée générale du câblage de plusieurs contacts à une seule broche d'entrée. Dans chaque cas, lorsqu'un contact est actionné, la valeur vue sur l'entrée va passer d'une logique haute à une logique basse. Cependant, LinuxCNC s'attend à une valeur VRAIE quand un contact est fermé, de sorte que les cases Inverser correspondantes devront être cochées sur la page de réglage du port parallèle. Une résistance de rappel est nécessaire dans le circuit pour tirer l'entrée au nivaux haut. La valeur typique pour un port parallèle est de 47K. Une bonne sécurité utilise des contacts normalement fermés sans pièce de commande souple.

source: .Normally Closed Switches[[cap:Normally-Closed-Switches]]
fr: .Contacts normalement fermés[[cap:Contacts-Normalement-Fermes]]

source: Wiring N/C switches in series (simplified diagram)
fr: Câblage de contacts NC en série (schéma simplifié)

source: image::images/switch-nc-series.png[align="center"]
fr: image::images/switch-nc-series_fr.png[align="left"]

source: .Normally Open Switches[[cap:Normally-Open-Switches]]
fr: .Contacts normalement ouverts[[cap:Contacts-Normalement-Ouverts]]

source: Wiring N/O switches in parallel (simplified diagram)
fr: Câblage de contacts NO en parallèle (schéma simplifié)

source: image::images/switch-no-parallel.png[align="center"]
fr: image::images/switch-no-parallel_fr.png[align="left"]

source: The following combinations of switches are permitted in Stepconf:
fr: Les combinaisons suivantes sont permises dans Stepconf:

source: Combine home switches for all axes
fr: * Les contacts d'origine machine de tous les axes combinés.

source: Combine limit switches for all axes
fr: * Les contacts de fin de course de tous les axes combinés.

source: Combine both limit switches for one axis
fr: * Les contacts de fin de course d'un seul axe combinés.

source: Combine both limit switches and the home switch for one axis
fr: * Les contacts de fin de course et le contact d'origine machine d'un seul axe, combinés.

source: Combine one limit switch and the home switch for one axis
fr: * Un seul contact de fin de course et le contact d'origine machine d'un seul axe, combinés.
