Repository: 0000duck/linuxcnc
Catalog: docs/src/getting-started/stepconf.*.po
Languages: fr

source: * 'Home Switch Location' - The location at which the home switch trips or releases reletive to the machine origin. This item and the two below only appear when Home Switches were chosen in the Parallel Port Pinout. If you combine home and limit switches the home switch location can not be the same as the home position or you will get a joint limit error.
fr: * 'Position du contact d'origine machine' - Position relative à l'origine machine, à laquelle le contact d'origine est activé ou relâché pendant la procédure de prise d'origine. Cet item et les deux suivants, n'apparaissent que si les contacts d'origine ont été sélectionnés dans le réglage des broches du port parallèle. Si les contacts d'origine machine et ceux de limite d'axe sont combinés, la position du contact d'origine ne peut pas être la même que celle de l'origine ou une erreur de dépassement de limite surviendrait.

source: * 'Home Search Velocity' - The velocity to use when searching for the home switch. If the switch is near the end of travel, this velocity must be chosen so that the axis can decelerate to a stop before hitting the end of travel. If the switch is only closed for a short range of travel (instead of being closed from its trip point to one end of travel), this velocity must be chosen so that the axis can decelerate to a stop before the switch opens again, and homing must always be started from the same side of the switch. If the machine moves the wrong direction at the beginning of the homing procedure, negate the value of 'Home Search Velocity'.
fr: * 'Vitesse de recherche de l'origine' - Vitesse utilisée pendant le déplacement vers le contact d'origine machine. Si le contact est proche d'une limite physique de déplacement de la table, cette vitesse doit être suffisamment basse pour permettre de décélérer et de s'arrêter avant d'atteindre la butée mécanique et cela, malgré l'inertie du mobile. Si le contact est fermé par la came sur une faible longueur de déplacement (au lieu d'être fermé depuis son point de fermeture jusqu'au bout de le course), cette vitesse doit être réglée pour permettre la décélération et l'arrêt, avant que le contact ne soit dépassé et ne s'ouvre à nouveau. La prise d'origine machine doit toujours commencer du même côté du contact. Si la machine se déplace dans la mauvaise direction au début de la procédure de prise d'origine machine, rendre négative la valeur de 'Vitesse de recherche de l'origine'.

source: * 'Home Latch Direction' - Choose 'Same' to have the axis back off the switch, then approach it again at a very low speed. The second time the switch closes, the home position is set. Choose 'Opposite' to have the axis back off the switch and when the switch opens, the home position is set.
fr: * 'Dégagement du contact d'origine' - Choisir 'Identique' pour que la machine reparte d'abord en arrière, dégage le contact, puis revienne de nouveau vers lui à très petite vitesse. La seconde fois que le contact se ferme, la position de l'origine machine est acquise. Choisir 'Opposition' pour que la machine reparte en arrière à très petite vitesse jusqu'au dégagement du contact. Quand le contact s'ouvre, la position de l'origine machine est acquise.

source: * 'Time to accelerate to max speed' - Time to reach maximum speed calculated from 'Max Acceleration' and 'Max Velocity'.
fr: * 'Temps pour accélérer à la vitesse maxi' - Temps en secondes, calculé en fonction des paramètres renseignés précédemment.

source: * 'Distance to accelerate to max speed' - Distance to reach maximum speed from a standstill.
fr: * 'Distance pour accélérer à la vitesse maxi' - Distance en mm, calculée en fonction des paramètres renseignés précédemment.

source: * 'Pulse rate at max speed' - Information computed based on the values entered above. The greatest 'Pulse rate at max speed' determines the 'BASE_PERIOD'. Values above 20000Hz may lead to slow response time or even lockups (the fastest usable pulse rate varies from computer to computer)
fr: * 'Fréquence des impulsions à la vitesse maxi' - Informations calculées sur la base des informations entrées précédemment. Il faut rechercher la plus haute fréquence des impulsions à la vitesse maxi possible, elle détermine la période de base 'BASE_PERIOD'. Des valeurs supérieures à 20000Hz peuvent toutefois provoquer des ralentissements importants de l'ordinateur, voir même son blocage (La plus grande fréquence utilisable variera d'un ordinateur à un autre)

source: * 'Axis SCALE' - The number that will be used in the ini file [SCALE] setting. This is how many steps per user unit.
fr: * 'Échelle de l'axe' - Le nombre qui sera utilisé dans le fichier ini comme paramètre [SCALE]. C'est le nombre de pas moteur par unité utilisateur.

source: * 'Test this axis' - This will open a window to allow testing for each axis. This can be used after filling out all the information for this axis.
fr: * 'Test de cet axe' - Ouvre une fenêtre permettant de tester les paramètres pour chaque axe. Il est possible de modifier par expérimentation certaines données et de les reporter dans la configuration.

source: === Test This Axis
fr: === Tester cet axe

source: .Test This Axis[[cap:Test-This-Axis]]
fr: .Tester cet axe[[cap:Tester-Cet-Axe]]

source: image::images/stepconf-test.png[align="center"]
fr: image::images/stepconf-test_fr.png[]

source: Test this axis is a basic tester that only outputs step and direction signals to try different values for acceleration and velocity.
fr: Tester cet axe et un test simple pour définir les signaux de direction et de pas, ainsi que les valeurs d'accélération et de vitesse.

source: [IMPORTANT] In order to use test this axis you have to manually enable the axis if this is required. If your driver has a charge pump you will have to bypass it. Test this axis does not react to limit switch inputs. Use with caution.
fr: [IMPORTANT] Pour pouvoir utiliser ce test d'axe, il sera peut-être nécessaire de valider manuellement l'axe à tester. Si le driver utilise une pompe de charge, il faudra la bi-passer pour essayer les différentes valeurs de vitesse et d'accélération. Ce test doit être utilisé avec précaution car les contacts de limite d'axe ne sont pas actifs.

source: ==== Finding Maximum Velocity[[finding-maximum-velocity]](((Finding Maximum Velocity)))
fr: ==== Trouver la vitesse maximale[[sec:Trouver-Vitesse-Maximale]]

source: Begin with a low Acceleration // comment out latexmath until a fix is found for the html docs // (e.g., latexmath:[ 2 in/s^2 ] or latexmath:[ 50 mm/s^2 ]) (for example, *+2 inches/s^2^+* or *+50 mm/s^2^+*) and the velocity you hope to attain. Using the buttons provided, jog the axis to near the center of travel. Take care because with a low acceleration value, it can take a surprising distance for the axis to decelerate to a stop.
fr: Commencer avec une faible valeur d'accélération (par exemple, *+2 pouces/s^2^+* ou *+50 mm/s^2^+*) et la vitesse espérée. En utilisant les boutons de jog, positionner l'axe vers son centre. Il faut être prudent, car avec peu d'accélération, la distance d'arrêt peut être très surprenante.

source: After gaging the amount of travel available, enter a safe distance in Test Area, keeping in mind that after a stall the motor may next start to move in an unexpected direction. Then click Run. The machine will begin to move back and forth along this axis. In this test, it is important that the combination of Acceleration and Test Area allow the machine to reach the selected Velocity and 'cruise' for at least a short distance -- the more distance, the better this test is. The formula *+d = 0.5 * v * v/a+* // latexmath:[ d = 0.5 * v * v/a ] gives the minimum distance required to reach the specified velocity with the given acceleration. If it is convenient and safe to do so, push the table against the direction of motion to simulate cutting forces. If the machine stalls, reduce the speed and start the test again.
fr: Après avoir évalué le déplacement possible dans chaque direction en toute sécurité, entrer une distance dans le champs 'Zone de test', garder à l'esprit qu'après un décrochage, le moteur peut repartir dans la direction inattendue. Puis cliquer sur 'Lancer'. La machine commencera à aller et venir le long de cet axe. Dans cet essai, il est important que la combinaison entre l'accélération et la zone de test, permette à la machine d'atteindre la vitesse sélectionnée et de s'y déplacer au moins, sur une courte distance. La formule *+d = 0.5 * v * v/a+*, donne la distance minimale requise pour atteindre la vitesse de 'croisière'. Si la sécurité est garantie, pousser sur la table dans la direction inverse du mouvement pour simuler les efforts de coupe. Si la table décroche, réduire la vitesse et recommencer le test.

source: If the machine did not obviously stall, click the 'Run' button off. The axis now returns to the position where it started. If the position is incorrect, then the axis stalled or lost steps during the test. Reduce Velocity and start the test again.
fr: Si la machine ne présente aucun décrochage, re-cliquer sur le bouton 'Lancer' pour le désactiver. L'axe revient alors à sa position de départ. Si cette position est incorrecte, c'est que l'axe a calé ou a perdu des pas au cours de l'essai. Réduire la vitesse et relancer le test.

source: If the machine doesn't move, stalls, or loses steps, no matter how low you turn Velocity, verify the following:
fr: Si la machine ne se déplace pas, cale, vibre ou perd des pas, même à faible vitesse, vérifier les éléments suivants:

source: - Correct step waveform timings - Correct pinout, including 'Invert' on step pins - Correct, well-shielded cabling - Physical problems with the motor, motor coupling, leadscrew, etc.
fr: - Corriger les paramètres de temps des impulsions de commande.- Le brochage du port et la polarité des impulsions. Les cases 'Inverser'.- La qualité des connexions et le blindage des câbles.- Les problèmes mécaniques avec le moteur, l'accouplement moteur, vis,raideurs etc.

source: Once you have found a speed at which the axis does not stall or lose steps during this testing procedure, reduce it by 10% and use that as the axis 'Maximum Velocity'.
fr: Quand la vitesse à laquelle l'axe ne perd plus de pas et à laquelle les mesures sont exactes pendant le test a été déterminée, réduire cette vitesse de 10% et l'utiliser comme 'vitesse maximale' pour cet axe.

source: ==== Finding Maximum Acceleration[[finding-maximum-acceleration]](((Finding Maximum Acceleration)))
fr: ==== Trouver l'accélération maximale[[sec:Trouver-Acceleration-Maximale]]

source: With the Maximum Velocity you found in the previous step, enter the acceleration value to test. Using the same procedure as above, adjust the Acceleration value up or down as necessary. In this test, it is important that the combination of Acceleration and Test Area allow the machine to reach the selected Velocity. Once you have found a value at which the axis does not stall or lose steps during this testing procedure, reduce it by 10% and use that as the axis Maximum Acceleration.
fr: Avec la vitesse maximale déterminée à l'étape précédente, entrer une valeur d'accélération approximative. Procéder comme pour la vitesse, en ajustant la valeur d'accélération en plus ou en moins selon le résultat. Dans cet essai, il est important que la combinaison de l'accélération et de la zone de test permette à la machine d'atteindre la vitesse sélectionnée. Une fois que la valeur à laquelle l'axe ne perd plus de pas pendant le test a été déterminée, la réduire de 10% et l'utiliser comme accélération maximale pour cet axe.

source: == Spindle Configuration[[sec:Spindle-Configuration]](((Spindle Configuration)))
fr: == Configuration de la broche[[sec:Page-configuration-de-la-broche]]

source: .Spindle Configuration Page[[cap:Spindle-Configuration-Page]]
fr: .Page configuration de la broche[[cap:Page-Configuration-de-la-broche]]

source: image::images/stepconf-spindle.png[align="center"]
fr: image::images/stepconf-spindle_fr.png[align="left"]

source: This page only appears when 'Spindle PWM' is chosen in the 'Parallel Port Pinout' page for one of the outputs.
fr: Cette page n'apparaît que quand 'PWM broche' est configuré dans le réglage du port parallèle.

source: === Spindle Speed Control[[spindle-speed-control]](((spindle speed control)))
fr: === Contrôle de la vitesse de broche[[sec:Controle-de-la-vitesse-de-broche]]

source: If 'Spindle PWM' appears on the pinout, the following information should be entered:
fr: Si 'PWM broche' apparaît dans le réglage du port parallèle, les informations suivantes doivent être renseignées:

source: * 'PWM Rate' - The 'carrier frequency' of the PWM signal to the spindle. Enter '0' for PDM mode, which is useful for generating an analog control voltage. Refer to the documentation for your spindle controller for the appropriate value.
fr: * 'Fréquence PWM' - La fréquence porteuse du signal PWM (modulation de largeur d'impulsions) du moteur de broche. Entrer 0 pour le mode PDM (modulation de densité d'impulsions), qui est très utile pour générer une tension de consigne analogique. Se reporter à la documentation du variateur de broche pour connaître la valeur appropriée.

source: * 'Speed 1 and 2, PWM 1 and 2' - The generated configuration file uses a simple linear relationship to determine the PWM value for a given RPM value. If the values are not known, they can be determined. For more information see <<determining-spindle-calibration,Determining Spindle Calibration>>.
fr: * 'Vitesse 1 et 2, PWM 1 et 2' - Le fichier de configuration généré utilise une simple relation linéaire pour déterminer la valeur PWM correspondant à une vitesse de rotation. Si les valeurs ne sont pas connues, elles peuvent être déterminées. Voir la section sur <<sec:calibration-broche,la calibration de la broche>>.

source: === Spindle-synchronized motion[[sub:Spindle-synchronized-motion-lathe]] (((Spindle-synchronized motion)))(((Lathe Threading)))
fr: === Mouvement avec broche synchronisée[[sec:Mouvement-avec-broche-synchronisee]]

source: When the appropriate signals from a spindle encoder are connected to LinuxCNC via HAL, LinuxCNC supports lathe threading. These signals are:
fr: Lorsque les signaux appropriés, provenant d'un codeur de broche, sont connectés au port parallèle, LinuxCNC peut être utilisé pour les usinages avec broche synchronisée comme le filetage ou le taraudage rigide. Ces signaux son les suivants:

source: 'Spindle Index' - Is a pulse that occurs once per revolution of the spindle.
fr: * 'Index broche' - Également appelé PPR broche, c'est une impulsion produite à chaque tour de broche.

source: * 'Spindle Phase A' - This is a pulse that occurs in multiple equally-spaced locations as the spindle turns.
fr: * 'Phase A broche' - C'est une suite d'impulsions carrées générées sur la voie A du codeur pendant la rotation de la broche. Le nombre d'impulsions pour un tour correspond à la résolution du codeur.

source: * 'Spindle Phase B (optional)' - This is a second pulse that occurs, but with an offset from Spindle Phase A. The advantages to using both A and B are direction sensing, increased noise immunity, and increased resolution.
fr: * 'Phase B broche' (optionnelle) - C'est une seconde suite d'impulsions, générées sur la voie B du codeur et décalées par rapport à celle de la voie A. L'utilisation de ces deux signaux permet d’accroître l'immunité au bruit et la résolution d'un facteur 4.

source: If 'Spindle Phase A' and 'Spindle Index' appear on the pinout, the following information should be entered:
fr: Si 'Phase A broche' et 'Index broche' apparaissent dans le réglage des broches du port, l'information suivante doit être renseignée sur la page de configuration broche:

source: * 'Use Spindle-At-Speed' - With encoder feedback one can choose to have linuxcnc wait for the spindle to reach the commanded speed before feed moves. Select this option and set the 'close enough' scale.
fr: * 'Utiliser Spindle-At-Speed' - Avec un retour de codeur il est possible de choisir d'attendre que la consigne de vitesse de broche soit atteinte avant que ne commence les mouvements d'usinage. Sélectionner cette option et ajuster l'échelle 'close enough' (assez prêt).

source: * 'Speed Display Filter Gain' - Setting for adjusting the stability of the visual spindle speed display.
fr: * 'Gain du filtre d'affichage vitesse' - Ajuster pour fixer la stabilité de l'affichage de vitesse broche.

source: * 'Cycles per revolution' - The number of cycles of the 'Spindle A' signal during one revolution of the spindle. This option is only enabled when an input has been set to 'Spindle Phase A'
fr: * 'Cycles par tour' - Le nombre d'impulsions par tour sur la pin 'Phase A broche'. Cette option n'est présente que si une entrée 'Phase A broche' est configurée.

source: * 'Maximum speed in thread' - The maximum spindle speed used in threading. For a high spindle RPM or a spindle encoder with high resolution, a low value of 'BASE_PERIOD' is required.
fr: * 'Vitesse maximale en filetage' - La vitesse de broche maximale utilisée en filetage. Pour exploiter un moteur de broche rapide ou un codeur ayant une résolution élevée, une valeur basse de BASE_PERIOD est requise.

source: === Determining Spindle Calibration[[determining-spindle-calibration]] (((Determining Spindle Calibration)))
fr: === Calibrer la broche[[sec:calibration-broche]](((Calibrer la broche)))

source: Enter the following values in the Spindle Configuration page:
fr: Entrer les valeurs suivantes dans la page de configuration de la broche:

source: [width="80%"] |============================ |Speed 1: | 0 | PWM 1: | 0 |Speed 2: | 1000 | PWM 2: | 1 |============================
fr: [width="80%"] |=============================== | Vitesse 1: | 0 | PWM 1: | 0 | Vitesse 2: | 1000 | PWM 2: | 1 |===============================

source: Finish the remaining steps of the configuration process, then launch LinuxCNC with your configuration. Turn the machine on and select the MDI tab. Start the spindle turning by entering: 'M3 S100'. Change the spindle speed by entering a different S-number: 'S800'. Valid numbers (at this point) range from 1 to 1000.
fr: Finir les étapes suivantes de la configuration, puis lancer LinuxCNC avec cette configuration. Mettre la machine en marche et aller dans l'onglet 'Données manuelles', démarrer le moteur de broche en entrant: M3 S100. Modifier la vitesse de broche avec différentes valeurs comme: S800. Les valeurs permises vont de 1 à 1000.

source: For two different S-numbers, measure the actual spindle speed in RPM. Record the S-numbers and actual spindle speeds. Run Stepconf again. For 'Speed' enter the measured speed, and for 'PWM' enter the S-number divided by 1000.
fr: Pour deux différentes valeurs de Snnn, mesurer la vitesse de rotation réelle de la broche en tours/mn. Enregistrer ces vitesses réelles de la broche. Relancer Stepconf. Pour les 'Vitesses', entrer les valeurs réelles mesurées et pour les 'PWM', entrer la valeur Snnn divisée par 1000.

source: Because most spindle drivers are somewhat nonlinear in their response curves, it is best to:
fr: Parce que la plupart des interfaces ne sont pas linéaires dans leur courbe de réponse, il est préférable de:

source: - Make sure the two calibration speeds are not too close together in RPM - Make sure the two calibration speeds are in the range of speeds you will typically use while milling
fr: - S'assurer que les deux points de mesure des vitesses en tr/mn ne soient pas trop rapprochés- S'assurer que les deux vitesses utilisées sont dans la gamme des vitesses utilisées généralement par la machine.

source: For instance, if your spindle will go from 0 RPM to 8000 RPM, but you generally use speeds from 400 RPM (10%) to 4000 RPM (100%), then find the PWM values that give 1600 RPM (40%) and 2800 RPM (70%).
fr: Par exemple, si la broche tourne entre 0tr/mn et 8000tr/mn, mais qu'elle est utilisée généralement entre 400tr/mn (10%) et 4000tr/mn (100%), prendre alors des valeurs qui donneront 1600tr/mn (40%) et 2800tr/mn (70%).

source: == Options[[sec:Advanced-Configuration-Options]](((Advanced Configuration Options)))
fr: == Options[[sec:Options-de-configuration-avancee]]

source: .Advanced Configuration[[cap:Advanced-Configuration]]
fr: .Configuration avancée[[cap:Configuration-avancee]]

source: image::images/stepconf-advanced.png[align="center"]
fr: image::images/stepconf-advanced_fr.png[align="left"]

source: * 'Include Halui' - This will add the Halui user interface component. See the Integrator Manual for more information on Halui.
fr: * 'Inclure l'interface Halui' - Ajoutera l'interface utilisateur Halui. Voir le manuel de l'intégrateur pour plus d'informations sur Halui.

source: * 'Include pyVCP' - This option adds the pyVCP panel base file or a sample file to work on. See the Integrator Manual for more information on pyVCP.
fr: * 'Inclure un panneau pyVCP' - Ceci ajoutera un panneau pyVCP de base, avec son fichier de configuration sur lequel il sera possible de travailler. Quelques options sont disponibles pour enrichir le panneau grâce à des cases à cocher. Voir le manuel de l'intégrateur pour plus d'information sur pyVCP.

source: * 'Include ClassicLadder PLC' - This option will add the ClassicLadder PLC (Programmable Logic Controller). See the Integrator Manual for more information on ClassicLadder.
fr: * 'Inclure l'API ClassicLadder' - Cette option ajoutera l'automate programmable en logique à contacts ClassicLadder. Voir le manuel de l'intégrateur pour plus d'information sur ClassicLadder.

source: * 'Onscreen Prompt For Tool Change' - If this box is checked, LinuxCNC will pause and prompt you to change the tool when 'M6' is encountered. This feature is usually only useful if you have presettable tools.
fr: * 'Dialogue à l'écran pour le changement d'outil' - Si cette case est cochée, LinuxCNC va faire une pause et ouvrir un dialogue pour monter l'outil <n> lorsque qu'un G-Code M6 T<n> sera rencontré. Cette possibilité n'est utile que si les outils sont préréglés.

source: == Machine Configuration Complete[[sub:Machine-Configuration-Complete]]
fr: == Appliquer la configuration[[sec:appliquer-configuration]]

source: Click 'Apply' to write the configuration files. Later, you can re-run this program and tweak the settings you entered before.
fr: Cliquer 'Appliquer' pour enregistrer les fichiers de configuration. Ensuite, il sera possible de relancer ce programme et ajuster les réglages entrés précédemment.

source: == Axis Travel, Home Location, and Home Switch Location[[sec:Axis-Travel-Home]] (((Axis Travel)))(((Home Location)))(((Home Switch Location)))
fr: == Position des fins de course[[sec:Position-Origine-Position-Contacts]]

source: For each axis, there is a limited range of travel. The physical end of travel is called the 'hard stop'.
fr: La course de chaque axe est délimitée. Les extrémités physiques d'une course sont appelées les 'butées mécaniques'.

source: Before the 'hard stop' there is a 'limit switch'. If the limit switch is encountered during normal operation, LinuxCNC shuts down the motor amplifier. The distance between the 'hard stop' and 'limit switch' must be long enough to allow an unpowered motor to coast to a stop.
fr: Avant la butée mécanique se trouve un contact de 'limite'. Si ce contact est rencontré pendant les opérations normales, LinuxCNC coupe la puissance du moteur. La distance entre le contact de limite et la butée mécanique doit être suffisante pour permettre au moteur, dont la puissance a été coupée, de s'arrêter malgré l'inertie du mobile. Ces fins de course doivent détecter le mobile sur toutes la distance d'arrêt et ne pas se réactiver en cas de dépassement dû à l'inertie.
