Repository: 0000duck/linuxcnc
Catalog: docs/src/getting-started/System_Requirements.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = System Requirements
fr: = Quelle configuration est requise

source: [[cha:system-requirements]] (((System Requirements)))
fr: [[cha:Configuration-requise]] (((Configuration requise)))

source: == Minimum Requirements (((Minimum Requirements)))
fr: == Configuration minimale (((Configuration minimale)))

source: The minimum system to run LinuxCNC and Ubuntu may vary depending on the exact usage. Stepper systems in general require faster threads to generate step pulses than servo systems. Using the Live-CD you can test the software before committing a computer. Keep in mind that the Latency Test numbers are more important than the processor speed for software step generation. More information on the Latency Test is <<latency-test,here>>.
fr: La configuration minimale pour faire tourner LinuxCNC sous Ubuntu varie selon l'usage envisagé. Les moteurs pas à pas en général exigent, pour générer leurs trains d'impulsions de pas, des machines plus rapides que les systèmes à servomoteurs. Il est possible de tester le logiciel à partir du DVD-Live avant de l'installer sur un ordinateur. Garder à l'esprit que les valeurs retournées par le test de latence (Latency Test), sont plus importantes que la vitesse du µP pour la génération logicielle des pas. Plus d'informations à ce propos dans la section relative au <<cha:test-de-latence, test de latence>>.

source: Additional information is on the LinuxCNC Wiki site:
fr: Des informations additionnelles sont disponibles sur le

source: LinuxCNC and Ubuntu should run reasonably well on a computer with the following minimum hardware specification. These numbers are not the absolute minimum but will give reasonable performance for most stepper systems.
fr: LinuxCNC et Ubuntu doivent fonctionner raisonnablement bien sur la configuration matérielle minimale suivante. Ces valeurs ne sont pas des valeurs minimales absolues mais donneront des performances acceptables de la plupart des systèmes à moteurs pas à pas.

source: 700 MHz x86 processor (1.2 GHz x86 processor recommended)
fr: Microprocesseur x86 à 700 MHz (x86 à 1.2 GHz recommandé)

source: 384 MB of RAM (512 MB up to 1 GB recommended)
fr: 384 Mio de RAM (512 Mio à 1 Gio maximum, recommandé)

source: 8 GB hard disk
fr: 8 Go d'espace disque

source: * Graphics card capable of at least 1024x768 resolution, which is not using the NVidia or ATI fglrx proprietary drivers, and which is not an onboard video chipset that shares main memory with the CPU * A network or Internet connection (not strictly needed, but very useful for updates and for communicating with the LinuxCNC community)
fr: * Carte graphique avec une résolution minimale de 1024x768, n'utilisant pas les pilotes fglrx propriétaires de Nvidia ou d'AMD et n'étant pas une carte intégrée à la carte mère car elle partagerait la mémoire avec le CPU. * Une connexion Internet ou réseau (optionnelle mais très pratique pour les mises à jour et communiquer avec la communauté LinuxCNC)

source: Minimum hardware requirements change as Ubuntu evolves so check the https://help.ubuntu.com[Ubuntu] web site for details on the LiveCD you're using. Older hardware may benefit from selecting an older version of the LiveCD when available.
fr: Le minimum requis change avec les évolutions d'Ubuntu, voir le site https://help.ubuntu.com[Ubuntu] pour d'autres détails sur l'usage du liveCD utilisé. Sur des machines anciennes, il peut être intéressant de choisir une version de liveCD plus ancienne si elle est disponible.

source: == Problematic Hardware
fr: == Problématique du matériel

source: === Laptops
fr: === Les portables

source: Laptops are not generally suited to real time software step generation. Again a Latency Test run for an extended time will give you the info you need to determine suitability.
fr: Les portables donnent généralement de piètres performances pour les tâches temps réel utilisées pour la génération logicielle de pas. Encore une fois, lancer un test de latence sur une grande période de temps vous permettra de déterminer si le portable envisagé est utilisable ou non.

source: === Video Cards
fr: === Les cartes graphiques

source: If your installation pops up with 800 x 600 screen resolution then most likely Ubuntu does not recognize your video card or monitor. Onboard video many times causes bad real time performance.
fr: Si votre installation se termine par un écran avec une résolution de 800 x 600 il est alors probable que Ubuntu n'a pas reconnu votre carte graphique. Les cartes graphiques intégrées aux cartes mères donnent souvent de mauvaises performances temps réel.
