Repository: 0000duck/linuxcnc
Catalog: docs/src/getting-started/Updating_LinuxCNC.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = Updating LinuxCNC
fr: = Mise à jour de LinuxCNC

source: [[cha:updating_linuxcnc,Updating LinuxCNC]]
fr: [[cha:mettre_a_jour_linuxcnc,Mettre à jour LinuxCNC]]

source: This section describes how to upgrade LinuxCNC to version 2.7 from version 2.6. It assumes that you have an existing 2.6 install that you want to update to 2.7.
fr: Cette section décrit comment mettre à jour LinuxCNC de la version 2.6 vers la version 2.7. Ce qui suppose qu'une version 2.6 est déjà installée et qu'elle doit passer en version 2.7.

source: To upgrade LinuxCNC to version 2.7 from a version older than 2.6, you have to first upgrade your old install to 2.6, then follow these instructions to upgrade to 2.7.
fr: Pour mettre à jour LinuxCNC vers la version 2.7 depuis une version antérieure à la 2.6, il est nécessaire de commencer par une mise à jour en version 2.6, puis de suivre les instructions pour la mise à jour en version 2.7.

source: If you do not have an old (pre-2.7) version of LinuxCNC to upgrade, then you're best off making a fresh install of 2.7 as described in the section <<_getting_linuxcnc,Getting LinuxCNC>>.
fr: Pour une version plus ancienne encore, il est préférable de repartir d'une nouvelle installation complète directement en version 2.7 comme décrit dans la section <<cha:se_procurer_linuxcnc,Se procurer LinuxCNC>>.

source: == Upgrade to the new version
fr: == Mise à jour vers une nouvelle version

source: The basic idea is to disable the old linuxcnc.org apt sources and add a new linuxcnc.org apt source for 2.7, then upgrade LinuxCNC.
fr: L'idée de base consiste à invalider les anciennes sources apt de linuxcnc.org et à ajouter les sources pour la version 2.7, puis de mettre à jour LinuxCNC.

source: The details will depend on which platform you're running on. Run `lsb_release -ic` to find this information out:
fr: Les détails vont dépendre de la distribution sur laquelle on travaille. Lancer `lsb_release -ic` pour obtenir cette information en sortie:

source: You should be running on Debian Wheezy (as above), or Ubuntu Precise, or Ubuntu Lucid.
fr: Il faut être sur une distribution Debian Wheezy (comme dans l'exemple précédent), ou dans une Ubuntu Precise, ou Ubuntu Lucid.

source: [[sec:setting_apt_sources,Setting apt sources]]
fr: [[sec:ajuster_les_sources_apt,Ajuster les sources apt]]

source: === Setting apt sources
fr: === Ajuster les sources apt

source: Open the `Software Sources` window. The process for doing this differs slightly on the three supported platforms:
fr: Ouvrir la fenêtre `Sources de logiciels`. La procédure va un peu différer selon les 3 distributions supportées:

source: *** Click on `Applications Menu`, then `System`, then `Synaptic Package Manager`.
fr: *** Cliquer sur `Menu Applications`, puis `Système`, et enfin `Gestionnaire de paquets Synaptic`.

source: *** In Synaptic, click on the `Settings` menu, then click `Repositories` to open the `Software Sources` window.
fr: *** Dans Synaptic, cliquer sur le menu `Réglages`, puis cliquer sur `Dépôts` pour ouvrir la fenêtre `Sources de logiciels`.

source: *** Click on the `Dash Home` icon in the top left.
fr: *** Cliquer sur l’icône `tableau de bord` dans le coin en haut à gauche.

source: *** In the `Search` field, type "software", then click on the `Ubuntu Software Center` icon.
fr: *** Dans le champ `Rechercher`, taper "software", puis cliquer sur l'icône `Centre de logiciels Ubuntu`.

source: *** In the Ubuntu Software Center window, click on the `Edit` menu, then click on `Software Sources...` to open the `Software Sources` window.
fr: *** Dans la fenêtre du centre de logiciels Ubuntu, cliquer surle menu `Editer`, puis cliquer sur `Sources de logiciels...` pour ouvrir la fenêtre des `Sources de logiciels`.

source: *** Click the `System` menu, then `Administration`, then `Synaptic Package Manager`.
fr: *** Cliquer sur le menu `Système`, puis sur `Administration`, et `Gestionnaire de paquets Synaptic`.

source: In the `Software Sources` window, select the `Other Software` tab.
fr: Dans la fenêtre `Sources de logiciels`, sélectionner l'onglet `Autres logiciels`.

source: Delete or un-check all the old linuxcnc.org entries (leave all non-linuxcnc.org lines as they are).
fr: Effacer ou décocher toutes les anciennes entrées linuxcnc.org (laisser toutes celles ne concernant pas linuxcnc.org).

source: Click the `Add` button and add a new apt line. The line will be slightly different on the different platforms:
fr: Cliquer sur le bouton `Ajouter` et ajouter une nouvelle ligne apt. La ligne sera légèrement différente selon les plate-forme:

source: [options="header"] |=================================================================== | Platform | apt source line | Debian Wheezy | `deb http://linuxcnc.org wheezy base 2.7-rtai` | Ubuntu Precise | `deb http://linuxcnc.org precise base 2.7-rtai` | Ubuntu Lucid | `deb http://linuxcnc.org lucid base 2.7-rtai` |===================================================================
fr: [options="header"] |=================================================================== | Plate-forme | ligne source apt | Debian Wheezy | `deb http://linuxcnc.org wheezy base 2.7-rtai` | Ubuntu Precise | `deb http://linuxcnc.org precise base 2.7-rtai` | Ubuntu Lucid | `deb http://linuxcnc.org lucid base 2.7-rtai` |===================================================================

source: Click `Add Source`, then `Close` in the Software Sources window. If it pops up a window informing you that the information about available software is out-of-date, click the `Reload` button.
fr: Cliquer sur `Ajouter la source`, puis `Fermer` dans la fenêtre des sources de logiciels. Si des fenêtre surgissantes indiquent que des informations sont périmées, cliquer sur le bouton `Recharger`.

source: === Upgrading to the new version
fr: === Mettre à jour vers une nouvelle version

source: Now your computer knows where to get the new version of the software, next we need to install it.
fr: Maintenant que l'ordinateur connaît où aller chercher la nouvelle version de logiciel, il ne reste plus qu'à l'installer.

source: The process again differs depending on your platform.
fr: De nouveau, la procédure sera différente selon les distributions.

source: ==== Debian Wheezy and Ubuntu Lucid
fr: ==== Debian Wheezy et Ubuntu Lucid

source: Debian Wheezy and Ubuntu Lucid both use the Synaptic Package Manager.
fr: Debian Wheezy et Ubuntu Lucid utilisent tous les deux le gestionnaire de paquets Synaptic.

source: * Open Synaptic using the instructions in <<sec:setting_apt_sources,Setting apt sources>> above.
fr: Ouvrir Synaptic en suivant le paragraphe <<sec:ajuster_les_sources_apt,Ajuster les sources apt>>

source: Click the `Reload` button.
fr: Cliquer le bouton `Recharger`.

source: Use the Search function to search for `linuxcnc`.
fr: Utiliser la fonction de recherche pour `linuxcnc`.

source: Click the check box to mark the new linuxcnc and linuxcnc-doc-* packages for upgrade. The package manager may select a number of additional packages to be installed, to satisfy dependencies that the new linuxcnc package has.
fr: Cliquer la case à cocher pour marquer les nouveaux paquets linuxcnc et linuxcnc-doc-* à mettre à jour. Le gestionnaire de paquets peux sélectionner certains paquets additionnels à installer, pour satisfaire les dépendances envers les nouveaux paquets de linuxcnc.

source: Click the `Apply` button, and let your computer install the new package. The old linuxcnc package will be automatically upgraded to the new one.
fr: Cliquer sur le bouton `Appliquer`, et laisser l'ordinateur installer les nouveaux paquets. Les anciens paquets linuxcnc seront automatiquement mis à jour par la nouveaux.

source: Click on the `Dash Home` icon in the top left.
fr: Cliquer sur l'icône `Tableau de bord` en haut à gauche.

source: In the `Search` field, type "update", then click on the `Update Manager` icon.
fr: Dans le champ `Rechercher`, taper "update", puis cliquer sur l'icône du `Gestionnaire de mises à jour`.

source: Click the `Check` button to fetch the list of packages available.
fr: Cliquer sur le bouton `Choisir` pour obtenir la liste des paquets disponibles.

source: Click the `Install Updates` button to install the new versions of all packages.
fr: Cliquer sur le bouton `Installer les mises à jour` pour installer les nouvelles versions des paquets.

source: == Updating your config
fr: == Mettre à jour la configuration

source: LinuxCNC version 2.7 differs from version 2.6 in some ways that may require changes to your machine configuration.
fr: LinuxCNC en version 2.7 diffère de la version 2.6 sur plusieurs points qui requiert des modifications de configuration de la machine.

source: The Hostmot2 watchdog now gets handled by the hm2 `write` Hal function. There is no longer any need to run the hm2 `pet-watchdog` Hal function. The `pet-watchdog` function will be removed before the 2.7.0 release.
fr: Le watchdog de Hostmot2 doit maintenant être manipulé par la fonction Hal `write` de hm2. Il n'est plus nécessaire de lancer la fonction Hal `pet-watchdog` de Hm2. La fonction `pet-watchdog` sera supprimée avant la sortie de la version 2.7.0.

source: === Parport changes
fr: === Changements concernant Parport

source: Older versions of the LinuxCNC `hal_parport` driver conflicted with the Linux `parport_pc` driver. This required two mitigation techniques: we would prevent `parport_pc` from loading, and we would load another LinuxCNC driver called `probe_parport` before loading `hal_parport`.
fr: Les anciennes versions du pilote `hal_parport` de LinuxCNC étaient en conflit avec le pilote `parport_pc` de Linux. Ce qui nécessitait deux techniques d’atténuation: nous empêchions `parport_pc` de se charger et nous chargions un autre pilote appelé `probe_parport` avant de charger `hal_parport`.

source: The LinuxCNC `hal_parport` driver now cooperates well with the Linux `parport_pc` driver, and these mitigation techniques are no longer needed or useful. In 2.7, the `probe_parport` driver has been removed from LinuxCNC.
fr: Le pilote `hal_parport` de LinuxCNC coopère maintenant avec le pilote `parport_pc` de Linux, ces techniques d'atténuations ne sont donc plus, ni nécessaires, ni utiles. En version 2.7, le pilote `probe_parport` a été retiré de LinuxCNC.

source: This means configs that use the parallel port may need to be updated in the following ways:
fr: Ce qui veux dire que les configurations utilisant le port parallèle peuvent demander à être mises à jour de la manière suivante:

source: * Make sure LinuxCNC does not prevent the Linux `parport_pc` driver from loading. Older versions of LinuxCNC would blacklist `parport_pc` in `/etc/modprobe.d/linuxcnc.conf` (or `/etc/modprobe.d/emc2.conf` for even older versions of LinuxCNC). Comment out any lines in either of those files that looks like this: + `install parport_pc /bin/true`
fr: * Être sûr que LinuxCNC n'empêche pas le pilote `parport_pc` de Linux de se charger. Les anciennes versions de LinuxCNC blacklistaient `parport_pc` dans `/etc/modprobe.d/linuxcnc.conf` (ou `/etc/modprobe.d/emc2.conf` pour les plus anciennes versions de LinuxCNC). Modifier toutes ces lignes dans tous ces fichiers comme ça: `install parport_pc /bin/true`

source: Make sure your Hal configuration does not load the `probe_parport` component.
fr: Être sûr que la configuration de Hal ne charge pas le composant `probe_parport`.
