Repository: 0000duck/linuxcnc
Catalog: docs/src/common/User_Concepts.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = Important User Concepts
fr: = Concepts importants pour l'utilisateur

source: [[cha:important-user-concepts]] (((User Concepts)))
fr: [[cha:Concepts-pour-utilisateur]] (((Concepts pour l'utilisateur)))

source: This chapter covers important user concepts that should be understood before attempting to run a CNC machine with g code.
fr: Ce chapitre couvre d'importants concepts devant être bien compris avant de tenter d'exécuter un programme en G-code sur une machine CNC.

source: == Trajectory Control [[sec:trajectory-control]] (((Trajectory Control)))
fr: == Contrôle de trajectoire [[sec:trajectory-control]]

source: === Trajectory Planning
fr: === Planification de trajectoire

source: [WARNING] The new Trajectory Planner (TP) is on by default. + If you have no TP settings in your [TRAJ] section - LinuxCNC defaults to: + ARC_BLEND_ENABLE = 1 + ARC_BLEND_FALLBACK_ENABLE = 0 + ARC_BLEND_OPTIMIZATION_DEPTH = 50 + ARC_BLEND_GAP_CYCLES = 4 + ARC_BLEND_RAMP_FREQ = 100
fr: [WARNING] Le nouveau planificateur de trajectoire (TP) est activé par défaut. Si vous n'avez pas de réglage de TP dans la section [TRAJ] - LinuxCNC adoptera par défaut: ARC_BLEND_ENABLE = 1 ARC_BLEND_FALLBACK_ENABLE = 0 ARC_BLEND_OPTIMIZATION_DEPTH = 50 ARC_BLEND_GAP_CYCLES = 4 ARC_BLEND_RAMP_FREQ = 100

source: For more information on the Trajectory Panner ini options see the Integrators Manual.
fr: Pour davantage d'information sur les options d'initialisation du planificateur de trajectoire, reportez vous au manuel de l'intégrateur.

source: Trajectory planning, in general, is the means by which LinuxCNC follows the path specified by your G Code program, while still operating within the limits of your machinery.
fr: La planification de trajectoire est en général, le moyen qui permet à LinuxCNC de suivre le chemin spécifié par le programme G-code, tout en restant dans les limites permises par la machine.

source: A G Code program can never be fully obeyed. For example, imagine you specify as a single-line program the following move:
fr: Un programme en G-code ne peut jamais être exactement suivi. Par exemple, imaginez que vous spécifiez dans une ligne du programme le mouvement suivant:

source: G1 X1 F10 (G1 is linear move, X1 is the destination, F10 is the speed) ----
fr: G1 X10 F100 (G1 un mouvement linéaire, X10 la destination, F100 la vitesse) ----

source: In reality, the whole move can't be made at F10, since the machine must accelerate from a stop, move toward X=1, and then decelerate to stop again. Sometimes part of the move is done at F10, but for many moves, especially short ones, the specified feed rate is never reached at all. Having short moves in your G Code can cause your machine to slow down and speed up for the longer moves if the 'naive cam detector' is not employed with G64 Pn.
fr: En réalité, la totalité du mouvement ne peut pas être effectuée à F100, puisque la machine commence le mouvement à une vitesse nulle, elle doit accélérer pour se déplacer vers X=10, puis décélérer pour revenir à une vitesse nulle en fin de mouvement. Parfois une portion du mouvement se fera bien à F100, mais pour beaucoup de mouvements, spécialement les petits mouvements, la vitesse spécifiée ne sera jamais atteinte. Avoir des mouvements courts dans le programme peut provoquer de gros ralentissements, suivis d'accélérations brutales pour les longs mouvements si le détecteur 'naïve cam' n'est pas employé avec G64 Pn.

source: The basic acceleration and deceleration described above is not complex and there is no compromise to be made. In the INI file the specified machine constraints such as maximum axis velocity and axis acceleration must be obeyed by the trajectory planner.
fr: Les accélérations et décélérations de base décrites ici ne sont pas complexes et ne nécessitent pas de compromis. Les contraintes des axes de la machine sont placées dans le fichier ini, comme la vitesse maximum de l'axe et l'accélération ne devant pas être dépassées. Le planificateur de trajectoire obéira à ces contraintes.

source: === Path Following
fr: === Le suivi du parcours

source: A less straightforward problem is that of path following. When you program a corner in G Code, the trajectory planner can do several things, all of which are right in some cases: it can decelerate to a stop exactly at the coordinates of the corner, and then accelerate in the new direction. It can also do what is called blending, which is to keep the feed rate up while going through the corner, making it necessary to round the corner off in order to obey machine constraints. You can see that there is a trade off here: you can slow down to get better path following, or keep the speed up and have worse path following. Depending on the particular cut, the material, the tooling, etc., the programmer may want to compromise differently.
fr: Un problème plus compliqué est posé par le suivi du parcours. Quand vous programmez un angle droit en G-code, le planificateur de trajectoire peut suivre différents parcours, tous sont bons dans certains cas; il peut décélérer et s'arrêter exactement sur les coordonnées du sommet de l'angle, puis accélérer dans la direction perpendiculaire. Il peut également faire ce qui est appelé le mode 'trajectoire continue', qui consiste à maintenir la vitesse d'avance en passant vers le sommet de l'angle, ce qui nécessite d'arrondir l'angle de façon à respecter les contraintes machine. Vous pouvez remarquer qu'il y a dans ce cas un compromis: vous pouvez ralentir pour avoir un meilleur suivi du parcours, ou conserver une vitesse d'avance élevée au détriment de la finesse des angles, du fait d'un moins bon suivi du parcours. Selon les particularités de l'usinage, du matériau, de l'outillage, etc., le programmeur devra décider du bon compromis.

source: Rapid moves also obey the current trajectory control. With moves long enough to reach maximum velocity on a machine with low acceleration and no path tolerance specified, you can get a fairly round corner.
fr: Les mouvements rapides également, obéissent au contrôle de trajectoire courant. Avec des mouvements assez longs pour atteindre la vitesse maximale sur une machine ayant une faible accélération et en ne spécifiant pas de tolérance de parcours, il est possible d'obtenir des coins acceptablement arrondis.

source: === Programming the Planner(((Programming the Planner)))
fr: === La programmation du planificateur de trajectoire

source: The trajectory control commands are as follows:
fr: Les commandes de contrôle de trajectoire sont les suivantes:

source: * 'G61' - (Exact Path Mode) visits the programmed point exactly, even though that means it might temporarily come to a complete stop in order to change direction to the next programmed point.
fr: * 'G61' - (mode trajectoire exacte) indique au planificateur de suivre exactement la trajectoire prévue.

source: * 'G61.1' - (Exact Stop Mode) tells the planner to come to an exact stop at every segment's end.
fr: * 'G61.1' - (mode Arrêt exact) demande au planificateur de s'arrêter exactement à la fin de chaque segment. Le parcours sera suivi avec exactitude mais les arrêts complets de l'avance peuvent se révéler destructeurs pour la pièce ou l'outillage, selon les particularités de l'usinage.

source: * 'G64' - (Blend Without Tolerance Mode) G64 is the default setting when you start LinuxCNC. G64 is just blending and the naive cam detector is not enabled. G64 and G64 P0 tell the planner to sacrifice path following accuracy in order to keep the feed rate up. This is necessary for some types of material or tooling where exact stops are harmful, and can work great as long as the programmer is careful to keep in mind that the tool's path will be somewhat more curvy than the program specifies. When using G0 (rapid) moves with G64 use caution on clearance moves and allow enough distance to clear obstacles based on the acceleration capabilities of your machine.
fr: * 'G64' - (mode trajectoire continue sans tolérance) Le mode G64 est le mode par défaut au démarrage de LinuxCNC. G64 est juste une trajectoire continue, le 'Détecteur naïve CAM' n'est pas activé. G64 et G64 P0 indiquent au planificateur de sacrifier la précision de suivi du parcours pour conserver une vitesse d'avance élevée. Ce mode est nécessaire pour certains types de matériaux ou d'outillages pour lesquels l'arrêt exact est dangereux. Il peut très bien fonctionner tant que le programmeur garde à l'esprit que le parcours de l'outil pourra être plus arrondi que celui indiqué par le programme. Dans le cas d'un mouvement en G0 (rapide) avec G64, faire preuve de prudence sur les mouvements de dégagement et prévoir suffisamment de distance pour éviter les obstacles selon les capacités d'accélérations de la machine.

source: * 'G64 P- Q-' - (Blend With Tolerance Mode) This enables the 'naive cam detector' and enables blending with a tolerance. If you program G64 P0.05, you tell the planner that you want continuous feed, but at programmed corners you want it to slow down enough so that the tool path can stay within 0.05 user units of the programmed path. The exact amount of slowdown depends on the geometry of the programmed corner and the machine constraints, but the only thing the programmer needs to worry about is the tolerance. This gives the programmer complete control over the path following compromise. The blend tolerance can be changed throughout the program as necessary. Beware that a specification of G64 P0 has the same effect as G64 alone (above), which is necessary for backward compatibility for old G Code programs. See the G Code Chapter for more information on G64 P- Q-.
fr: * 'G64 Px.xxx' - (mode trajectoire continue avec tolérance) Ce mode active le 'Détecteur naïve CAM' et le mode trajectoire continue avec tolérance. Si vous utilisez le millimètre comme unité et programmez G64 P1.27, vous dites au planificateur que vous souhaitez une vitesse d'avance continue, mais qu'aux coins programmés vous voulez un ralentissement suffisant pour que le parcours de l'outil puisse rester à moins de 1.27mm du parcours programmé. L'amplitude exacte du ralentissement dépend de la géométrie de l'angle programmé et des contraintes machine, mais la seule chose dont le programmeur ait à se soucier est la tolérance, ce qui lui donne le contrôle complet des compromis du suivi de parcours. La tolérance de ce mode peut être modifiée tout au long du programme si nécessaire. Attention: spécifier un G64 P0 aura le même effet qu'un G64 seul (voir ci-dessus), c'est rendu nécessaire pour conserver la compatibilité ascendante avec les anciens programmes G-code. Voir le chapitre sur le G-code pour plus d'information sur G64 P- Q-.

source: * 'Blending without tolerance' - The controlled point will touch each specified movement at at least one point. The machine will never move at such a speed that it cannot come to an exact stop at the end of the current movement (or next movement, if you pause when blending has already started). The distance from the end point of the move is as large as it needs to be to keep up the best contouring feed.
fr: * 'Trajectoire continue sans tolérance' - Le point contrôlé touchera chaque mouvement spécifié à au moins un point. La machine ne pourra jamais se déplacer à une vitesse d'avance telle qu'elle ne puisse pas s'arrêter avec précision à la fin du mouvement en cours (ou du prochain mouvement, si vous mettez en pause lorsque la trajectoire est déjà commencée). La distance avec le point final du mouvement est aussi grande que nécessaire pour maintenir la meilleure vitesse d'avance possible pendant le parcours.

source: * 'Naive Cam Detector' - Successive G1 moves that involve only the XYZ axes that deviate less than Q- from a straight line are merged into a single straight line. This merged movement replaces the individual G1 movements for the purposes of blending with tolerance. Between successive movements, the controlled point will pass no more than P- from the actual endpoints of the movements. The controlled point will touch at least one point on each movement. The machine will never move at such a speed that it cannot come to an exact stop at the end of the current movement (or next movement, if you pause when blending has already started) On G2/3 moves in the G17 (XY) plane when the maximum deviation of an arc from a straight line is less than the G64 Q- tolerance the arc is broken into two lines (from start of arc to midpoint, and from midpoint to end). those lines are then subject to the naive cam algorithm for lines. Thus, line-arc, arc-arc, and arc-line cases as well as line-line benefit from the 'naive cam detector'. This improves contouring performance by simplifying the path.
fr: * 'Détecteur Naive Cam' - Les mouvements successifs en G1, concernant uniquement les axes XYZ, dont la déviation par rapport à une ligne droite est inférieur à P, sont fusionnés en une seule ligne droite. Ce mouvement fusionné remplace les mouvements individuels en G1 pour obtenir une nouvelle trajectoire avec tolérance. Entre les mouvements successifs, le point contrôlé ne passera jamais à plus de P- du point final du mouvement en cours. Le point contrôlé touchera au moins un point de chacun des mouvements. La machine ne pourra jamais se déplacer à une vitesse ne lui permettant pas de venir s'arrêter exactement à la fin du mouvement actuel (ou du prochain mouvement, si vous mettez en pause lorsque la trajectoire est déjà commencée). En mouvement G2/3 dans le plan G17 (XY) quand la déviation maximale entre un arc et une ligne droite est plus petite que la tolérance G64 Q- l'arc est brisé en deux lignes (du début de l'arc à son milieu et du milieu à la fin de l'arc). Ces deux tronçons sont ensuite soumis à l'algorithme Naïve cam des lignes. Ainsi, les cas ligne-arc, arc-arc et arc-ligne, comme les cas ligne-ligne bénéficient du traitement 'Détecteur naive CAM'. Les performances de contourage sont accrues grâce à la simplification de la trajectoire.

source: In the following figure the blue line represents the actual machine velocity. The red lines are the acceleration capability of the machine. The horizontal lines below each plot is the planned move. The upper plot shows how the trajectory planner will slow the machine down when short moves are encountered to stay within the limits of the machines acceleration setting to be able to come to an exact stop at the end of the next move. The bottom plot shows the effect of the Naive Cam Detector to combine the moves and do a better job of keeping the velocity as planned.
fr: Dans la figure suivante la ligne bleue représente la vitesse machine actuelle. La ligne rouge représente la capacité d'accélération de la machine. La ligne horizontale sous chaque tracé est le mouvement planifié. Le tracé supérieur montre comment le planificateur de trajectoire ralenti la machine quand des petits mouvements sont rencontrés. Ceci pour rester dans les limites fixées par les paramètres d'accélération de la machine et être capable de s'arrêter exactement à la fin du prochain mouvement. Le tracé du bas montre l'effet du détecteur Naive Cam pour combiner les mouvements et fournir une amélioration conséquente dans le suivi de la vitesse programmée.

source: .Naive Cam Detector
fr: .Détecteur Naive Cam

source: image::images/naive-cam.png[align="center"]
fr: image::images/naive-cam.png[]

source: === Planning Moves
fr: === Planification des mouvements

source: Make sure moves are 'long enough' to suit your machine/material. Principally because of the rule that the machine will never move at such a speed that it cannot come to a complete stop at the end of the current movement, there is a minimum movement length that will allow the machine to keep up a requested feed rate with a given acceleration setting.
fr: Assurez-vous que les mouvements soient 'assez longs' pour convenir à votre machine/matériel. Principalement en raison de la règle selon laquelle "la machine ne pourra jamais se déplacer à une vitesse ne lui permettant pas de venir s'arrêter complètement à la fin du mouvement actuel", il y a une longueur minimale de déplacement permettant à la machine d'atteindre la vitesse demandée avec un réglage d'accélération donné.

source: The acceleration and deceleration phase each use half the ini file MAX_ACCELERATION. In a blend that is an exact reversal, this causes the total axis acceleration to equal the ini file MAX_ACCELERATION. In other cases, the actual machine acceleration is somewhat less than the ini file acceleration
fr: Les phases d'accélération et de décélération utilisent chacune la moitié de la variable MAX_ACCELERATION du fichier .ini. Avec une trajectoire continue c'est exactement l'inverse, ce qui fait que l'accélération totale de l'axe est égal à la variable MAX_ACCELERATION. Dans d'autres cas, l'accélération actuelle de la machine est un peu inférieure à celle du fichier ini.

source: To keep up the feed rate, the move must be longer than the distance it takes to accelerate from 0 to the desired feed rate and then stop again. Using A as *1/2* the ini file MAX_ACCELERATION and F as the feed rate *in units per second*, the acceleration time is *t~a~ = F/A* and the acceleration distance is *d~a~ = F*t~a~/2*. The deceleration time and distance are the same, making the critical distance *d = d~a~ + d~d~ = 2 * d~a~ = F^2^/A*.
fr: Pour maintenir la vitesse d'avance, le mouvement doit être plus long que la distance qui lui est nécessaire pour accélérer de zéro à la vitesse souhaitée, puis de décélérer pour s'arrêter. En utilisant 'A' comme étant '1/2' de la variable MAX_ACCELERATION du fichier ini et 'F' comme étant la vitesse d'avance 'en unités par seconde', le temps d'accélération sera 't~a~ = F/A' et la distance d'accélération sera 'd~a~ = F*t~a~/2'. Les temps et distance de décélération sont les mêmes, ce qui fait que la distance critique 'd = d~a~ + d~d~ = 2 * d~a~ = F^2^/A'.

source: For example, for a feed rate of 1 inch per second and an acceleration of *10 inches/sec^2^*, the critical distance is *1^2^/10 = 1/10 = 0.1 inches*.
fr: Par exemple, pour une vitesse d'avance de '25mm par seconde' et une accélération de '250 mm/sec^2^', la distance critique sera de '10^2^/100 = 100/100 = 1mm'.

source: For a feed rate of 0.5 inch per second, the critical distance is *5^2^/100 = 25/10 = 0.025* inches.
fr: Pour une vitesse d'avance de '5mm par seconde', la distance critique ne serait que de '5^2^/100 = 25/100 = 0.25mm'.

source: === Defaults
fr: === Par défaut

source: When LinuxCNC first starts up many G and M codes are loaded by default. The current active G and M codes can be viewed on the MDI tab in the 'Active G-Codes:' window in the AXIS interface. These G and M codes define the behavior of LinuxCNC and it is important that you understand what each one does before running LinuxCNC. The defaults can be changed when running a G-Code file and left in a different state than when you started your LinuxCNC session. The best practice is to set the defaults needed for the job in the preamble of your G-Code file and not assume that the defaults have not changed. Printing out the G-Code <<quick-reference-table,Quick Reference>> page can help you remember what each one is.
fr: Quand LinuxCNC démarre pour la première fois beaucoup de G et M codes sont chargés par défaut. Les codes actifs courants sont visibles dans l'interface Axis, dans l'onglet 'Données manuelles' dans le champ 'G-codes actifs' Ces codes G et M définissent le comportement de LinuxCNC et il est important de bien comprendre la signification de chacun avant de démarrer LinuxCNC. Ces codes par défaut peuvent être modifiés lors du lancement d'un fichier de G-codes puis laissés dans différents états qui seront identiques lors d'une nouvelle session de LinuxCNC. La bonne pratique consiste à mettre dans le préambule de chaque fichier de G-codes les codes nécessaires pour le travail demandé et ne pas supposer que ceux par défaut conviendront. Imprimer la page des références rapides du G-code peut aider à se rappeler la signification de chacun d'eux.

source: === Feed Rate
fr: == Vitesse d'avance

source: How the feed rate is applied depends on if an axis involved with the move is a rotary axis. Read and understand the <<sub:feed-rate,Feed Rate>> section if you have a rotary axis or a lathe.
fr: Si vous avez un tour ou un axe rotatif, pour savoir comment la vitesse d'avance s'applique selon que l'axe est linéaire ou rotatif, lire et comprendre la section <<sub:Vitesse-d-avance,vitesse d'avance>> du manuel de l'utilisateur.

source: === Tool Radius Offset
fr: == Compensation de rayon d'outil

source: Tool Radius Offset (G41/42) requires that the tool be able to touch somewhere along each programmed move without gouging the two adjacent moves. If that is not possible with the current tool diameter you will get an error. A smaller diameter tool may run without an error on the same path. This means you can program a cutter to pass down a path that is narrower than the cutter without any errors. See the <<sec:cutter-compensation,Cutter Compensation>> Section for more information.
fr: La compensation de rayon d'outil (G41/G42) nécessite que l'outil puisse usiner tout au long de la trajectoire programmée sans interférer avec les mouvements d'entrée ou de sortie. Si c'est impossible avec le diamètre de l'outil courant, une erreur est signalée. Un diamètre d'outil inférieur est peut être utilisable sans erreur pour le même parcours. Ce qui signifie que quand ce type de problème se présente, il est possible de programmer un outil plus petit pour usiner le même parcours sans erreur. Voir la section compensation de rayon d'outil pour plus d'informations.

source: == Homing
fr: == Prise d'origine machine

source: After starting LinuxCNC each axis must be homed prior to running a program or running a MDI command.
fr: Après le démarrage de LinuxCNC chaque axe doit être référencé sur son point d'origine machine avant tout mouvement ou commande MDI.

source: If your machine does not have home switches a match mark on each axis can aid in homing the machine coordinates to the same place each time.
fr: Si votre machine ne dispose pas de contacts d'origine, un repère placé sur chaque axe peut aider à la prise d'origine machine en les remettant à la même place à chaque fois.

source: Once homed your soft limits that are set in the ini file will be used.
fr: Une fois les prises d'origine faites, les limites logicielles ajustées dans le fichier ini, seront utilisées.

source: If you want to deviate from the default behavior, or want to use the Mini interface you will need to set the option NO_FORCE_HOMING = 1 in the [TRAJ] section of your ini file. More information on homing can be found in the Integrator Manual.
fr: Pour déroger à ce comportement par défaut, ou pour utiliser l'interface Mini, il est possible d'ajuster l'option NO_FORCE_HOMING = 1 dans la section [TRAJ] du fichier ini.

source: == Tool Changes
fr: == Changement d'outil

source: There are several options when doing manual tool changes. See the [EMCIO] section of the Integrator Manual for information on configuration of these options. Also see the G28 and G30 section of the User Manual.
fr: Il existe plusieurs options pour effectuer un changement d'outil. Voir la section [EMCIO] dans le manuel de l'intégrateur pour les informations sur la configuration de ces options. Voir également les sections G28 et G30 du manuel de l'utilisateur.

source: == Coordinate Systems
fr: == Systèmes de coordonnées
