Repository: 0000duck/linuxcnc
Catalog: docs/src/common/User_Concepts.*.po
Languages: fr

source: The Coordinate Systems can be confusing at first. Before running a CNC machine you must understand the basics of the coordinate systems used by LinuxCNC. In depth information on the LinuxCNC Coordinate Systems is in the <<cha:coordinate-system,Coordinate System>> Section of this manual.
fr: Les systèmes de coordonnées peuvent être déroutant au premier abord. Avant de démarrer une machine CNC, il est important de bien comprendre les bases des systèmes utilisés par LinuxCNC. Pour explorer plus en profondeur les systèmes de coordonnées utilisés par LinuxCNC, voir le chapitre: <<cha:Systemes-de-coordonnees,sur les systèmes de coordonnées>>.

source: === G53 Machine Coordinate
fr: === G53 Coordonnées machine

source: When you home LinuxCNC you set the G53 Machine Coordinate System to 0 for each axis homed.
fr: Quand vous réalisez une prise d'origine de plusieurs axes de LinuxCNC, vous passez G53, les coordonnées système, à 0 pour chacun des axes concernés.

source: No other coordinate systems or tool offsets are changed by homing.
fr: La prise d'origine ne modifient en rien les autres systèmes de coordonnées, ni les décalages d'outil.

source: The only time you move in the G53 machine coordinate system is when you program a G53 on the same line as a move. Normally you are in the G54 coordinate system.
fr: La seule façon de se déplacer en mode G53, en coordonnées machine, c'est de programmer un G53 sur la même ligne que celle d'un mouvement. En fonctionnement normal, vous êtes dans le système de coordonnées G54.

source: === G54-59.3 User Coordinates
fr: === G54 à 59.3 Coordonnées utilisateur

source: Normally you use the G54 Coordinate System. When an offset is applied to a current user coordinate system a small blue ball with lines will be at the machine origin when your DRO is displaying 'Position: Relative Actual' in Axis. If your offsets are temporary use the Zero Coordinate System from the Machine menu or program 'G10 L2 P1 X0 Y0 Z0' at the end of your G Code file. Change the 'P' number to suit the coordinate system you wish to clear the offset in.
fr: Normalement vous utilisez le système de coordonnées G54. Quand un décalage est appliqué au système de coordonnées utilisateur courant, dans Axis, une petite sphère bleue avec des rayons est affichée à l'emplacement de l'origine machine quand la visu affiche 'Position: Relative Actuelle'. Si votre décalage utilise temporairement les coordonnées machine, depuis le menu Machine ou en programmant 'G10 L2 P1 X0 Y0 Z0' à la fin du programme G-Code. Modifiez la valeur du mot 'P' en fonction du système de coordonnées dont vous voulez effacer le décalage.

source: - Offsets stored in a user coordinate system are retained when LinuxCNC is shut down. - Using the 'Touch Off' button in Axis sets an offset for the chosen User Coordinate System.
fr: - Les décalages stockés dans un système de coordonnées utilisateur sont conservés à l'arrêt de LinuxCNC. - Dans Axis, utiliser le bouton 'Toucher' décalera le système de coordonnées utilisateur choisi.

source: === When You're Lost
fr: === Quand vous êtes perdu

source: If you're having trouble getting 0,0,0 on the DRO when you think you should, you may have some offsets programmed in and need to remove them.
fr: Si vous avez des difficultés pour obtenir 0,0,0 sur la visu alors que vous pensez que vous devriez l'avoir, c'est peut être provoqué par plusieurs décalages programmés et qu'il conviendrait de supprimer. Pour cela:

source: Move to the Machine origin with G53 G0 X0 Y0 Z0
fr: Placez vous sur l'origine machine avec 'G53 G0 X0 Y0 Z0'

source: Clear any G92 offset with G92.1
fr: Supprimez tous les décalages 'G92' avec 'G92.1'

source: Use the G54 coordinate system with G54
fr: Utilisez les coordonnées utilisateur avec 'G54'

source: Set the G54 coordinate system to be the same as the machine coordinate system with G10 L2 P1 X0 Y0 Z0 R0
fr: Rendez les coordonnées utilisateur 'G54', identiques aux coordonnées machine avec 'G10 L2 P1 X0 Y0 Z0 R0'

source: Turn off tool offsets with G49
fr: Annulez les décalages d'outil avec 'G49'

source: Turn on the Relative Coordinate Display from the menu
fr: Activez l'affichage des coordonnées relatives depuis le menu.

source: Now you should be at the machine origin X0 Y0 Z0 and the relative coordinate system should be the same as the machine coordinate system.
fr: Maintenant vous devriez être, à l'origine machine 'X0 Y0 Z0' et le système de coordonnées relatives devrait être le même que le système de coordonnées machine.

source: == Machine Configurations
fr: == La configuration machine

source: The following diagram shows a typical mill showing direction of travel of the tool and the mill table and limit switches. Notice how the mill table moves in the opposite direction of the Cartesian coordinate system arrows shown by the 'Tool Direction' image. This makes the 'tool' move in the correct direction in relation to the material.
fr: Le dessin suivant montre les directions de déplacement de l'outil et la position des fins de course de limite sur une fraiseuse classique. Noter le diagramme cartésien représentant les directions de déplacement de l'outil (Tool Direction). La direction de déplacement de la table et en opposition du système de coordonnées cartésiennes. Le système de coordonnées cartésiennes représente le sens de déplacement de l'outil. Ce sont toujours les déplacements de l'outil qui doivent être programmés pour que l'outil se déplace dans les directions correctes par rapport au matériel.

source: .Mill Configuration image::images/mill-diagram.png[align="center"]
fr: .Configuration typique d'une fraiseuse image::images/mill-diagram.png[align="left"]

source: The following diagram shows a typical lathe showing direction of travel of the tool and limit switches.
fr: Le dessin suivant montre les directions de déplacement de l'outil et la position des fins de course de limite sur un tour classique.

source: .Lathe Configuration image::images/lathe-diagram.png[align="center"]
fr: .Configuration typique d'un tour image::images/lathe-diagram.png[align="left"]
