Repository: 0000duck/linuxcnc
Catalog: docs/src/common/user_intro.*.po
Languages: fr

source: :lang: en
fr: :lang: fr

source: = LinuxCNC User Introduction
fr: = Introduction à LinuxCNC

source: [[cha:linuxcnc-user-introduction]] (((LinuxCNC User Introduction)))
fr: [[cha:linuxcnc-user-introduction]] (((Introduction à LinuxCNC)))

source: == This Manual
fr: == Introduction

source: The focus of this manual is on 'using' LinuxCNC. It is intended to be used once LinuxCNC is installed and configured. For standard installations see the Getting Started Guide for step by step instructions to get you up and going. For detailed information on installation and configuration of LinuxCNC see the Integrator Manual.
fr: Ce document est centré sur l'utilisation de LinuxCNC, il est plutôt destiné aux lecteurs l'ayant déjà installé et configuré. Quelques informations sur l'installation sont données dans les chapitres suivants. La documentation complète sur l'installation et la configuration se trouve dans le manuel de l'intégrateur.

source: == How LinuxCNC Works[[how-LinuxCNC-works]]
fr: == Comment fonctionne LinuxCNC[[sec:Comment-Fonctionne-LinuxCNC]]

source: The Enhanced Machine Controller (LinuxCNC) is a lot more than just another CNC mill program. It can control machine tools, robots, or other automated devices. It can control servo motors, stepper motors, relays, and other devices related to machine tools.
fr: LinuxCNC (The Enhanced Machine Controller) est un peu plus que juste un autre programme de fraiseuse CNC. Il est capable de contrôler des machines-outils, des robots ou d'autres automatismes. Il est capable de contrôler des servomoteurs, des moteurs pas à pas, des relais ainsi que d'autres mécanismes relatifs aux machines-outils.

source: There are four main components to the LinuxCNC software:
fr: Il y a quatre principales composantes du logiciel LinuxCNC:

source: a motion controller (EMCMOT)
fr: un contrôleur de mouvement (EMCMOT),

source: a discrete I/O controller (EMCIO)
fr: une contrôleur d'entrées/sorties discrètes (EMCIO),

source: a task executor which coordinates them (EMCTASK)
fr: un exécuteur de tâches qui coordonne celles-ci (EMCTASK),

source: and one of several graphical user interfaces.
fr: et les interfaces utilisateur graphiques.

source: In addition there is a layer called HAL (Hardware Abstraction Layer) which allows configuration of LinuxCNC without the need of recompiling.
fr: En outre il existe une couche appelée HAL (couche d'abstraction matérielle) qui permet la configuration de LinuxCNC sans avoir besoin de le recompiler.

source: .Simple LinuxCNC Controlled Machine[[fig:Typical_machine]]
fr: .Machine simple contrôlée par LinuxCNC

source: image::images/whatstep1.png[align="center"]
fr: image::images/whatstep1.png[align="left"]

source: The above figure shows a simple block diagram showing what a typical 3-axis LinuxCNC system might look like. This diagram shows a stepper motor system. The PC, running Linux(((Linux))) as its operating system, is actually controlling the stepper motor drives by sending signals through the printer port. These signals (pulses) make the stepper drives move the stepper motors. The LinuxCNC system can also run servo motors via servo interface cards or by using an extended parallel port to connect with external control boards. As we examine each of the components that make up an LinuxCNC system we will remind the reader of this typical machine.
fr: La figure ci-dessus montre un diagramme bloc représentant une machine 3 axes typique comme LinuxCNC les aime. Cette figure montre un système basé sur des moteurs pas à pas. Le PC,tournant sous Linux(((Linux))) contrôle les interfaces de puissance des moteurs pas à pas en leur envoyant des signaux au travers du port parallèle. Ces signaux (impulsionnels), font que la puissance adéquate est fournie aux moteurs. LinuxCNC peut également contrôler des servo-moteurs via une interface de puissance pour servomoteurs ou utiliser le port parallèle étendu connecté à une carte de contrôle externe. Quand nous examinerons chacun des composants qui forment un système LinuxCNC, nous nous référerons à cette machine typique.

source: == Graphical User Interfaces[[sub:Graphical-User-Interfaces]]
fr: == Interfaces utilisateur graphiques[[sub:Interfaces-utilisateur-graphiques]]

source: A user interface is the part of the LinuxCNC that the machine tool operator interacts with. The LinuxCNC comes with several types of user interfaces:
fr: L'interface graphique est la partie de LinuxCNC qui interagit avec l'opérateur de la machine. LinuxCNC est fourni avec plusieurs interfaces utilisateurs graphiques:

source: <<cha:axis-gui,'Axis'>>, the standard GUI interface.
fr: <<cha:Axis,'Axis'>>, l'interface utilisateur standard.

source: .Axis GUI[[fig:The-Axis-GUI]]
fr: .L'interface graphique AXIS[[fig:Interface-graphique-AXIS]]

source: image::images/axis-2.5.png[align="center"]
fr: image::images/axis_25_fr.png[align="left"]

source: <<cha:gmoccapy,'gmoccapy'>>, A industrial like GUI.
fr: <<cha:gmoccapy,'gmoccapy'>>, Une interface graphique quasiment industrielle.

source: image::images/gmoccapy_4_axis.png[align="center"]
fr: image::images/gmoccapy_4_axis.png[align="left"]

source: <<cha:touchy-gui,'Touchy'>>, a touch screen GUI.
fr: <<cha:touchy-gui,'Touchy'>>, une interface graphique pour écran tactile.

source: .Touchy GUI[[fig:touchy-gui]]
fr: .L'interface graphique Touchy[[fig:touchy-gui]]

source: image::images/touchy.png[align="center"]
fr: image::images/touchy_fr.png[align="left"]

source: * <<cha:ngcgui,'NGCGUI'>>, a subroutine GUI that provides 'fill in the blanks' programming of G code. It also supports concatenation of subroutine files to enable you to build a complete G code file without programming.
fr: * <<cha:ngcgui,'NGCGUI'>>, une interface graphique gérant les sous-programmes. Elle permet très simplement de créer des programme G-code. Elle supporte surtout la concaténation de fichiers de sous-programmes, ce qui permet de construire des programmes G-code complets sans aucune programmation.

source: .NGCGUI GUI embedded into Axis[[fig:ngcgui-gui]]
fr: .L'interface graphique NGCGUI intégrée dans Axis[[fig:ngcgui-gui]]

source: image::images/ngcgui.png[align="center"]
fr: image::images/ngcgui_fr.png[align="left"]

source: <<cha:mini-gui,'Mini'>>, a Tcl/Tk-based GUI
fr: <<cha:Mini,'Mini'>>, une interface en Tcl/Tk.

source: .The Mini GUI[[fig:The-Mini-GUI]]
fr: .L'interface graphique Mini[[fig:Interface-graphique-Mini]]

source: image::images/mini.png[align="center"]
fr: image::images/mini_fr.png[align="left"]

source: <<cha:tklinuxcnc-gui,'TkLinuxCNC'>>, a Tcl/Tk-based GUI
fr: <<cha:TkLinuxCNC,'TkLinuxCNC'>>, une autre interface basée sur Tcl/Tk.

source: .The TkLinuxCNC GUI[[fig:The-TkLinuxCNC-GUI]]
fr: .L'interface graphique tklinuxcnc[[fig:L-interface-graphique-tklinuxcnc]]

source: image::images/tkemc.png[align="center"]
fr: image::images/tklinuxcnc_fr.png[align="left"]

source: <<cha:keystick-gui,'Keystick'>>, a character-based screen graphics program suitable for minimal installations (without the X server running).
fr: <<cha:keystick-gui,'Keystick'>>, une interface graphique textuelle et minimaliste, appropriée pour les installations légères (sans serveur X par exemple).

source: .The Keystick GUI[[fig:The-Keystick-GUI]]
fr: .L'interface textuelle Keystick[[fig:L-interface-Keystick]]

source: image::images/keystick.png[align="center"]
fr: image::images/keystick.png[align="left"]

source: * 'Xemc', an X-Windows program. A simulator configuration of Xemc can be ran from the configuration picker.
fr: * 'Xemc', un programme X-Windows. Une configuration de Xemc, en simulateur, peut être exécutée à partir du sélecteur de configuration.

source: * 'halui' - a HAL based user interface which allows to control LinuxCNC using knobs and switches. See the Integrators manual for more information on halui.
fr: * 'halui', une interface utilisateur basée sur HAL, qui permet de contrôler LinuxCNC en utilisant des boutons et des interrupteurs.

source: * 'linuxcncrsh' - a telnet based user interface which allows commands to be sent to LinuxCNC from remote computers.
fr: * 'linuxcncrsh', une interface utilisateur basée sur telnet, qui permet d'envoyer des commandes à partir d'ordinateurs distants de celui de LinuxCNC

source: == Virtual Control Panels
fr: == Panneaux de contrôle virtuels

source: * 'PyVCP' a python based virtual control panel that can be added to the Axis GUI or be stand alone.
fr: * 'PyVCP', un panneau de contrôle virtuel basé sur Python, il peut être intégré dans l'interface graphique Axis ou utilisé en autonome.

source: .PyVCP with Axis[[fig:pyvcp-with-axis]]
fr: .PyVCP avec Axis[[fig:pyvcp-avec-axis]]

source: image::images/axis-pyvcp.png[align="center"]
fr: image::images/axis-pyvcp.png[align="left"]

source: * 'GladeVCP' - a glade based virtual control panel that can be added to the Axis GUI or be stand alone.
fr: * 'GladeVCP', un panneau de contrôle virtuel basé sur Glade, il peut être intégré dans l'interface graphique Axis ou utilisé en autonome.

source: image::images/axis-gladevcp.png[align="center"]
fr: image::images/axis-gladevcp.png[align="left"]

source: See the Integrators manual for more information on Virtual Control Panels.
fr: Voir le manuel de l'intégrateur pour des détails sur les panneaux de contrôle virtuels.

source: == Languages
fr: == Langues

source: LinuxCNC uses translation files to translate LinuxCNC User Interfaces into many languages. You just need to log in with the language you intend to use and when you start up LinuxCNC it comes up in that language. If your language has not been translated contact a developer on the IRC or the mailing list if you can assist in the translation.
fr: LinuxCNC utilise des fichiers traduits pour les interfaces utilisateur. Il fonctionne dans plusieurs langues et démarre dans la langue de la session ouverte par l'utilisateur au démarrage du PC. Si votre langue n'a pas encore été traduite contactez un développeur sur l'IRC ou sur la mailing liste si vous pouvez aider à la traduction.

source: == Thinking Like a Machine Operator[[sec:Thinking-Operator]]
fr: == Penser comme un opérateur sur CNC[[sec:Penser-operateur]]

source: This book will not even pretend that it can teach you to run a mill or a lathe. Becoming a machinist takes time and hard work. An author once said, "We learn from experience, if at all." Broken tools, gouged vices, and scars are the evidence of lessons taught. Good part finish, close tolerances, and careful work are the evidence of lessons learned. No machine, no computer program, can take the place of human experience.
fr: Ce manuel ne prétend pas vous apprendre à utiliser un tour ou une fraiseuse. Devenir un opérateur expérimenté prends beaucoup de temps et demande beaucoup de travail. Un auteur a dit un jour, 'Nous apprenons par l'expérience, si on la possède toute'. Les outils cassés, les étaux attaqués et les cicatrices sont les preuves des leçons apprises. Une belle finition, des tolérances serrées et la prudence pendant le travail sont les preuves des leçons retenues. Aucune machine, aucun programme ne peut remplacer l'expérience humaine.

source: As you begin to work with the LinuxCNC program, you will need to place yourself in the position of operator. You need to think of yourself in the role of the one in charge of a machine. It is a machine that is either waiting for your command or executing the command that you have just given it. Throughout these pages we will give information that will help you become a good operator of the LinuxCNC system. You will need some information right up front here so that the following pages will make sense to you.
fr: Maintenant que vous commencez à travailler avec le programme LinuxCNC, vous devez vous placer dans la peau d'un opérateur. Vous devez être dans le rôle de quelqu'un qui a la charge d'une machine. C'est une machine qui attendra vos commandes puis qui exécutera les ordres que vous lui donnerez. Dans ces pages, nous donnerons les explications qui vous aideront à devenir un bon opérateur de CNC avec LinuxCNC. Vous aurez besoin de bonnes informations ici, devant vous, c'est là que les pages suivantes prendront tout leur sens.

source: == Modes of Operation[[sub:Modes-of-Operation]]
fr: == Modes opératoires[[sub:Modes-operatoires]]

source: When LinuxCNC is running, there are three different major modes used for inputting commands. These are 'Manual', 'Auto', and 'MDI'. Changing from one mode to another makes a big difference in the way that the LinuxCNC control behaves. There are specific things that can be done in one mode that cannot be done in another. An operator can home an axis in manual mode but not in auto or MDI modes. An operator can cause the machine to execute a whole file full of G-codes in the auto mode but not in manual or MDI.
fr: Quand LinuxCNC fonctionne, il existe trois différents modes majeurs pour entrer des commandes. Les modes 'Manuel', 'Auto' et 'MDI'. Passer d'un mode à un autre marque une grande différence dans le comportement de LinuxCNC. Des actions spécifiques à un mode, ne peuvent pas être faites dans un autre. L'opérateur peut faire une prise d'origine sur un axe en mode manuel, mais pas en mode auto ou MDI. L'opérateur peut lancer l'exécution complète d'un programme de G-code en mode auto, mais pas en mode manuel ni en MDI.

source: In manual mode, each command is entered separately. In human terms a manual command might be 'turn on coolant' or 'jog X at 25 inches per minute'. These are roughly equivalent to flipping a switch or turning the hand wheel for an axis. These commands are normally handled on one of the graphical interfaces by pressing a button with the mouse or holding down a key on the keyboard. In auto mode, a similar button or key press might be used to load or start the running of a whole program of G-code that is stored in a file. In the MDI mode the operator might type in a block of code and tell the machine to execute it by pressing the <return> or <enter> key on the keyboard.
fr: En mode manuel, chaque commande est entrée séparément. En termes humains, une commande manuelle pourrait être 'active l'arrosage' ou 'déplace l'axe X à 250 millimètres par minute'. C'est en gros, équivalent à basculer un interrupteur ou à tourner la manivelle d'un axe. Ces commandes sont normalement contrôlées en pressant un bouton de l'interface graphique avec la souris ou en maintenant appuyée une touche du clavier. En mode auto, un bouton similaire ou l'appui d'une touche peut être utilisé pour charger ou lancer l'exécution complète d'un programme de G-code, stocké dans un fichier. En mode d'entrée de données manuelles (MDI) l'opérateur peut saisir un bloc de codes est dire à la machine de l'exécuter en pressant la touche 'Entrée' ou 'Return' du clavier.

source: Some motion control commands are available and will cause the same changes in motion in all modes. These include 'abort', 'estop', and 'feed rate override'). Commands like these should be self explanatory.
fr: Certaines commandes de mouvement sont disponibles et produisent les mêmes effets dans tous les modes. Il s'agit des commandes 'Abandon', 'Arrêt d'Urgence' et 'Correcteur de vitesse travail'.Ces commandes se dispensent d'explications.

source: The AXIS user interface hides some of the distinctions between Auto and the other modes by making Auto-commands available at most times. It also blurs the distinction between Manual and MDI because some Manual commands like Touch Off are actually implemented by sending MDI commands. It does this by automatically changing to the mode that is needed for the action the user has requested.
fr: L'interface utilisateur graphique AXIS supprime certaines distinctions entre Auto et les autres modes en rendant automatique la disponibilité des commandes, la plupart du temps. Il rend également floue la distinction entre Manuel et MDI parce que certaines commandes manuelles comme 'Toucher', sont également implémentées en envoyant une commande MDI. Il fait cela en changeant automatiquement le mode qui est nécessaire pour l'action que l'utilisateur a demandé.
